[
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMr54XF4WtJWlA4d80XO27R5ydPNJCw3o-4jtD0=s680-w680-h510",
    "name": "Bollywood Grill",
    "site": "https://www.bollywoodgrillcumberland.com/?utm_source=gmb&utm_medium=reservation",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-475-1477",
    "full_address": "1764 Mendon Rd #4385, Cumberland, RI 02864",
    "city": "Cumberland",
    "country": "United States of America",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9440609",
    "longitude": "-71.437034",
    "rating": "4.2",
    "reviews": "327",
    "working_hours": "Monday: 11:30 AM-3 PM,5-9:30 PM, Tuesday: Closed, Wednesday: 11:30 AM-3 PM,5-9:30 PM, Thursday: 11:30 AM-3 PM,5-9:30 PM, Friday: 11:30 AM-3 PM,5-9:30 PM, Saturday: 11:30 AM-3 PM,5-10 PM, Sunday: 11:30 AM-3 PM,5-10 PM",
    "Review 1": "My Daughter is 12 years old, She ordered the butter chicken for her and Myself so we could go to the drive in theater. We had to wait an hour and the other patrons had big bags of food. The highest price I heard the rude lady say was $57.65. and he had a lot of food, she hands Me the small bag and says $70.00 ok no problem but when My Daughter went in the bag to get her food. Everything was for 1 person, a small box of Jasmine Rice and a container of butter chicken that we could not eat individually. The hostess was rude I felt overcharged for our food purposely and we couldn't eat til we got home. I paid close to $100 for bad service and the kids running around the food in the kitchen where customers can see them. I would bring many to them but I don't want to be embarrassed because of their service. Rude lady should take a course on being a good hostess.",
    "Review 2": "We were traveling from Massachusetts to New York when we came across this restaurant and so glad we found it. It was really late and all other restaurants on the way had closed for the day. We were starving and just happened to call them to see if they were open. We reached just as they were about to close but the owners were kind to let us dine in. We had veg biryani, paneer kadai and garlic naan. Biryani ani kadai was good. The naan was slightly uncooked. The dahi raita was sour and slightly butter so we couldn't eat it. Overall good experience. The decor was nice, restrooms were clean.",
    "Review 3": "Had a dinner here with my colleague. We ordered Amritsari Dal, bhindi and garlic naans. For appetizers we wanted gobi manchurian which was not on menu but we asked. Hostess suggested we try gobi 65 which was not on menu either but she said chef will make it. It was amazing. Crunchy gobi with lots of flavor. Dal and Bhindi was awesome too. Naans we’re one of the best. It is very authentic Punjabi restaurant so if you want to eat good Punjabi food, go here.",
    "Review 4": "This is the best Indian food I have had since moving to this area. The samosas are excellent and the Chicken Vindaloo is the best I have every had. It is perfectly spicy and vinegary. If you enjoy spicy food, I highly recommend their Vindaloo. I’m sure the lamb and veggie Vindaloo would be great as well. Excellent garlic naan as well. I will absolutely be back soon!",
    "Review 5": "We enjoyed our time here. The server was quick to get the appetizer running but the entrees took longer than we expected it to be. The goat biryani was amazing as well as the chicken kadhai.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOl9JRxgBPPNfjo1Q8WPkcPv8uV7YPnEvgYu0xB=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPkLeyOI92KAyJu1bdWpRdqW2VKUF29gBPhoxhs=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMPQnJAuWcJ6xOkR6OVY2bpv7LsIsxfyrUN2cd7=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNQQuruqQYlCAK6JBdHQ2LXAILFJ-5cvoyBzruY=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMA2VF3sOBfAXDeRO9BWOvRdenGzu5tGI7M0BqP=s680-w680-h510",
    "name": "Chaska",
    "site": "https://www.chaska-usa.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-537-7900",
    "full_address": "16 Midway Rd, Cranston, RI 02920",
    "city": "Cranston",
    "country": "United States of America",
    "postal_code": "02920",
    "state": "Rhode Island",
    "latitude": "41.7637269",
    "longitude": "-71.4577055",
    "rating": "4.6",
    "reviews": "288",
    "working_hours": "Monday: 12-9 PM, Tuesday: 12-9 PM, Wednesday: 12-9 PM, Thursday: 12-9 PM, Friday: 12-9 PM, Saturday: 12-9 PM, Sunday: 12-9 PM",
    "Review 1": "Most of the food was good. Chutney can be a little less tangy as it was overpowering the taste of chicken. Amritsari Kulcha was just next level amazing though. Definitely a must try.",
    "Review 2": "Good food and good drinks right in the shopping plaza.  Paneer comes in nice large pieces that are flame grilled. They have an open concept kitchen so you can see right inside as they prepare your meal.",
    "Review 3": "We went to this amazing restaurant in spring '21 during a family trip to Newport. That was the first time we tried Indian cuisine and…OMG… we fell in love   The interior is absolutely beautiful, stylish and vibrant. The food was irresistible delicious, we couldn’t stop eating until we finished our meal to the very last crumble on the plate. Our overall experience was terrific. Thanks to the owner for the love, attention to the details and care of their place. I wish your business  prosperity for years and hope one day we’ll come back",
    "Review 4": "The flavors and combinations served here are mind blowing! Highly recommend the samosas and calamari for appetizer. We had chicken korma and lamb roganjosh for main course, and saffron pistachio dessert. Phenomenal!!l",
    "Review 5": "The food here is the best Indian food around! I love to order the mango chicken even though it's not on the menu. I drive 50 minutes out of the way to go here. The parking sucks because it's in the same lot as the rest of the stores but it's so worth it!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN-8ZgdEQzm3hgYCh6WOj4qd_O9hzj9UE1nrLAh=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOckVF17I6SdetozMkFLMb33Z9l38c5YB_cXEW1=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPjoZy2sKnwhvnnPskK8N83oZvWA1DNtTkst99z=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP-dYUYGD6NRAsnnL77vmlOICTtokSZYP6WKDDp=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPn2NnjEfg2--7ORIsf8TIGuzE6im7MHpCma-V1=s680-w680-h510",
    "name": "Chennai Express - Indian Cuisine",
    "site": "http://www.chennaiexpressri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-228-0203",
    "full_address": "745 Reservoir Ave, Cranston, RI 02910",
    "city": "Cranston",
    "country": "United States of America",
    "postal_code": "02910",
    "state": "Rhode Island",
    "latitude": "41.7797188",
    "longitude": "-71.4435842",
    "rating": "4.5",
    "reviews": "312",
    "working_hours": "Monday: 11:30 AM-2:30 PM,4:30-9 PM, Tuesday: 11:30 AM-2:30 PM,4:30-9:30 PM, Wednesday: 11:30 AM-2:30 PM,4:30-9:30 PM, Thursday: 11:30 AM-2:30 PM,4:30-9:30 PM, Friday: 11:30 AM-2:30 PM,4:30-10 PM, Saturday: 11:30 AM-2:30 PM,4:30-10 PM, Sunday: 11:30 AM-2:30 PM,4:30-9 PM",
    "Review 1": "Best ever Indian food I have tried in US. Especially try their Chicken 555 and Tawa fish you will absolutely will love that and also they serve best South Indian food items. Highly recommended 😍",
    "Review 2": "Yummm. Authentic Chole Bhatura (don’t miss). Amazing Onion Rava Masala Dosa. If you can’t imagine how one restaurant can serve both “flawless” dishes, one from Deep South and one from deep Punjab, then check them out and decide for your self.",
    "Review 3": "Management has changed, chef changed and whole experience changed. Some money making Indian wanting to just run a restaurant with stale foods! Change your decision if you ever planned to have that desperate Indian food at this place.",
    "Review 4": "I was told to try out this restaurant because it’s so good. Well I got the chicken tikka masala and the chicken was good, but it didn’t come with any rice. I called about the issue and was told if I wanted rice I’d have to pay for it. I immediately lost my appetite after that and didn’t finish the food. I paid over $20 for chicken only 😑. Very disappointing. This has to be a joke. I hope the restaurant see’s this as an error.",
    "Review 5": "Wow. This is Excellent Indian. Chennai is truly a must try.  This is as authentic Indian as you will find here in Rhode Island. I am in awe that a place this amazing sits in a hole in the wall on Reservoir Ave.  Everytime I am here the restaurant is filled with individuals enjoying their meal. Smiling, laughing and sharing time over great food. High praise to the family at Chennai for bringing us wonderful food with great flavor. You can tell they love what they do. You can taste the love in the food. Great job Chennai and thank you! We will see you soon. Pictures are of Tikki Massala and I tried the Kadai Chicken. Delish and something new for a lot of individuals.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOOTCspD0_ma1eCuB3uK1PkYKTA66-CX179UKDV=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPvoxhsR9jDktCNqfCkGmatUtnQzmxucXS-36Xf=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNuEn9IWuWGZCRGXtDLB5XCn6QdnD5q7dhwH5di=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipM9V2Z1c1RUGKdGW-k7s2N5Ud35Bb6nbKrGVtBW=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipM7xU9x0CFN22QL_i40QrSLwVUFkMArXQaF6EyJ=s680-w680-h510",
    "name": "Chennai Tiffins",
    "site": "http://www.thechennaitiffins.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-356-4471",
    "full_address": "359 Old River Rd, Manville, RI 02838",
    "city": "Manville",
    "country": "United States of America",
    "postal_code": "02838",
    "state": "Rhode Island",
    "latitude": "41.9665263",
    "longitude": "-71.4734321",
    "rating": "4.4",
    "reviews": "161",
    "working_hours": "Monday: Closed, Tuesday: 11 AM-3 PM,5-8 PM, Wednesday: 11 AM-3 PM,5-9 PM, Thursday: 11 AM-3 PM,5-9 PM, Friday: 11 AM-3 PM,5-9 PM, Saturday: 11 AM-3 PM,5-9 PM, Sunday: 11 AM-3 PM,5-8 PM",
    "Review 1": "We got a takeaway of samosa and masala Dosa from here.Samosas were good. But masala Dosas was opposite of samosas. They did not have any tase. The masala stuffing  they had stuffed it with had 0 salt and we felt like we should not have ordered the masala Dosas.",
    "Review 2": "Authentic and delicious Indian Cuisine. This food was hot and ready when I arrived to pick it up. The curry was amazing and I can’t wait to get it again!",
    "Review 3": "After ordering takeout from here several times, I can attest that Chennai Tiffins has THE most authentic South Indian food in the area, with an amazing variety of Chettinad specialties.  Some of my favorite menu items include onion pakoras, podi idli, vegetable kothu parotta, and chettinad vegetable biryani.  Very fresh, flavorful, and aromatic with a complex mixture of spices. Nice assortment of condiments (mint cilantro chutney, tamarind chutney, spicy pakora sauce, raita) as well.  Best to call in orders for pickup.  Very reasonably priced, highly recommended.",
    "Review 4": "Best place in entire RI to get authentic South Indian food. Especially It’s really good for non vegetarians items.",
    "Review 5": "The food is good, especially the Biryanis. We went there for a dine-in but it is geared more towards take away.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPia0tUiJbokkvRBsAFf3Dt7OgYudYSYWsObjSs=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMkez5Q2l0OCzzo6deKXsuAYmpY8zqM6CTgd6l3=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMPpCx_FvFmWQPXLOUTpSwHuL8jWcbcSEPpoPEd=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPIWeslwiMK3Mujc94wyy7eBuUMueiD4dBTBQTC=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN2pP2IUuaoYaBZTQKygV41GPRRQDCWKAja-heD=s680-w680-h510",
    "name": "Curry Kitchen , Authentic Indian Cuisine and Hookah Bar",
    "site": "http://ricurrykitchen.com/",
    "type": "Indian restaurant",
    "category": "Hookah bar",
    "phone": "+1 401-642-5888",
    "full_address": "259 Front St, Lincoln, RI 02865",
    "city": "Lincoln",
    "country": "United States of America",
    "postal_code": "02865",
    "state": "Rhode Island",
    "latitude": "41.9041245",
    "longitude": "-71.4102232",
    "rating": "4.5",
    "reviews": "483",
    "working_hours": "Monday: Closed, Tuesday: 11:30 AM-3 PM,4:30-10 PM, Wednesday: 11:30 AM-3 PM,4:30-10 PM, Thursday: 11:30 AM-3 PM,4:30-10 PM, Friday: 11:30 AM-3 PM,4:30-10 PM, Saturday: 11:30 AM-3 PM,4:30-10 PM, Sunday: 11:30 AM-3 PM,4:30-9:30 PM",
    "Review 1": "The food here is incredible! We found this spot on a whim and were not disappointed. The buffet is $20/person and everything is delicious. Cannot recommend this place enough!",
    "Review 2": "Really good atmosphere!! Great place to enjoy with family. Service is really fast and food is finger licking good. One of the best  chicken tandoori, kadhai chicken and Palak paneer I ever had. And price is reasonably good. One of the best Indian restaurants !!!",
    "Review 3": "Good Indian restaurant in Rhode Island. Seating is good and food is tasty. We tried chole bhature and devil's chicken.both items are tasty.",
    "Review 4": "This cozy restaurant has left the best impressions! One of the best Indian restaurant in east coast, Hospitable hosts, delicious Indian dishes, beautiful presentation. I recommend to everyone! I would like to come back here again and again. Don’t forget to try chicken momo",
    "Review 5": "Amazing food!! I tried a lot of the buffet options and was definitely NOT disappointed! There was nothing I didn't like, but the chili chicken and the goat were may absolute favorites. Very friendly staff too! It was a great experience!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOx-MlTtwGWSQIV1SuWoQrfwnDIV6zeJ6dJou1k=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipP3uhW3-a56TMz_megjYnFUwSp-xg3Uj6vlq0nj=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMqYZaHtyINZu7lAVi-WRjvj8eI8rFhGTO0gn6U=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipObkXjipygmi4PjztEAn2KZ1c2fXAuSwZkl-83M=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOCjrcFWX8FPKTJk9Qz2bS6yIMFmpHMvNgeUVCl=s680-w680-h510",
    "name": "Curry Walla Indian Cuisine",
    "site": "https://www.mealhi5.com/Curry-Walla-RI/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-354-0090",
    "full_address": "1525 Smith St, North Providence, RI 02911",
    "city": "North Providence",
    "country": "United States of America",
    "postal_code": "02911",
    "state": "Rhode Island",
    "latitude": "41.8502227",
    "longitude": "-71.4605282",
    "rating": "4.3",
    "reviews": "240",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-3 PM,5-9:30 PM, Wednesday: 10 AM-3 PM,5-9:30 PM, Thursday: 10 AM-3 PM,5-9:30 PM, Friday: 10 AM-3 PM,5-9:30 PM, Saturday: 10 AM-3 PM,5-9:30 PM, Sunday: 10 AM-3 PM,5-9:30 PM",
    "Review 1": "Curry Walla Indian Cuisine make good Indian food. After I order within no time the food was ready. The food was amazing and to much to finish.  I will be back to try more food. My first time eating Indian food.",
    "Review 2": "We went on a Sunday and I think they just opened. The service was outstanding. We had chicken vindaloo, lamb masala and chicken curry. We also got the soup, the flavor was perfectly spicy and bright.  Every bite was better than the one before.",
    "Review 3": "Nice restaurant. Good taste. Affordable prices. Ample car parking. Good enough seating.",
    "Review 4": "Decent serving sizes and courteous staff; they have to make up their mind between upscale ambience vs canteen type of food. Need to pick one of the two lanes 😊",
    "Review 5": "Visit this place on a winter afternoon for lunch with my husband and a friend. We started with non-veg platter which had chicken pakora, chicken samosa and chicken Tikka. All of these tasted fresh and did not feel like the usual frozen ones from supermarket. Then we ordered fish pakora. Along with this we ordered chicken soup little spicy. The starters were very delicious. For the main course, we ordered 2 thalis, and goat biryani. The quantity is more than usual restaurant and very delicious.The attending person, Prakash is very soft spoken and asked for feedback if the food is ok. Finally they also gave us tea before leaving.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN2bngVm3nJUEm1fGh0gAmpSAFWsLDk_jN6BNYu=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOIyDBRjg4LHVYrEEoyqE9430pF02EpXJvzbV6J=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNLPfkp1KKkua6oAxxnF2NgUh0a0gFBkjW0PdSk=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMIhJSwe-L6GMZE7LmCNfHSFnrcUQ8Aiv1y3HRM=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNFWgY_qNZPi-rFYptNX-mjurRmgsmPMIawN-BU=s680-w680-h510",
    "name": "CurryLand",
    "site": "https://newportscurryland.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-619-8574",
    "full_address": "163 JT Connell Hwy, Newport, RI 02840",
    "city": "Newport",
    "country": "United States of America",
    "postal_code": "02840",
    "state": "Rhode Island",
    "latitude": "41.5082042",
    "longitude": "-71.3172098",
    "rating": "4.2",
    "reviews": "336",
    "working_hours": "Monday: Closed, Tuesday: 11 AM-10 PM, Wednesday: 11 AM-10 PM, Thursday: 11 AM-10 PM, Friday: 11 AM-10 PM, Saturday: 11 AM-10 PM, Sunday: 11 AM-9:30 PM",
    "Review 1": "Out of all the Indian restaurants I have tried, Curryland slaps every time! So good",
    "Review 2": "I have eaten at Curryland a few times since they opened earlier this year and each time it has been excellent.  They do a great job of preparing the traditional Indian dishes and provide a customized blend upon request.  Additionally, during lunch they have a buffet that allows newcomers to Indian foods the opportunity to sample a bit of several different dishes to determine what they like.  Very friendly staff who are there to help find what you might like best.  Highly recommended to anyone who is looking for a great lunch and/or dinner.",
    "Review 3": "Excellent Indian cuisine! My family and I go here all the time, and everything we’ve tried has been delicious. The curries are a savory delight, the naan is fresh and buttery, and the chicken is succulent and well seasoned. My personal favorites are the Vegetable Samosas, and the Chicken Tika Masala.",
    "Review 4": "Authentic Indian food with great appetizers and desserts. The service was quick and food was tasty. The naans were crisp and the food quantity was good enough. Although the rates were a bit pricey, the quality of food makes up for it. Will surely visit this place again when I am in Rhode Island.",
    "Review 5": "Whenever I want Indian food. This is the place. It’s the only only good place I found in Rhode Island. The staff is welcoming and accommodating. The cooks are experts and your food comes in perfect time. The chicken tika massala and the naan blow my mind. If you come here you will not be disappointed. 🤤😋",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMEXvyLk4vKwiGpruA5E-z8XAJY_Cg-nkgdZsZD=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOeDwWeSlDSGyDrTCl5iP8cgS1YiMjIAIe189Uq=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNMVfIdhqEovZ1yc4k1jgwdGJdLSSeeWXlzssoX=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNMjbXIA5nWekTZjrqr4NB1L6u5H6cqJsRsHem1=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN2voSWj7gV-qDfKGLUMwaDyuM8cppxCkY4gFxP=s680-w680-h510",
    "name": "Godavari South Indian Restaurant",
    "site": "https://www.godavarius.com/rhodeisland",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-642-8286",
    "full_address": "356 Mendon Rd, Cumberland, RI 02864",
    "city": "Cumberland",
    "country": "United States of America",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9189122",
    "longitude": "-71.4075949",
    "rating": "4",
    "reviews": "1162",
    "working_hours": "Monday: 11 AM-2:30 PM,5:30-10 PM, Tuesday: Closed, Wednesday: 11 AM-2:30 PM,5:30-10 PM, Thursday: 11 AM-2:30 PM,5:30-10 PM, Friday: 11 AM-3:30 PM,5:30-10:30 PM, Saturday: 11 AM-3:30 PM,5:30-10:30 PM, Sunday: 11 AM-3:30 PM,5:30-10 PM",
    "Review 1": "Nice tasty food worth the money.. less oily, cooked to perfection and satisfies your taste buds!!",
    "Review 2": "My husband is from India and gets homesick occasionally for really authentic Indian meals. We came for the Sunday buffet and this absolutely hit the spot. The food is so fresh and the staff are very attentive. Great service all around. We'll definitely be back!",
    "Review 3": "Hit or miss. First time try was good so we went again and had a bad experience. The dosa, Gobi Manchuria was good. Bajji was so oily that I had to squeeze out oil. Kadai paneer was ok. We had to mix in salt and pepper to bring it to taste. Not an experience I want to have when paying good price. One another customer was so mad with the food that they were going to call the department of health for serving frozen expired food!",
    "Review 4": "The shrimp was so overcooked that it was like we were chewing on rubber. The food overall was just below average in flavor profile and execution. The only reason that this place gets a 2 star is because of how kind and welcoming the wait staff was.",
    "Review 5": "One of the best South Indian Restaurant in the area! Huge menu and all delicious! They serve lunch buffet and they even serve the Bahubali Thali - which has 50 items on the plate! I love the biryanis, Chile bhature, Idli and Dosa!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNJ9LyeWjR0-2hKBHt55JerUJfCxLSBJSPYRDeg=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMuYU-BleeCFGSCCzmr5P1EC6EdO1p752bUceA0=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipP_CpmF71BGVF4CfP53dI-DRyzm8oi5Sv4Peb9j=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO6hY2RNroR8mDZU3ccuFWVRmeopGEMUsfNGGei=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNlr7Q5Vg5RPbwucV8Ugs8Vg8dE16lOnjVDxzoK=s680-w680-h510",
    "name": "India Restaurant",
    "site": "http://www.indiarestaurant.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-421-2600",
    "full_address": "1060 Hope St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.856089",
    "longitude": "-71.3917658",
    "rating": "4.8",
    "reviews": "5137",
    "working_hours": "Monday: 11 AM-10 PM, Tuesday: 11 AM-10 PM, Wednesday: 11 AM-10 PM, Thursday: 11 AM-10 PM, Friday: 11 AM-11 PM, Saturday: 11 AM-11 PM, Sunday: 11 AM-10 PM",
    "Review 1": "This is hands-down the best Indian Restaurant in the north east! The decor, the staff and the food. Decor  - Beautiful, Staff - the sweetest. Music - Fun! Food - absolutely delicious! This was our first time & Tita made sure we had everything we need and made our experience amazing. ❤ Thank you so much team India Restaurant.  Will certainly be coming back again and again and again and again! 😇",
    "Review 2": "One of my fav spots in town, perfect for a date of any kind! Delicious food, friendly and attentive staff, strong drinks and great portions! Quality Indian food within a moody, cultural decor sure to leave a lasting impression! Do try the veggie masala and garlic naan!! You won’t regret it.",
    "Review 3": "Incredible experience at India Restaurant. The ambiance was first-rate. The server was helpful, friendly, and attentive. The food was delicious (we got the dining for two deal, getting the Mango Curry and the Fish Curry for our entrees). This was truly a memorable dining spot for me and my wife.",
    "Review 4": "I had never ventured into Indian food until meeting my partner in 2019. He finally got to take me to India and he can do it again. The door opens and the smell of curry ignites your hunger. Everything is cooked to perfection. The taste is better than imagined. Venture out and try India.",
    "Review 5": "India is one of Providence's best restaurants in general and a cultural gem for the city. The atmosphere, lighting, and general feel of the setting is perfect to match their menu. Service was excellent, very helpful in catering to any special requests. Food was delicious as expected. Many seating options, inside and outside, the menu is very fairly priced for the quality of food you are getting. A great selection of cocktails and drinks to choose from, typically busy on weekend nights but they also have an in house Henna artist doing free henna work available to patrons, a great opportunity.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNHgTj5q7_q6TH2XIAX6tafiRXW8RoFQM1nq6ID=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMuvRmhrZDKjLWmfFZM5AdehXAUNu_LFpNUn7Sb=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipM0bLHl5riN09oEesB_YjdpJG2tFAmKvDOBmSnw=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipN1jBTPCKwuAVFI2BfrRoLibWR3mcJamOC-4a0U=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Indian Accent Catering",
    "site": "http://indianaccentcatering.com/contact-us/",
    "type": "Caterer",
    "category": "Caterer",
    "phone": "+1 401-374-1872",
    "full_address": "727 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.858234",
    "longitude": "-71.391608",
    "rating": "5",
    "reviews": "1",
    "working_hours": "",
    "Review 1": "Wonderful people to work with and great quality food. They offer really good suggestions and are very considerate when thinking about the menu for your event. We used them for our wedding and did not even consider going with someone else for an upcoming event.",
    "Review 2": "",
    "Review 3": "",
    "Review 4": "",
    "Review 5": "",
    "photo 1": "NA",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipOFp-x2p03SE8cuPHCi7jeqIwVj9disqTLFvkzK=w141-h101-n-k-no-nu",
    "name": "Kabob and Curry",
    "site": "http://www.kabobandcurry.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-273-8844",
    "full_address": "261 Thayer St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.8289032",
    "longitude": "-71.4006046",
    "rating": "4.3",
    "reviews": "917",
    "working_hours": "Monday: 11 AM-9:30 PM, Tuesday: 11 AM-9:30 PM, Wednesday: 11 AM-9:30 PM, Thursday: 11 AM-9:30 PM, Friday: 11 AM-10 PM, Saturday: 11 AM-10 PM, Sunday: 11 AM-9 PM",
    "Review 1": "2nd time here! The food is incredible! It was my birthday and the perfect way to celebrate. Just such an amazing experience. Mustafa was our server and he made it a great experience. Very knowledgeable of the food and very nice. Thank you.",
    "Review 2": "Excellent food at a fair price.  Each dish nicely presented and cooked well. Service was  great. Attentive staff without being rushed. Will definitely visit again.",
    "Review 3": "The food here was excellent! The different flavors were very savory! The waiter Mustafa was a great server and made terrific recommendations, since it was my first time eating here. If you want to try something new and enjoy Indian food this place has authentic Indian cuisine!",
    "Review 4": "I ordered the lamb saag medium spice with honey ginger naan and the service was fast and the food delicious. I love coming here with friends and it’s my favorite place to get authentic Indian food!",
    "Review 5": "My favorite is their weekend Thali which you can have few small plates of curry and veggies with rice or Naan. I also like their mango curry and chicken masala with honey Naan.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMbPnAUlFvO1v294H8-u5d_yYQi9FR2xbQ90EzJ=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPnScddjBMkkuzaXWWoBd4KGzCiRsnqIHym8jJ5=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMepteyPeKNfHBuSTc3qkvv_Cv-wDWbrL1NRWrR=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNd6MzZ9rBGAZJXSEYAqueKWInMun4IAMzlg3AM=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNFYA95o8Xcr7-7mpjN9AOwGaAdT9KbIpS1ilXB=s680-w680-h510",
    "name": "Masala Indian Cuisine",
    "site": "http://masalaindiancooking.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-615-0623",
    "full_address": "35 Quaker Ln #1, West Warwick, RI 02893",
    "city": "West Warwick",
    "country": "United States of America",
    "postal_code": "02893",
    "state": "Rhode Island",
    "latitude": "41.6953022",
    "longitude": "-71.5018519",
    "rating": "4.5",
    "reviews": "368",
    "working_hours": "Monday: Closed, Tuesday: 11:30 AM-9:45 PM, Wednesday: 11:30 AM-9:45 PM, Thursday: 11:30 AM-9:45 PM, Friday: 11:30 AM-9:45 PM, Saturday: 11:30 AM-9:45 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "This was my first time ordering Indian cuisine. Let me tell you... it was DELICIOUS! I placed my order online, it was very user friendly. When I arrived, it was ready in the amount of time stated and the gentleman that rang me out was very nice and confirmed everything in my order. I will definitely be ordering from this restaurant again.... SOON!  :)",
    "Review 2": "Up until yesterday we've only have had done delivery but decided to come dine in this time. We decided to try different menu items from our usual and let me tell you that so many flavors were dancing on our tastebuds! Every bite was incredibly delicious and the food was reasonably priced for all that we got. Our waitress was very knowledgeable, attentive and informative. Will be returning for dine in and or ordering takeout again in the future.",
    "Review 3": "Another great meal at Masala. Located near to all your favorite shopping centers in Bald Hill road tucked in there West Warwick, RI and worth the drive from distance. The food is exceptional and freshly prepared if eating in like we did or with take out. The aroma and spice is wonderfully combined into both Indian and Pakistan traditional dishes that are worth the trip, like we did from North Providence! The service was personable and so very attentive and I know that Sahara will take good care of you too! Don't miss out on this local gem!",
    "Review 4": "Went for lunch. Great food and awesome hospitality. The young female waitress is very knowledgeable and passionate about her job. She made it super easy to decide on what we wanted. Always good food and nice service. Thank you for myself and wife's wonderful experience here. ❤️😊",
    "Review 5": "The food was so amazing me and my girlfriend had to order again the very next day. Staff is very nice and considerate, overall great experience will definitely be eating hear again :)",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipP3gUWDFtgMZt8-kAtkFfI9y7quU5h-kCY9qpPM=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO4NqOqO7WRMMQ3IFxDIA4PTLLP3LpjLVFwwilM=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNJEMoCnJwI1jyNJvEyZjmhxItF_JS9jE2wnHY=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO0mmlN86BufG3FlaN5odYAeHMXXklsHbZorB72=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNdo4dhzWKt5SlVs708hbAGz3qraDzBcs_rwo87=s680-w680-h510",
    "name": "Not Just Snacks",
    "site": "http://www.notjustsnacks.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-831-1150",
    "full_address": "833 Hope St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.849768",
    "longitude": "-71.394414",
    "rating": "4.4",
    "reviews": "405",
    "working_hours": "Monday: 11 AM-9 PM, Tuesday: 11 AM-9 PM, Wednesday: 11 AM-9 PM, Thursday: 11 AM-9 PM, Friday: 11 AM-9 PM, Saturday: 11 AM-9 PM, Sunday: 11 AM-9 PM",
    "Review 1": "Real india food here. I was generally satisfied with them. But the price was a little bit expencive for me.",
    "Review 2": "I got the paneer tikka masala with garlic naan and it was delicious!! Perfect seasoning and flavor.",
    "Review 3": "A descent Indian restaurant with a good food. You have so many options to choose, and every choice is a good choice if you love Indian food. Also, the place is not fancy at all and you can bring your own bottle.",
    "Review 4": "It was absolutely great. We've been to other places and this one had the best variety, the best flavoring and more personal attention.  We didn't even leave yet and already discussing going back again.",
    "Review 5": "This place is honestly the most solid, delicious, and consistent Indian restaurant in Rhode Island. Food always on point and the prices are good. My only gripe, which doesn't matter in the slightest, is that I wish they had more comfortable seating for when you decide to dine in.",
    "photo 1": "https://lh5.googleusercontent.com/p/AF1QipNoYypqa05ShzwO058z3xsvwnGOb18VVWFb3gMi=w141-h141-n-k-no-nu",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipNoYypqa05ShzwO058z3xsvwnGOb18VVWFb3gMi=w141-h141-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOd9i2MpComcXVdkqhz3uggoJbiHFGj5-Y5pC0J=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO3_6hB1vAXkoVrGOHW4N7ljRXROkujrr4AuTiL=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOgrTqNOmejD0RsuHLME6Hgl6ssSyF4vsZHUUx7=s680-w680-h510",
    "name": "Providence Biryani",
    "site": "https://providence-biryani.business.site/?utm_source=gmb&utm_medium=referral",
    "type": "Asian restaurant",
    "category": "restaurants",
    "phone": "+1 401-354-9426",
    "full_address": "65 Bath St, Providence, RI 02908",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02908",
    "state": "Rhode Island",
    "latitude": "41.8319184",
    "longitude": "-71.4241043",
    "rating": "4.2",
    "reviews": "42",
    "working_hours": "Monday: 12 PM-12 AM, Tuesday: 12 PM-12 AM, Wednesday: 12 PM-12 AM, Thursday: 12 PM-12 AM, Friday: 2 PM-12 AM, Saturday: 12 PM-12 AM, Sunday: 12 PM-12 AM",
    "Review 1": "This was not a good experience, or good food. Lamb gyro with rice was dry, lettuce was old. Will never return. But the guy who gave me the food was very nice.",
    "Review 2": "This is a takeout/pickup place only. The street view in the Google Maps is inaccurate. Please see the photo below of takeout entrance.",
    "Review 3": "Food was so yummy, chicken biryani is sooo good, very authentic. I also am a big fan of the kheer! Its also all halal",
    "Review 4": "Placed call for pick up and was told order will be ready in 25-30 min. Arrived 45 min later and was told by gentleman behind the counter \"it would be awhile\" and said he couldn't elaborate. My order was also not listed as even placed on the overhead tracker. I would recommend you try a different indian restaurant",
    "Review 5": "Bland fries are called seasoned fries . Also one item was missing from the order . The seekh kabab was broken half like someone ate the rest .",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMOidjLhbLqGMg_o4nce_6fWXhKaXCc2jbKLFM1=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMfV-4C8uyAMboA__c43_e2B4tAkKkI9x-M8a8g=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPFIo2AdbIq98NNeSs_DSJUUzJ5xZci3U9Y9BpH=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNPqtgWJgM8VXiBw9AgTzGkKS7c2BcxHmMkabcb=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOYhWCH0XH_iJw9Y2AIJgNCoSpNILwEa5X9FyC6=s680-w680-h510",
    "name": "Rasa Restaurant",
    "site": "http://www.rasarestaurantri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-398-2822",
    "full_address": "149 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "country": "United States of America",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.6618225",
    "longitude": "-71.4502543",
    "rating": "4.6",
    "reviews": "797",
    "working_hours": "Monday: 11:30 AM-9 PM, Tuesday: 11:30 AM-9 PM, Wednesday: 11:30 AM-9 PM, Thursday: 11:30 AM-9 PM, Friday: 11:30 AM-9:30 PM, Saturday: 11:30 AM-9:30 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "I got here a little late, my expectations where a bit lowered based on the fact that  I got there 15 min. Before closing. ordered the mix Grill. Owner was very focused on the quality of the meal. And man, was the meal phenomenal. Especially the lamb portion. HIGHLY RECOMMEND  you try this place.",
    "Review 2": "So SO good! The tamarind margarita was incredible, service was very friendly, and the food was amazing. There are so many things I want to go back and try. Very fairly priced - $40 each for a drink/apps/meal.",
    "Review 3": "The best Indian food I've had. Owner/Manager is very friendly and nice. Staff is wonderful. Great cocktails you will find no where else. Beautiful inside.  Nice street setup for summer nights. Easy to order on line and pick up.",
    "Review 4": "We were here for the first time and ordered take out while returning from RI to MA. The food 🥘 we ordered was Ragda Patis, Cauliflower 65, kulcha,  Veg Biryani. The portion was good and the food was 😋 tasty. The Veg biryani needs special for the attention to detail it was given while preparation.",
    "Review 5": "Outstanding Indian! The small plates and cocktails steal the show. But everything is authentic. Everything is flavorful. This is top quality Indian cuisine. Great to see South Asian Americans dining here. I have to give high marks to the cocktails. The spiced old fashioned is best old fashioned I've ever had, and the Old Monk dark and stormy is also a winner. A great find on a strip full of good and great restaurants.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNCtMkggLYz3lNrjOL2hEjpqmUcl2kiuegz_Iaw=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipN3mJrqhkIm3-jEM08pdlZABJb03hYTTKwU_bEj=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPVzpXZdWcu2BBQW2I88aD_IhpQVWWSdljGM8GN=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNDnulLY3OrJm5bxsn_kqpBgpRSmTudTweJ_BMu=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOQvI3Nm0GNDnuexccxxoD4hvJr83tVwjpw4yXS=s680-w680-h510",
    "name": "Rasoi",
    "site": "http://www.rasoirestaurant.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-728-5500",
    "full_address": "727 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.8582267",
    "longitude": "-71.3916142",
    "rating": "4.4",
    "reviews": "660",
    "working_hours": "Monday: 11:30 AM-9:30 PM, Tuesday: 11:30 AM-9:30 PM, Wednesday: 11:30 AM-9:30 PM, Thursday: 11:30 AM-9:30 PM, Friday: 11:30 AM-9:30 PM, Saturday: 11:30 AM-9:30 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "Nice place, clean. Food Was good. The drink I had, not quite my taste, but I tried something new. You can sit outside.  Clean restroom.",
    "Review 2": "I’ve been coming here for years. They always have good quality paneer. Love the food. The Chicken Tikka app is my favorite. They recently started upgrading the inside a bit at a time and I like the way it looks now. Lunch portions are a good size and super reasonable priced. (Like $10) they have a few vegan options too so I can go out with my vegan friends",
    "Review 3": "We went here on a weekend for dinner, ambience was good. Food tasted nice but was quite heavy on the stomach. We ordered dhokla, aloo tikki chaat, veg biryani and jackfruit masala. Dhokla was super dry, aloo tikki was really good, biryani was good but more like a pulao, jackfruit was okay. Servers and management are attentive and warm.",
    "Review 4": "This restaurant is the best Indian Restaurant! The food is absolutely delicious and flavorful! The employees, management and everyone there always make you feel welcome and goes out of their way to make sure you are enjoying your meal! If you haven’t been here you are missing out! I can’t even name just one favorite because everything is fantastic but if I had to it would be Shrimp Madras and Aloo Gobi!",
    "Review 5": "My friend and I went here for lunch. The lunch special was so plentiful, yummy, and affordable. My friend who is a little more high maintenance than myself was also pleased. We marveled at how clean everything was including the restroom. Service was sweet and our ice teas were marvelous. In the mood for Indian food, this is the place to go.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOXCrd3DlF_kYdJtIQP9mS1zGl8O7kzJsdC4VDk=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPwjky6WamJPT5MSx5M-QVE7VNCnA62yc33tqoI=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMeyudbnxqoIg5q0u6kPDGOrJwYNPVtPSWut8zz=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOHumny7MzRNiui0ow4TriEmsJexXEaMUJlnDSr=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOnRo-am4IB_tAWuzlho7Q_9pnU1bkpcbL-MKfk=s680-w680-h510",
    "name": "Swagat Indian Food",
    "site": "N/A",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-762-0587",
    "full_address": "480 Diamond Hill Rd, Woonsocket, RI 02895",
    "city": "Woonsocket",
    "country": "United States of America",
    "postal_code": "02895",
    "state": "Rhode Island",
    "latitude": "42.015673",
    "longitude": "-71.4975116",
    "rating": "4.7",
    "reviews": "323",
    "working_hours": "Monday: Closed, Tuesday: Closed, Wednesday: 5-9 PM, Thursday: 5-9 PM, Friday: 5-9 PM, Saturday: 11:30 AM-2:30 PM,5-9 PM, Sunday: 11:30 AM-2:30 PM,5-9 PM",
    "Review 1": "If you are new to Rhode Island, then you must try coming here. It’s great place to eat north & South Indian food.",
    "Review 2": "They serve warm and fresh food to all their guests. You see the efforts they put once you taste their menu. Everyday they have something special. Not to miss their Lunch buffet on Friday. I highly recommend it to all Indian cuisine lovers.",
    "Review 3": "My favorite restaurant we love every dish they prepare, especially pesarattu upma every weekend, idli more, all items are fresh and very good. When i got sick i ate food from them everyday by to go orders ( bought by my hubby) and my tummy was happy in recovering process. Healthy to eat everyday as well which i discovered from here fresh tasty yummy food 🍱 Thanks Andi",
    "Review 4": "The taste and quality of the food here is always consistent and tasty. The owner is very humble and willing to hear out to customers. The idlis are like a pieces of cloud and Dosa qualifies the golden color check (unlike the ghost dose that most restaurants serve). Must try if you are in this area.",
    "Review 5": "Their South Indian food cuisine is top notch, especially their dosas and chole bahture! Although the space is small there is a lot of love! The owner of the restaurant was very kind and helpful.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOFSycUXsFoj0j-_DFe2T7LSiFiPKP4T_gFgy_z=s680-w680-h510",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipPloMr86tsbV3fCow1srvmFWanYFXCmes78v6Sd=w141-h118-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNMttsk6gIMIYIVWkwDX4lvL4Nb7OS9mNUF5Zep=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPtg89ki-WDkHORcjRLXuDun3yzSZu9-I85yZ8v=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOwUXfkBedRkWVy7_wasrtxAaxUfpxcbaxvaXep=s680-w680-h510",
    "name": "Taj Indian Restaurant & Bar",
    "site": "http://tajrhodeisland.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-642-7545",
    "full_address": "49 S County Commons Way, South Kingstown, RI 02879",
    "city": "South Kingstown",
    "country": "United States of America",
    "postal_code": "02879",
    "state": "Rhode Island",
    "latitude": "41.4561248",
    "longitude": "-71.4708849",
    "rating": "4.7",
    "reviews": "150",
    "working_hours": "Monday: 11:30 AM-9 PM, Tuesday: 11:30 AM-9 PM, Wednesday: Closed, Thursday: 11:30 AM-9 PM, Friday: Closed, Saturday: 11:30 AM-9 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "I just love their food. I am a picky eater and so is my family. We love coming here for Indian food. We have also used Taj Restaurant for small event catering. They have been really great.",
    "Review 2": "Wonderful restaurant.  Service was a bit scattered, but I am giving servers a pass during the pandemic.  Most importantly, the food was delicious!  I live spicy food, but I have learned not the ask for \"hot\" in an Indian restaurant.  Medium was just fine to give me the kick I wanted without intense pain.  I had goat, and it melted in my mouth.  My wife had a vegan avocado dish.  She couldn't stop singing it's praises.  We came here to celebrate our 26th anniversary and we weren't disappointed.",
    "Review 3": "Good naan and tasty sauce. $2 extra for garlic naan vs plain naan. Dry chicken. Slow in dining service. Attentive water refills. Quiet and not busy. On the expensive side of things. Entrees can be portioned into 2 servings.",
    "Review 4": "Amazing, amazing, amazing! We were walking past this new restaurant and wanted to check it out. The food came out just amazing, the naans were full of onion and garlic making it the best we have ever tried. We also tried the fried okras which is 10/10. The cauliflower tasted great too. The waitress Ritu was also very knowledgeable and recommended some of the dishes that were outside of our comfort zone and tasted great! Will definitely come back!",
    "Review 5": "Let me first start off by saying that the food was very authentic and fresh, and I highly recommend a visit.  My only knock was most likely due to a staffing shortage, as 1 person was visible doing everything to wait on all tables.  Food took a while to arrive.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNmryKUpyLDwTroQZJTczuKsmy9P6nG7Nfw9JNG=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPlUBEoQ80F7Chk0bOBcaAOEnJf3DVWL6DZftGs=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMOYBWX77Yn5m3NwXoJipo1q7Lzm2qq_A9I4M5k=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNj92tYQLcGfBamI3FsE0znViAhslNNnEpV2HYM=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOgTNPbykLOC0_3nrF8-fv0sHskoibcJzbLcVC_=s680-w680-h510",
    "name": "Taste of India Restaurant",
    "site": "http://www.tasteofindiaprovri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-421-4355",
    "full_address": "230 Wickenden St, Providence, RI 02903",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.8195389",
    "longitude": "-71.398713",
    "rating": "3.9",
    "reviews": "341",
    "working_hours": "Monday: 11:30 AM-8:45 PM, Tuesday: Closed, Wednesday: 11:30 AM-8:45 PM, Thursday: 11:30 AM-8:45 PM, Friday: 11:30 AM-8:45 PM, Saturday: 11:30 AM-8:45 PM, Sunday: 11:30 AM-8:45 PM",
    "Review 1": "Indian restaurants are my favorite. This one was the worst I’ve been to in regards of the taste. The food has no spice, not even salt or pepper. Plus, it’s small portions and expensive. The place was nice, the waitress was nice, another employee too but unfortunately, I came here expecting to have, above all, good food.",
    "Review 2": "Great service and the food was yummy and very generous  with the portion of food I would recommend this place.",
    "Review 3": "Lamb and chicken masala were delicious and the tandoori too!! The naan and rice were so good. Definitely recommend",
    "Review 4": "Average food, staff lacks interest. not allergy aware, told me they could not guarantee specific ingredient will not be in my food (lemon juice). when asked for a piece of onion, informed me it will cost $2.25 for \"Indian salad\". I have never ever been charged extra for a piece of onion in any Indian restaurant before this.",
    "Review 5": "Great samosas, great garlic naan, great mango lassi, and great papadams. Their chicken tikka masala is also excellent and the lunch portion is generous. Reason for the four star review is their chicken vindaloo. It really lacked the spice, tang, and the wow factor that I usually get from a great vindaloo. It’s my go to dish and this left me very disappointed. However, everything else was so good I’ll definitely be back and will try something else!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipM7HIWYcqWZoye_3Ufo4OoPgcPxUo6W_cQt3lIx=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNH2UgpnAr0GOcTdiJ2Abk7BSC2rHB3FnQouni1=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNbHwSov5r9T6xJ9FS19cOLb9lVzrGK2DGgorQl=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP6eakIwoI4_wVLDhMNrJMm7gQbJdKSzA5pXBlP=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNpNuEZ3_kgPb7axHws6V1VqnPyXWOyFEAqa_gx=s680-w680-h510",
    "name": "The Punjab Indian and Himalayan Cuisine",
    "site": "https://www.beyondmenu.com/52495/johnston/the-punjab-indian-cuisine-johnston-02919.aspx?s_vid=amp-wWUVcoogxFlb51dFa_tVsA&utm_source=satellite_mobile&utm_medium=home_btn_view",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-270-5687",
    "full_address": "1565 Plainfield Pike, Johnston, RI 02919",
    "city": "Johnston",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.7917876",
    "longitude": "-71.49117",
    "rating": "4.5",
    "reviews": "363",
    "working_hours": "Monday: 11 AM-9 PM, Tuesday: Closed, Wednesday: 11 AM-9 PM, Thursday: 11 AM-9 PM, Friday: 11 AM-9 PM, Saturday: 10 AM-9 PM, Sunday: 10 AM-9 PM",
    "Review 1": "Food was fantastic and the vegetable samosas were the best I've had anywhere in a long time. My chicken curry was delicious and very plentiful. Dine in service was top notch and everyone was very pleasant and welcoming. I look forward to going back!",
    "Review 2": "Food was simply amazing !!  If you’d really wanna try some himalayan / indian food then this is the perfect place in town !! Will rate them 10/10 for the taste , food quality , cleanliness and service !!",
    "Review 3": "For folks like me we enjoy eating a eclectic variety of foods at just as many restaurants. Yet when it comes to Indian, we are looking for a local business that serves intoxicatingly aromatic and great food, to  return to over and over again. Punjab is that place. Fresh food, great service and a wonderful atmosphere. That and all at the best prices within 20 miles of any establishment serving Indian around!?  Moments from 295 right there on plainfield pike, so do not miss out!! You will not be sorry!",
    "Review 4": "Had a one of a kind experience! Everything from the service, to the food, to the environment, it was great! We got here at 8pm-ish and we got excellent service! You don't normally see that! Our waiter was attentive and friendly! Even brought out a spice he wanted us to try and it was amazing! Really, felt like a VIP or something at this place! Oh and their menu, literally is amazing!",
    "Review 5": "Ordered food to go and it was ready in a flash and still nice and hot when we ate it.  Had butter chicken and ordered medium heat which was the right amount for me.  Also ordered garlic naan and ginger/honey naan.  Both good. Lots and lots of ginger so it you do not like whole ginger this wouldn’t be for you. I happen to love it so was delighted. Very clean and easy to find.  Will dine in next time for the full experience.  Portions a little smaller than our typical go to place for Indian food - that’s the only reason for the 4 stars.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNKNOZzUKj4UqgdmRs80Jj7_USkXTsTyLCbwjpP=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipN39QePh4UdNODrLIylu8R70_49uJ01-YtKHdOx=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOlWFPJeGxdbSq4WdauSCWWlePeNGam529vijf3=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMp3MBEU62Q0gM5iuYNJKvOlcdCE4e9x99NRZk7=s680-w680-h510"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipMAAojSSMmHX0xbXSl6WK6g789KgR7UCZDbh0VH=w141-h141-n-k-no-nu",
    "name": "KOLACHI Pakistani Restaurant",
    "site": "https://www.kolachirestaurant.com/",
    "type": "Pakistani restaurant",
    "category": "restaurants",
    "phone": "(401) 231-4249",
    "full_address": "100 George Waterman Rd, Johnston, RI 02919",
    "city": "",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.842530",
    "longitude": "-71.486010",
    "rating": "4.6",
    "reviews": "39",
    "working_hours": "Wednesday:11 AM–9 PM, Thursday:11 AM–9 PM, Friday:11 AM–9 PM, Saturday:11 AM–9 PM, Sunday: 10 AM–9 PM, Monday: Closed, Tuesday: 11 AM–9 PM",
    "Review 1": "Warm and genuine service, complimentary salad with a delicious spicy cilantro sauce. Food was great and the atmosphere was comfortable despite no music playing. It was a shame for this place to be empty on a Saturday night!",
    "Review 2": "Food was amazing,  chapli kabab were so big the chicken tikka was really good very juicy.,Naan is soo soft and buttery,Nihari was so tasty muttan Briyani was also very yummy its a great place to go if you want some amazing desi food they also serve breakfast i will definitly be going again😁.",
    "Review 3": "We ordered food for takeout from here and thoroughly enjoyed every bite of it. I had the Chapli kebab and the white karahi, which were simply phenomenal. This place definitely lived up to my expectations, and we will undoubtedly order from here again.",
    "Review 4": "Great place, loved it very much. Nihari was good and so was the Hakeem. They had nice service. Definitely will come back.",
    "Review 5": "I recently had the pleasure of trying KOLACHI's nihari and it was absolutely amazing! The flavors were bold and the meat was incredibly tender. I was truly impressed by the quality of the dish. I highly recommend KOLACHI to anyone in search of authentic, delicious Pakistani cuisine. Five stars!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMUPmPFjg_8mjNLsFQb1PmEFwfTKDe6ACfvrDg6=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPFBnxvXTGgY7W2YKMz5E-GeNOCm1UTTnWaC_3b=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPgaPJhoO-4nIDZWXdWNNo8omXtmakduKUrUDe-=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPEYwKmfMoyfC2GVE4_NgbxVAZxmH8iir6odmxD=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPn6loA68nFUxoByyb7HLJvNgQYqbSjdc6Ll1Fi=s680-w680-h510",
    "name": "Mehfil Indian Cuisine",
    "site": "https://mehfilri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "(401) 488-4297",
    "full_address": "828 Diamond Hill Rd, Woonsocket, RI 02895",
    "city": "Woonsocket",
    "country": "United States of America",
    "postal_code": "02895",
    "state": "Rhode Island",
    "latitude": "42.015890",
    "longitude": "-71.491010",
    "rating": "4.9",
    "reviews": "22",
    "working_hours": "Wednesday: 11:30 AM–2:30 PM, 5–10 PM, Thursday: 11:30 AM–2:30 PM, 5–10 PM, Friday: 11:30 AM–2:30 PM, 5–10:30 PM, Saturday:12–3:30 PM, 5–10:30 PM, Sunday:12–3:30 PM, 5–9:30 PM, Monday: Closed, Tuesday: 11:30 AM–2:30 PM, 5–10 PM",
    "Review 1": "We did order both veg and non veg appetizers and main course, food was fantastic, very good ambiance and owner and staff were very very hospitable. Strongly recommend this restaurant for Indian cuisine and delicacy foods",
    "Review 2": "Finally an Indian restaurant in Woonsocket! I got veg samosas, chicken tiki masala, butter chicken & garlic naan. Everything was delicious. My fav was the tiki masala. It had so much flavor. The chicken was white breast meat and was nice & tender. Samosas are a good deal since you get 3 per order. I wish them luck.",
    "Review 3": "A hidden gem. My husband and I really enjoyed our dinner. Friendly helpful staff. All food was delicious and timely. Very clean as well. Will be returning",
    "Review 4": "Everything was delicious!  We got the butter chicken, garlic naan bread, and paneer tikka masala and they were both so good!!! I can’t wait to try other menu items.",
    "Review 5": "It's a new India Restaurant in the vicinity and it's really good. The taste is far better compared to many competitors nearby. We tried Mutton Biriyani, Chilli Chicken, Chepala Pulusu(Fish curry). Every dish was perfect. Must try India Restaurant.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNVaYZO_R3mslV-mvTTm-wfeyzMnGU59xDUSwsI=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOIBUpCz_Bos7GZXFmYuMThBHQrleLblPeWBlE8=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNvoWSM2q-Mv1w8r0rHgyZXuEqSabwkdg2JwCXM=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP84KYobUQaRfZpHR-UfQNN9MaWugM3g3YOa6YL=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNPoJqfBYUmvyqE3D-AglHwHfgr5s9g1V5-LBrs=s680-w680-h510",
    "name": "J mart",
    "site": "N/A",
    "type": "Indian grocery store",
    "category": "Indian grocery store",
    "phone": "+1 401-433-2530",
    "full_address": "654 Bullocks Point Ave, Riverside, RI 02915",
    "city": "Riverside",
    "country": "United States of America",
    "postal_code": "02915",
    "state": "Rhode Island",
    "latitude": "41.75854",
    "longitude": "-71.359463",
    "rating": "3.1",
    "reviews": "15",
    "working_hours": "Monday: 7:30 AM-9 PM, Tuesday: 7:30 AM-9 PM, Wednesday: 7:30 AM-9 PM, Thursday: 7:30 AM-9 PM, Friday: 7:30 AM-9 PM, Saturday: 7:30 AM-9 PM, Sunday: Closed",
    "Review 1": "Super sour attitude and changes price without any notice. No signs or anything. He also is EXTREMELY rude when someone pays in change, like yeah I get that sometimes it’s a pain to count but come on. It’s not rocket science. No need to embarrass the customers in front of others like he does. What a douche",
    "Review 2": "Easy Local in & out grab what you need quick stop.Jug of water,chips,soda,ciggs etc.I shop here many times a month for the quick thing you need.Well kept establishment.",
    "Review 3": "Best quick store around great prices on everything",
    "Review 4": "Sells energy drinks and tobacco to minors.",
    "Review 5": "Love this store, super convenient. The owner is an absolute pleasure to talk to, always good energy and vibes going there.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOtkaq_BYWyNJDa2MxG4bjWpN_bb7zKMg4oPBmJ=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNoih0PUmicN9mJAPZc4JXN0RSOMMLiHrgZFaLL=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipP_Utod2qgjZeZPc3gUfYQwEtPsDx3oTzd-L3Ni=s680-w680-h510",
    "photo 4": "https://lh5.googleusercontent.com/p/AF1QipPD1unpULl5a8nVoWFDQm-oyuVPe5MYdUFL0TFq=w141-h176-n-k-no-nu"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMWtkq7_BxzzofA5XTHU-iV55E70zXv54oA2C3I=s680-w680-h510",
    "name": "Not Just Spices",
    "site": "http://notjustsnacks.com/grocery-store/",
    "type": "Spice store",
    "category": "Spice store",
    "phone": "+1 401-351-6555",
    "full_address": "836 Hope St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.8499241",
    "longitude": "-71.3947921",
    "rating": "4.5",
    "reviews": "115",
    "working_hours": "Monday: 10 AM-9 PM, Tuesday: 10 AM-9 PM, Wednesday: 10 AM-9 PM, Thursday: 10 AM-9 PM, Friday: 10 AM-9 PM, Saturday: 10 AM-9 PM, Sunday: 10 AM-9 PM",
    "Review 1": "This store has many, many spices, as well as other (often hard to find) things. A very unique and special store in Providence.",
    "Review 2": "The selection here is amazing. And. And everyone I've encountered has been super nice. Not just snacks across the street is equally as amazingThe selection here is amazing. And. And everyone I've encountered has been super nice. Not just snacks across the street is equally as amazing",
    "Review 3": "Nice little Indian grocery, good location. If you need an Indian space they have it, but maybe not the brand or specific type you are familiar with from other better stocked Indian grocery stores. It isn't bad, just less variety what I consider normal. But when you need something it is conveniently  located  in East Providence.",
    "Review 4": "Markup is significantly higher and have just the basic essentials compared to the stores in North Attleboro.",
    "Review 5": "One of the best places to buy Indian groceries. The vegetables are always fresh particularly the okra. Excellent selection of all the spices and frozen stuff that you need. Most importantly the uncle who works there is the sweetest person on the planet :)",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNv3ffg0uN-l3TgkREeAbXeBhZJVWgxc7kLnbHq=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipM9Z1tIhSS2cIru9wiRMAv_LFwO1xhgCg1-fkvZ=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOLj9kFFsBu1IIbkfk7_fCiseRhwXysJaCdFWLa=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO1qR-4sGIqXoN7SnBzz1cp-SsEirL8H_9LSgqi=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOoGooUEjg6zP5V0qkqTQroFA90HfUB29G1uBEM=s680-w680-h510",
    "name": "Apna Bazar Food Mart LLC",
    "site": "N/A",
    "type": "Grocery store",
    "category": "Grocery store",
    "phone": "+1 401-724-7200",
    "full_address": "282 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.8709712",
    "longitude": "-71.3868367",
    "rating": "4.5",
    "reviews": "195",
    "working_hours": "Monday: 10 AM-8 PM, Tuesday: 10 AM-8 PM, Wednesday: 10 AM-8 PM, Thursday: 10 AM-8 PM, Friday: 10 AM-8 PM, Saturday: 10 AM-8 PM, Sunday: 10 AM-7 PM",
    "Review 1": "The best place in Rhode island to pick and choose halal meat. Very cordial and friendly staff. Please make your order in advance to avoid wait time as the shop is always busy. Nice  Indian and Pakistani groceries. Highly recommended",
    "Review 2": "They have fresh meat . You have to place an order in advance on call before 1 pm. They don't take advance orders or walkins because of how busy they are once you order the meat you want they give you a call when it's ready to pick up. Not a lot of grocery items but the best place in RI to get fresh meat. I almost order chicken and goat from here every week and never had any complaints about the quality of the meat. The people inside are also very helpful",
    "Review 3": "Asian/ Indian Groceries store, with Best Goat and ChickenMeat in and around Providence area!!! Order early that way you need not wait here for them to cut meat.",
    "Review 4": "Best place to buy meat. Great people. Would recommend to place an order on call before visit as they are well occupied on weekends. My to go place for buying Goat and chicken meat. You can also buy other groceries items here.",
    "Review 5": "Great place for shopping Halal food. They are extremely economical and have almost every Asian item especially for Pakistani, Indian and Bangladeshi communities. Ideal for people studying in Brown University or living across Providence as a whole.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipP0qbEEmEaH7EnGEFeVEpdGO9ODe2ihQ5mrYOFG=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOCRKwPWSAhvJoaNMYAD1pGSX8JQuk8AhhzavAY=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOw3hX6ieWkfiliqNIESr5tUUK5dl1VnosFuLXt=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOkzbp04lsqj2R-qyumwpRlHF2iQhzuHwH1Szv9=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN9fsxJs6WuMBphVTlImOGLYw8xRXH-BTSh5EmA=s680-w680-h510",
    "name": "Quicklly",
    "site": "https://www.quicklly.com/",
    "type": "Online store",
    "category": "Online store",
    "phone": "(224)366-0987",
    "full_address": "Website",
    "city": "online",
    "country": "United States of America",
    "postal_code": "",
    "state": "Online",
    "latitude": "N/A",
    "longitude": "N/A",
    "rating": "4.8",
    "reviews": "124",
    "working_hours": "Wednesday\tOpen 24 hours,Thursday\tOpen 24 hours,Friday\tOpen 24 hours,Saturday\tOpen 24 hours,Sunday\tOpen 24 hours,Monday\tOpen 24 hours,Tuesday\tOpen 24 hours",
    "Review 1": "Great site to buy Indian groceries and vegetables. The same day delivery is very convenient. Only concern I have is some of the prices are a little high. Also, it would be good if we could order from Patel brothers store too in this site.",
    "Review 2": "Awesome service provided. Particularly for Indian grocery. Free door step delivery. Only one suggestion, try to add Patel Brothers from Devan Street, Chicago to your list. It would provide us variety of options. Thanks for your service.",
    "Review 3": "Love the service!! So convenient to get fresh groceries at your doorstep! The delivery guys are super friendly. First time they asked us to come out to the main gate so I requested if they can come to my door and the delivery person very nicely agreed and now delivers at my doorstep! I was also hesistant if the groceries would be fresh, but after having used them for about 3-4 months, I can safely say that the groceries are very fresh, infact sometimes more fresh than you would find at the store! I had my parents visiting from India and it was super convenient to have fresh vegetables at home for them like they get in India! I would love to see improvements to the website- like picking items from my last order, additional stores/restaurants serviced. Great job guys!!",
    "Review 4": "Timely service, different stored to order indian grocery from. Giving 4 stars because the website is not full fledged feature rich as you would expect but it's sufficient to place an order. It has friendly service as well. In case you are missing any items from the order drop them an email and you will be refunded (experienced).",
    "Review 5": "Worst customer experience. I ordered 2 butcher boy corn oil online for ~$50 each and they called after I already placed the order that the price just went up. Therefore, they wanted to charge me the extra amount even though online it shows the $50. I said no and they canceled the order saying out of stock. This is not how you treat customers.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPOae58imY5EwLnt8V6bLIR82cwT2Mo9O8TA6B2=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO8AanGbzBv1X34HwiI7Q-Pxnjy752Hvb0c9vca=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPmyD-Zo7XBMiUFSpDlMzvGHiGh4spwEfA4CnIC=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOQWjJNiEBG2wUUc7qpoBrgOXehowx-mwaSZO7z=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipP-7HWkoAYxACSxf26ALnsjqNChNLNiecuxpzSj=s680-w680-h510",
    "name": "Henna by Ruhi",
    "site": "http://hennabyruhi.com/",
    "type": "Artist",
    "category": "Artist",
    "phone": "+1 401-440-9425",
    "full_address": "N/A",
    "city": "Lincoln",
    "country": "United States of America",
    "postal_code": "None",
    "state": "Rhode Island",
    "latitude": "44.205388",
    "longitude": "-70.306596",
    "rating": "5",
    "reviews": "25",
    "working_hours": "Monday: 12-9 PM, Tuesday: 12-9 PM, Wednesday: 12-9 PM, Thursday: 12-9 PM, Friday: 12-9 PM, Saturday: 12-9 PM, Sunday: 12-9 PM",
    "Review 1": "Roohi was amazing!! From the moment I contacted Roohi, she was helpful, kind and very professional! She did my wedding henna and henna for about 40 of our wedding guests! Everyone loved their designs! Roohi is detailed, artistic and ensures everything looks great! I cannot recommend her enough!",
    "Review 2": "Roohi is an amazing artist that uses the top quality henna. She had done my Mehndi for my wedding along with a partner for the bridal party. I can’t say enough good things, and the design lasted with great color thanks to her care advice. I’d highly recommend Henna by Ruhi, thank you so much!",
    "Review 3": "Ruhi is AMAZING! She did my bridal henna and my partner’s and my mother’s! She even came to our wedding venue and did “simple” designs for our guests! I say “simple” because they were so beautiful and intricate! She was so fun and kind AND so focused and efficient! Highly recommend working with Ruhi!!",
    "Review 4": "I was extremely happy with my henna for my wedding, all thanks to Ruhi! She was super accommodating and friendly as well which only made the henna process even more fun! Her designs are absolutely beautiful and she works with such ease which is very interesting to watch. All my friends and family loved her work!",
    "Review 5": "Roohi was amazing! My henna turned out wonderful. I asked her for elephants and she did then so beautifully even though she has never done them before. My mom and some of my bridesmaids got their henna done by her too and loved her. We all had such a nice time with her. She was easy to talk to you and so friendly!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNnYKwjTWrmK11hv-aIQhQcYL770i6EDySN-n3K=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipM_5T7sNP3g6eoi7SBFU2D9-N7iu_btG0SxvKKV=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipN2ZJ9BpD-FHvBy1p8QHaSruPsGrGXBjReB77ug=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP3JhBk-8LqKS5ujzg6aZ-uigwbqFFeJavXXEkr=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "henna by amina",
    "site": "http://www.facebook.com/pages/Henna-by-Amina/280865545263092?sk=info",
    "type": "Tattoo artist",
    "category": "Tattoo artist",
    "phone": "+1 401-999-2068",
    "full_address": "535 Roosevelt Ave, Central Falls, RI 02863",
    "city": "Central Falls",
    "country": "United States of America",
    "postal_code": "02863",
    "state": "Rhode Island",
    "latitude": "41.8868572",
    "longitude": "-71.3816732",
    "rating": "4.4",
    "reviews": "7",
    "working_hours": "Monday: Closed, Tuesday: Closed, Wednesday: 6-7 PM, Thursday: 6-7 PM, Friday: Closed, Saturday: 9 AM-7 PM, Sunday: 9 AM-7 PM",
    "Review 1": "I had a wonderful experience with Amina. From now on I will always recommend her for hanna tattoos. Not only is she awesome at what she does, she is also very down to earth and kind. I can honestly say that she is blessed. Thank you for the  beautiful creation.",
    "Review 2": "Amina is the most professional, humble and super sweet person I have ever had the pleasure of doing business with. I got all 4 of my kids and their friends  Henna Tattoos for their birthday. Absolutely amazing experience! Will recommend to anyone , anytime! Want to be a birthday show stopper?!? Hire her!! You won’t regret it!!",
    "Review 3": "",
    "Review 4": "",
    "Review 5": "",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipM3QTzJ3G0gWGGVLrjAp92anl7qYT0VEDE2G1Ac=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Sabira Eyebrow Threading",
    "site": "http://sabiraeyebrow.com/",
    "type": "Eyebrow bar",
    "category": "Eyebrow bar",
    "phone": "+1 401-328-9144",
    "full_address": "216 Willett Ave, Riverside, RI 02915",
    "city": "Riverside",
    "country": "United States of America",
    "postal_code": "02915",
    "state": "Rhode Island",
    "latitude": "41.7751734",
    "longitude": "-71.3554613",
    "rating": "5",
    "reviews": "12",
    "working_hours": "Monday: 10 AM-5:30 PM, Tuesday: 2:30-5:30 PM, Wednesday: 2:30-5:30 PM, Thursday: 2:30-5:30 PM, Friday: 10 AM-5:30 PM, Saturday: 10 AM-5 PM, Sunday: 10 AM-5 PM",
    "Review 1": "I just left with the perfect eyebrows.  Highly recommend",
    "Review 2": "Excellent service! Sabira did an awesome job on my eyebrows. I will be back.",
    "Review 3": "She does an excellent job. I came here on a whim and I was so surprised at how overtime she has gotten my eyebrows to fill out and become more even. The place is very clean and she is sweet and professional.",
    "Review 4": "Sabira does a great job. Love the shape of my eyebrows. I would definitely recommend her!",
    "Review 5": "If you want AMAZING eyebrows come here! She takes her time when doing my full face and my eyebrows come out perfect every time! I’m glad I took the chance to try this place out! Highly recommend ! 5++++++",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNiei8bu0rMs3O0JKlAOwyQIzIoaNoUSzTQiAQW=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNXTi7ueThRgPFuGGQAGmQchu89FJcsoFH48_Tq=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOnFcw_gf0X_HCOkridr-LhFol33zZcdYtwamaG=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPX5Xw0EI-N1uzaphtO28M5KydV-6h_u9TmiWPi=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Royal Eyebrows Threading",
    "site": "N/A",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-943-3339",
    "full_address": "39 Phenix Ave, Cranston, RI 02920",
    "city": "Cranston",
    "country": "United States of America",
    "postal_code": "02920",
    "state": "Rhode Island",
    "latitude": "41.7823758",
    "longitude": "-71.4666719",
    "rating": "4.6",
    "reviews": "60",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 11 AM-4 PM",
    "Review 1": "Great job. My daughters come here too.",
    "Review 2": "I would highly reccomend this salon, they do a fantastic job with the eye brow threading. Very satisfied !",
    "Review 3": "The only place I trust with my eyebrows. The place is very sanitary. They are completely professional and do an amazing job.  They take their time and ensure you are happy with the results. I would NEVER go anywhere else.",
    "Review 4": "Jeanie was super friendly and really good at her job. She threaded my eyebrows without hurting me. This is the first time ever that I have walked out of there without my eyebrows being bright red. I told her to keep them as thick as possible, and she gave me what I wanted. Thank you!",
    "Review 5": "I have been going to Royal Eyebrows threading for years now. I switched after another place cut my eyebrow. She is so gentle and they do an amazing job! Prices are perfect for the service and the facials are amazing too!",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPFtYe-6Jt6AU3X7JixCiD4sdMyNsCGjovGewpE=s680-w680-h510",
    "name": "Threading Queen",
    "site": "https://www.facebook.com/threadingqueenz/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-353-2949",
    "full_address": "1860 Mineral Spring Ave, Providence, RI 02904",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02904",
    "state": "Rhode Island",
    "latitude": "41.860768",
    "longitude": "-71.464462",
    "rating": "4.8",
    "reviews": "34",
    "working_hours": "Monday: Closed, Tuesday: Closed, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 10 AM-6 PM, Saturday: 10 AM-6 PM, Sunday: Closed",
    "Review 1": "It was my first time coming here and she did an amazing job with my brows. Quick and light handed. She’s also kind and a great conversationalist. I’ll definitely be coming back!",
    "Review 2": "Girl does an awesome job!",
    "Review 3": "If you don’t get your brows done by Cheryl, welppppp you need to start! She does such an amazing job and has so many years of experience! Most places do what they think is best for you without asking but Cheryl always makes sure you get what you want!",
    "Review 4": "Cheryl did an AMAZING job on my lashes and eyebrows. She is so kind and precise with her work. She is super friendly with her clients and keeps the salon sanitized at all times. Deff recommend to others!",
    "Review 5": "Threading Queen is by far the best threading salon that I've found in Rhode Island. And it totally lives up to its name. Cheryl is a true professional and does an amazing job. Aside from the incredible work, she's also extremely friendly, making for an always pleasant experience! I'm glad I found this spot! :)",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOXvQRlAy5mEPlsCtHAEYDNk_NQCiOXt1g1lb3K=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOTyuqkNCn_cwEB_0eC7107nH44ZHlWqxZiTpwY=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipM69sgINJZxi7gWSK8eRpqjuF52KvevgCjDootg=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOD08vI7AVBs37-k6ms4OYbuJWQQ0GzFYoRc-Wt=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread - Barrington",
    "site": "https://www.salonthread.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-289-2733",
    "full_address": "188 County Rd, Barrington, RI 02806",
    "city": "Barrington",
    "country": "United States of America",
    "postal_code": "02806",
    "state": "Rhode Island",
    "latitude": "41.7373402",
    "longitude": "-71.3045838",
    "rating": "4.5",
    "reviews": "23",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Honestly, very kind tech. However, it took so long to have them done, she kept having to make adjustments and I felt a lack of confidence. I also feel as though they came out thinner than I had ever had them. Very kind, but not what I wanted or expected....",
    "Review 2": "Excellent monthly payment option with automatic deductions. Grupa was very nice and professional. My wife attends monthly and has always had exceptional results with Grupa. Tell them Sha from Australia sent you!",
    "Review 3": "So good to be back to RI. Stopped in tonight and signed up for the monthly threading membership. Feel excellent after getting my face threaded. Thank you Salon Thread! I'm feeling like a whole new person.",
    "Review 4": "Friendly and welcoming. Great service and thorough threading...never rushed. You can't beat the monthly plan. It is worth it for me since I have my full face threaded, including brows and lip, on a regular basis.  I can go as many times as I want for this service for 1 monthly fee. Highly recommend it.",
    "Review 5": "They are nothing short of amazing! This was my first threading experience and I couldn't have asked for better results! They listened to all my requests and gave great recommendations for future visits. My thin brows end up looking so much fuller and I don't have to fill them in with pencil anymore! I will never pick up a pair of tweezers again.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMwg2uZ-xFc-IyVjDOSh6P4mEzl3EonOaS72bqT=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Shubh Beauty",
    "site": "http://www.shubhbeauty.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14012801701",
    "full_address": "51 Silver Spring St #700, Providence, RI 02904",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02904",
    "state": "Rhode Island",
    "latitude": "41.8452529",
    "longitude": "-71.4164205",
    "rating": "4.4",
    "reviews": "15",
    "working_hours": "Monday: 10 AM-7:30 PM, Tuesday: 10 AM-7:30 PM, Wednesday: 10 AM-7:30 PM, Thursday: 10 AM-7:30 PM, Friday: 10 AM-7:30 PM, Saturday: 10 AM-7:30 PM, Sunday: 10 AM-5 PM",
    "Review 1": "Their work is amazing! Only place I go for my eyebrows to be threaded! Thank you ladies for your amazing work🙂",
    "Review 2": "I love the way my eyebrows look and I got lashes too this time and one of my lashes lifted up and they were very gracious about fixing it for me. I recommend going there ❤",
    "Review 3": "Do not  I repeat do not do your eyelashes extension with this company. They uses hair glue on your eyelashes 👀 which is not save. Soon he lady started doing my lashes my eyes started itching getting red and my nose started runny itchy. I saw the black hair glue which they wrapped a brown paper on to cover the hair glue label.  When I asked, if she was using hair glue on my eyelashes, she said no. Smh I paid $35 for nothing 😒 😪 I took off the lashes right away.  Why use hair glue on someone eyes 👀 🤔",
    "Review 4": "Got my eyebrows wax by Mrs. Nikki, she was very friendly and kind and I would recommend her any time.Donawea",
    "Review 5": "Don't go here if you're getting waxed. As they were waxing (Brazilian wax) I looked over and saw she was double dipping directly into the wax pot. When I brought it to their attention they said I was the \"first\" wax of the day but it was 4 pm and I had just seen a woman leave the room before me. Long story short they are unsanitary and don't take the time to perform safe hygiene on their clients. The owner even mentioned that her employee was new and normally they don’t do that, however even after admitting that they would still not give me a refund. You're better off spending more money at a reputable place that is safe.",
    "photo 1": "",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPszfZAzBmCRwEVG_799IcYHbO-PfNoMAfags5s=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPAuhCvd4HecYxZgTlia9NQo5vbLo4BXCsN8yoJ=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipN3XO4mZcngkCxCmQ0c8JOdkMp6noYn1wTUjJGg=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h510",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017286637",
    "full_address": "85 Power Rd, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.862287",
    "longitude": "-71.4124361",
    "rating": "4.5",
    "reviews": "212",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "Love this place. I recommend Sukhy she’s the ONLY one I trust with my brows. If she’s not there I’m not coming! Brow tinting is on point too!",
    "Review 2": "I love this place,everytime I come I leave with more than just brows done. DEB IS MY GIRL!!",
    "Review 3": "Because I came here for the first time and I’ve never been treated that bad… owner was straight up rude. And kept twisting and turning my head during the threading. She asked about the color I wanted for my tint and I wasn’t sure…. She walked away and left me sitting there . I’ll never be back here and I hope my friends stop using this business also. Very unfriendly and unprofessional for a beauty business. Never again",
    "Review 4": "i have a bad experience every time i go each eyebrow comes out different and never looks the same i tell the person to fix it and they still don’t look the same i will not be coming back to this place",
    "Review 5": "First of all I don’t really review but I have to for them.. Honestly, I’ve been going to Suhky’s for years and they never fail. I can say I’m so picky when it comes to my eyebrows because I don’t know how to do makeup so what’s on my face is stuck until the next time.. SHE SLAYS EVERYTIME!!! The shape, the arch, the thinness. ETC. I tell everyone to go there and I forever will!! Mind you the pictures added are from 2016. 2019. And 2022. QUALITY.",
    "photo 1": "https://lh5.googleusercontent.com/p/AF1QipOYG-wEdHz4Fm6dpxEb3b72AXrgazZEgGDJ95Wl=w141-h235-n-k-no-nu",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMva-WXD0SLLofcnDAzVqkZGguPPdl__mcp3yBa=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipONs8o5K8JNZRROZqsb128_9IShiHL3D6nj0CGU=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h511",
    "name": "Sukhy's Threading Johnston",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "1 401-649-4275",
    "full_address": "1417 Atwood Ave, Johnston, RI 02919",
    "city": "Johnston",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.818990",
    "longitude": "-71.496870",
    "rating": "4.3",
    "reviews": "38",
    "working_hours": "Wednesday: 9 AM–6 PM,Thursday: 9 AM–6 PM,Friday        9 AM–6 PM,Saturday: 9 AM–6 PM,Sunday: Closed,Monday: Closed, Tuesday: 9 AM–6 PM",
    "Review 1": "Horrible experience. The girl I had was soo rude. All she did was talk the whole time she did my brows.  The left one ended up smaller than the right and I had to fill it in.  So rude I will NEVER go there again.  I will tell all my friends to NEVER step foot in there.  RUDE !!",
    "Review 2": "I went today to get my eyebrows done and unfortunately I won’t be returning. Not once but twice they messed up my brows.  This time I got two different shapes.  It’s not first time time they have done them there before but the last two ladies it’s not know what they aware doing.  I have the shape all you have to do is clean around them.  Sorry but won’t be returning.    1/17/ 2020 After an unfortunate visit I surprised, the owner reached out and wanted to know what happed.  Glad she reached out And fixed my eyebrows.  I will return to her location thank you!",
    "Review 3": "I've never been to this location usually go to the Pawtucket one but the same ladies work in all of them. There was only one woman there but she was quick and efficient never left anybody waiting more than a few minutes. I went for a threading and tint, she was gentle thank God cuz a couple of them... mannn... and she did a okay job on them. tbh there's only one lady that gets my brows exactly the way I like them but I go there like once every couple months just to remind me where to pluck, n I don't see her much so I always forget her name.",
    "Review 4": "This place is very clean and tidy! They do a beautiful job with the threading and they come out perfectly even each time! Their pricing is also very fair. I highly recommend!",
    "Review 5": "I was reading someone’s review and I had the exact same experience my eyebrows got messed up two different shapes. I always have to let them regrow before I can go back hoping this time they won’t get messed up. Sadly they do. Some might ask why do I keep going there; because I went there before and this lady did a great job hope to find her there again. Anyways I saw that the owner reached out to the lady and did them her self hopefully she’ll see this and reach out!",
    "photo 1": "https://lh5.googleusercontent.com/p/AF1QipOYG-wEdHz4Fm6dpxEb3b72AXrgazZEgGDJ95Wl=w141-h235-n-k-no-nu",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h511",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMva-WXD0SLLofcnDAzVqkZGguPPdl__mcp3yBa=s680-w680-h511",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipONs8o5K8JNZRROZqsb128_9IShiHL3D6nj0CGU=s680-w680-h511"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN6kBGPXlwbyE7GnsnFlkrQ-3BpCkfvO6qdVCYh=s680-w680-h510",
    "name": "I Thread And Lash Spa - Providence , RI",
    "site": "https://squareup.com/appointments/book/e973ydqkjhhewc/LAWM4R0YRCHXM/services?rwg_token=ADQ7psR3YppRdethaFTmHLFh8IFptJswnySyUllExoIehnMU225ERaZvAAf7Am8tu7rKTkSbqBKFAw-zYN6V-8X5kNeNArQc_Q%3D%3D",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 215-5243",
    "full_address": "1 Providence Pl store # 5020, Providence, RI 02903",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.827599",
    "longitude": "-71.416191",
    "rating": "4.6",
    "reviews": "209",
    "working_hours": "Wednesday\t11 AM–8 PM,Thursday\t11 AM–8 PM,Friday\t10 AM–9 PM,Saturday\t10 AM–9 PM,Sunday\t11 AM–6 PM,Monday\t11 AM–8 PM,Tuesday\t11 AM–8 PM",
    "Review 1": "Nice service and beautiful henna,we will be surely back👍🏻",
    "Review 2": "We came here with my daughters and their friends for Henna. They were amazing and so friendly. Very talented. I highly recommend coming here!",
    "Review 3": "I received henna for the first time and was not disappointed! Wonderful service and really polite staff, stopped and asked if it was going okay multiple times to make sure I liked it and I'm very happy with the results. I believe her name was Nita but I'm very forgetful. Either way, I would definitely go back to get it again. Good price and great work, very pleased customer!",
    "Review 4": "I love the way this girl did my lashes she’s very gentle and kind and it’s a very understanding and easy place to be at she’s very gentle and all the people are nice and have amazing energy come now!!😩",
    "Review 5": "Amazing service with very welcoming staff. My threader Saima was patient and did an amazing job will definitely be back.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN6kBGPXlwbyE7GnsnFlkrQ-3BpCkfvO6qdVCYh=s680-w680-h510",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipN7Y58HGe0J0tgKXwBU8_DtQu4ULML5fNtpif1i=w141-h235-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOmHZfNpybPgzRDMoafKpmwIp7RqRrnp3CBKwrD=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPzltn5P6ibxyWEkD71urN3Dazxj5hwRcNTisXw=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMLMBred0MY1AXN-ZhZc_utLU5hgOYErydBqp6l=s680-w680-h510",
    "name": "Smiley Eyes Eyebrow Threading",
    "site": "http://smileyeyethreading.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-347-5098",
    "full_address": "774 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "country": "United States of America",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.653889",
    "longitude": "-71.454585",
    "rating": "4.9",
    "reviews": "244",
    "working_hours": "Monday: 11 AM-6:30 PM, Tuesday: 10 AM-6:30 PM, Wednesday: 10 AM-6:30 PM, Thursday: 10 AM-6:30 PM, Friday: 9:30 AM-6:30 PM, Saturday: 9:30 AM-6:30 PM, Sunday: Closed",
    "Review 1": "I have never had such a positive experience with eyebrow threading! I was in and out in 10 minutes and I feel like I look amazing. Plus, it barely even hurt compared to previous experiences.",
    "Review 2": "The women who work there are amazing. Sarah gave me excellent advice and great service. I would recommend this business",
    "Review 3": "So friendly every time I go and I bring my friends with me to get theirs done too! They always give helpful tips and suggestions! Reasonable price as well!",
    "Review 4": "Smiley eyes is my happy place. Priya and her staff are experienced perfectionists who offer threading, eyebrow & eyelash tinting, waxing and more. The salon is conveniently located, offers parking, and is extremely clean.",
    "Review 5": "I love going here for my brows. I get different people sometimes and even then everyone seems to know what they’re doing in that department. Plus, I love their cashapp rewards and the digital system they have for payment in general. I read earlier reviews about rude customer service and I never experienced that. Maybe it’s because I am usually too shy to strike up conversation but even when they do happen everyone is really polite. So next time you decide to go somewhere that charges 2x for brows like Ulta, don’t. Support small businesses and go here. Make sure to tip.",
    "photo 1": "",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNKxYpjNYerwmrH34RgmrPsTiuRsHJA7sa8Le7w=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMGiPoFDnh5llBfhaRJWYoJm4S-Ord_ZCXehbFC=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPIr-ZslauOduwMyA0ca642MvhEg4p41A1EXWDx=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNSFC7RnB97cGcAuSfvglcu4o-cCo_8I4W3Ujlj=s680-w680-h510",
    "name": "SPECTRUM-INDIA",
    "site": "http://www.spectrumindiastore.com/",
    "type": "Clothing store",
    "category": "Clothing store",
    "phone": "1 401-421-1010",
    "full_address": "252 Thayer St, Providence, RI 02906",
    "city": "Providence",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.8286728",
    "longitude": "-71.4008532",
    "rating": "4.6",
    "reviews": "235",
    "working_hours": "Monday: 10 AM-9 PM, Tuesday: 10 AM-9 PM, Wednesday: 10 AM-9 PM, Thursday: 10 AM-9 PM, Friday: 10 AM-10 PM, Saturday: 10 AM-10 PM, Sunday: 10 AM-9 PM",
    "Review 1": "This is a beautiful store. I highly recommend for anyone into spirituality, Buddhism, prayer, crystals, witchcraft, or just curious about Indian, native, or Buddhist culture. This place is a great source of ritual and cultural supplies that may be hard to come-by in their authentic form. They are genuine products, not like you would find on amazon, and are sourced from a small business. They have beautiful jewelry, books, lots of crystals, clothing, incense, and amazing décor. They also offer henna and tarot card readings. They staff is always friendly and happy to help or teach you about their specialties. Always worth a visit, and affordable prices. This is a genuine store that I love!",
    "Review 2": "I've been shopping there since I was young now my daughter shopping here and it's still the same place I love it",
    "Review 3": "While a bit musky, this niche store is packed with goods ranging from authentic Indian cultural items, to Hinduism, as well as to mysticism. Staff are generally helpful and the prices are OK.",
    "Review 4": "Loved the different varieties of sage! Can't wait to try the white sage with dried rose petals. It's gonna smell amazing! Great spot! Glad I came in",
    "Review 5": "Spectrum India is a Thayer Street staple! I've been coming here since high school and it truly is a fantastic store. Yes, there are cheaper things on Amazon, but this is the only place where you can chat with Jagdish, while you're picking out your crystals and scarves. My bangle collection is out of this world after almost 20 years of stopping in after dinner at Andreas.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNdFJBm0IimQbdO-GdZq-Ad9WvdY0vQ-o_BWQ3c=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMmXn42sBjZtD40LEkYBjfWXyvWYLvCWDttZIo3=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOC2dgdExeE_wc-4mT0pGsxekpUgHqyJS5CgDsH=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP9iTvKr1CF9Y6p2D7HZ0s1N1r6klgXacKo-6OJ=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Adini",
    "site": "http://www.adini.com/",
    "type": "Clothing store",
    "category": "Clothing store",
    "phone": "1 800-556-2443",
    "full_address": "308 E School St, Woonsocket, RI 02895",
    "city": "Woonsocket",
    "postal_code": "02895",
    "state": "Rhode Island",
    "latitude": "42.011702",
    "longitude": "-71.508161",
    "rating": "4",
    "reviews": "1",
    "working_hours": "Monday: 10 AM-5:30 PM, Tuesday: 10 AM-5:30 PM, Wednesday: 10 AM-5:30 PM, Thursday: 10 AM-5:30 PM, Friday: 10 AM-5:30 PM, Saturday: Closed, Sunday: Closed",
    "Review 1": "NA",
    "Review 2": "NA",
    "Review 3": "NA",
    "Review 4": "NA",
    "Review 5": "NA",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "NA",
    "name": "Sumaira's collection USA",
    "site": "N/A",
    "type": "Women's clothing store",
    "category": "Women's clothing store",
    "phone": "1 508-496-4398",
    "full_address": "NA",
    "city": "",
    "postal_code": "None",
    "state": "Rhode Island",
    "latitude": "35.5714472",
    "longitude": "-97.170432",
    "rating": "5",
    "reviews": "2",
    "working_hours": "Monday: Open 24 hours, Tuesday: Open 24 hours, Wednesday: Open 24 hours, Thursday: Open 24 hours, Friday: Open 24 hours, Saturday: Open 24 hours, Sunday: Open 24 hours",
    "Review 1": "Such pretty and amazing quality south Asian clothing. Worth more than five stars. Owner is so nice and friendly, I've had previous great experiences with her and hope to have many more in the future.",
    "Review 2": "Best pakistani, Indian, Bangladeshi stiched clothing, Men, Women, Children, Bridal, partywear....",
    "Review 3": "NA",
    "Review 4": "NA",
    "Review 5": "NA",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPBX2L4b7bOamXkA_1priKG3zFF7nIgpBSXpF_w=s680-w680-h510",
    "name": "DesiClik.com",
    "site": "https://www.desiclik.com/",
    "type": "South Asian clothing",
    "category": "Online store",
    "phone": "1 516-495-3374",
    "full_address": "Online",
    "city": "Website",
    "postal_code": "online",
    "state": "online",
    "latitude": "36.9497546",
    "longitude": "-96.96164",
    "rating": "4.4",
    "reviews": "181",
    "working_hours": "Monday: Open 24 hours, Tuesday: Open 24 hours, Wednesday: Open 24 hours, Thursday: Open 24 hours, Friday: Open 24 hours, Saturday: Open 24 hours, Sunday: Open 24 hours",
    "Review 1": "Great 999 Silver coin. Price nice too. Fast shipping. Would recommend",
    "Review 2": "I had ordered two falls for my sarees. Desiclik was very quick in shipping and delivering the product. Only issue was selecting the right shade of red. I was just lucky that the red I got matched with my saree color. Probably if you reach out to them, they may help you with the right shade as well.",
    "Review 3": "I ordered some disposable utensils for Indian wedding. We have not used them yet but the quality looks really nice. The order was shipped instantly and arrived right on time. And the customer service was excellent when contacted.",
    "Review 4": "Good prices. No shipping charges provide an added incentive. Prompt shipments. I will definitely continue shopping with DesiClik.",
    "Review 5": "I can trust DESICLIK for future online order. Service was excellent and price was comparable with other sellers. If service and price is comparable as expected in future, we are going to be repeated customer. We are placing another order soon!!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOJCKW2unI3mQoWHbQlhjOxpxDdKK44FEyCI2Xw=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipP-RWRcR2Ks68KwAM-P2haIFLC8sLRNXrJcUa4d=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipN9GRcFVaPNtZ_XLMJZUQyDcAOn4dDopRMOREjY=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMagwWQBN2BRnNDmRD_pXcXkOVUwI6TFEVItROO=s680-w680-h510"
  },
  {
    "photo 5": "N/A",
    "name": "Mohikas By Archana Soni",
    "site": "https://www.facebook.com/mohikasArchana/",
    "type": "Indian Clothing",
    "category": "Indian Clothing",
    "phone": "7048044608",
    "full_address": "24 Forest view drive, Cumberland, RI",
    "city": "Cumberland",
    "postal_code": "",
    "state": "Rhode Island",
    "latitude": "N/A",
    "longitude": "N/A",
    "rating": "N/A",
    "reviews": "N/A",
    "working_hours": "Open 24 hours",
    "Review 1": "N/A",
    "Review 2": "N/A",
    "Review 3": "N/A",
    "Review 4": "N/A",
    "Review 5": "N/A",
    "photo 1": "N/A",
    "photo 2": "N/A",
    "photo 3": "N/A",
    "photo 4": "N/A"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipOKdWr0xj7px-fhYo_hgaw_O2a4l9bmvASYzNSh=w141-h141-n-k-no-nu",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017286637",
    "full_address": "85 Power Rd, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.862287",
    "longitude": "-71.4124361",
    "rating": "4.5",
    "reviews": "212",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "Love this place. I recommend Sukhy she’s the ONLY one I trust with my brows. If she’s not there I’m not coming! Brow tinting is on point too!",
    "Review 2": "I love this place,everytime I come I leave with more than just brows done. DEB IS MY GIRL!!",
    "Review 3": "Because I came here for the first time and I’ve never been treated that bad… owner was straight up rude. And kept twisting and turning my head during the threading. She asked about the color I wanted for my tint and I wasn’t sure…. She walked away and left me sitting there . I’ll never be back here and I hope my friends stop using this business also. Very unfriendly and unprofessional for a beauty business. Never again",
    "Review 4": "i have a bad experience every time i go each eyebrow comes out different and never looks the same i tell the person to fix it and they still don’t look the same i will not be coming back to this place",
    "Review 5": "First of all I don’t really review but I have to for them.. Honestly, I’ve been going to Suhky’s for years and they never fail. I can say I’m so picky when it comes to my eyebrows because I don’t know how to do makeup so what’s on my face is stuck until the next time.. SHE SLAYS EVERYTIME!!! The shape, the arch, the thinness. ETC. I tell everyone to go there and I forever will!! Mind you the pictures added are from 2016. 2019. And 2022. QUALITY.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMUuR1ZhR-D63zlMSzwU-bD4YqFzYs3ZlF4XTCG=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPexeDwBYixNTbgBwux4_qjPKa7Qd2lH-Zf93mw=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMP8vPaTSwUJPpmVCSjFxwAZM1Fx6sqQSi_fv1z=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMwEYJMnplgXdLpwcaEKTBw8sXqF8Ow8bQh2-xB=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMed1ggNR3kpT_yT4owoLNEnSoZrFxSpysda3tE=s680-w680-h510",
    "name": "Aviva Threading Salon",
    "site": "https://avivathreadingsalon.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14014664656",
    "full_address": "301 Wickenden St, Providence, RI 02903",
    "city": "Providence",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.819402",
    "longitude": "-71.397158",
    "rating": "4.8",
    "reviews": "81",
    "working_hours": "Monday: 10 AM-6 PM, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 10 AM-6 PM, Saturday: 10 AM-5 PM, Sunday: Closed",
    "Review 1": "Very nice lady , efficient and definitely knows what she is doing. I loved how my eyebrows turned out, will be going back soon",
    "Review 2": "I was visiting Providence and Newport and decided to get my eyebrows threaded since I didn’t have a chance before leaving on vacation. This was such a great experience in a beautiful and clean environment. The prices were more than reasonable and I will definitely frequent again on my next trip to Providence.",
    "Review 3": "Can’t rave enough about this establishment. Very friendly, warm owner who goes above and beyond to listen to you and deliver. I honestly came here not knowing what to expect and she comforted me well. My eyebrow came out sharp and full just how I like them. My lip and chin were done perfect and with great ease. Thread is high quality and the salon is clean. It smells good in there:)",
    "Review 4": "I get Male eyebrow threading here. Owner operated. Same women every single time you come back. Great prices. BEST SERVICE!!",
    "Review 5": "Very nice shop. The lady there always does extremely thorough cleaning and shapes my eyebrow so nicely. My eyebrow and upper lip looks so good when done. She is the only one I trust my eyebrow with. Highly recommend",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPiAp_b5Lr6ZB16rvzzJfK_pQzleEvfIyRddju6=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOJdQYs4K3EtjdiPG3nn2IKX3A8g1FXdrCWOwJ5=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipN7cQHNYVaOXCLMI5XZ73hVRepIKp2_zzIwGT1v=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipM51PBqrFg82JEqFhArC1Wypx-LfjqTZO3pTw5o=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Devi's Threading",
    "site": "https://www.facebook.com/Devis-Indian-eyebrowsthreading-2254416521454690",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-677-9218",
    "full_address": "958 Mineral Spring Ave unit #4, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.869773",
    "longitude": "-71.4196368",
    "rating": "4.9",
    "reviews": "145",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-6:30 PM, Wednesday: 10 AM-6:30 PM, Thursday: 10 AM-6:30 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Devi does my brows perfectly every time, she has been doing my brows for a few years now she is the best.",
    "Review 2": "My mom, brother, & I have been going to Devi for years & she’s always done a great job with threading our eyebrows. I recommend going to her for sure",
    "Review 3": "Devi is opening and kind, very respectful she threads my eyebrows quickly and it didn't hurt as much!! I totally recommend on going here, the payment is perfect and the services is the top notch!! YOU'LL SHOULD TRY IT!!",
    "Review 4": "Devi is truly amazing. As someone who has thin eye brows it’s hard to find people who really knows how to bring shape and make my eyebrows look fuller. Devi never disappoints!",
    "Review 5": "I’ve been looking for an amazing eye brow threading place for the past two years since I moved to RI. I’ve tried so many and the first time I tried to visit Devi’s she was on vacation. I finally was able to go back again and try her. I told her what I wanted in the beginning and let her do her magic. She slayed my eye brows and I didn’t even have to tell her to complete a touch up at the end or anything. She shaped them perfectly and removed all of the hair outside of my eye brow shape. Love that she did it in one shot and didn’t have to have me tell her to fix anything! She’s for sure the best in RI and hiiiighly recommend her, she knows how to do eyebrows!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPSMILoRfN6MneL5UBNA85T-Tj7_BEFwRC5J-Qn=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO-2NttAgwvajFy1lYHjuAteOrIiSboCk5PJQPt=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPSMILoRfN6MneL5UBNA85T-Tj7_BEFwRC5J-Qn=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMMsgVa-4BkA1H2CjO-aq9gvCIp8n9ApP-D8YPW=s680-w680-h510"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipNWc0ZNXgwdfdneKhRp9paCITye-Irq8jbAwy0v=w141-h101-n-k-no-nu",
    "name": "Hema eyebrow threading",
    "site": "https://hemaeyebrowthreadingri.com/",
    "type": "Hair removal service",
    "category": "Hair removal service",
    "phone": "+1 401-256-3292",
    "full_address": "307 Waterman Ave, East Providence, RI 02914",
    "city": "East Providence",
    "postal_code": "02914",
    "state": "Rhode Island",
    "latitude": "41.8196386",
    "longitude": "-71.3674208",
    "rating": "5",
    "reviews": "84",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 9 AM-6:30 PM, Saturday: 9 AM-4 PM, Sunday: Closed",
    "Review 1": "Hema is a GEM. I lost trust in threading places after getting my eyebrows butchered by another place years ago. She has made me trust again and love my eyebrows all over again. She’s become my only eyebrow tech ever since I stumbled upon her last summer!!",
    "Review 2": "Hema is the only person I trust with my eyebrows. She is so professional, talented, and kind. I always leave her salon feeling confident and 100% satisfied with my experience. She is absolutely amazing I can not recommend her enough. I just had my eyebrows tinted by her for the first time and they look the best I have ever seen them. I will never go to another threader again!",
    "Review 3": "I came to Hema for a walk-in eyebrow threading/shaping appointment. She was friendly and fast and my eyebrows look great! The whole process was painless and took less than 5 minutes. I'll definitely be coming back!",
    "Review 4": "Hema is AWESOME! She is very detailed, precised and knows what exactly what she's doing. My eyebrows have never looked so good. AND she's super sweet/friendly. Trust you will not be disappointed 😙👌🏽",
    "Review 5": "Hema is absolutely amazing! She shaped my eyebrows perfectly. I was in need of some mommy time and she fixed me right on up. I can't stop staring at my eyebrows now. She was very polite, attentive and professional. The whole process was quick and painless. I would give her 10 stars if I could!! Thank you so much Hema! You're awesome! I will see you in 2 weeks.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMW6tYKOGgnobjxgcVoIgzQ-U6P8_jODVRHA_9e=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMEDM4j7-LqqkqkP396BMgoPtqO9XzSXp7ptbEV=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMPhyw3PwsR18qVp4h1TvjBe0AfIqyifLrh41I7=s680-w680-h510",
    "photo 4": "https://lh5.googleusercontent.com/p/AF1QipNWc0ZNXgwdfdneKhRp9paCITye-Irq8jbAwy0v=w141-h101-n-k-no-nu"
  },
  {
    "photo 5": "NA",
    "name": "Lucky Eyebrow Threading",
    "site": "N/A",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "NA",
    "full_address": "355 Broad St, Central Falls, RI 02863",
    "city": "Central Falls",
    "postal_code": "02863",
    "state": "Rhode Island",
    "latitude": "41.8841909",
    "longitude": "-71.3865888",
    "rating": "NA",
    "reviews": "NA",
    "working_hours": "NA",
    "Review 1": "NA",
    "Review 2": "",
    "Review 3": "",
    "Review 4": "",
    "Review 5": "",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "NA",
    "name": "Neelu's Eyebrow Threading",
    "site": "http://neelueyebrowthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "16172406024",
    "full_address": "400 Bald Hill Rd, Warwick, RI 02886",
    "city": "Warwick",
    "postal_code": "02886",
    "state": "Rhode Island",
    "latitude": "41.72445",
    "longitude": "-71.4767816",
    "rating": "2.9",
    "reviews": "49",
    "working_hours": "Monday: 10 AM-8 PM, Tuesday: 10 AM-8 PM, Wednesday: 10 AM-8 PM, Thursday: 10 AM-8 PM, Friday: 10 AM-8 PM, Saturday: 10 AM-8 PM, Sunday: 10 AM-8 PM",
    "Review 1": "I liked the results of my eyebrows once they were done, but the attitude given to me was terribly unpleasant and unprofessional. The eye rolls, scoffs, and dirty looks were unnecessary. She then began to get pushy, even though I had said it was my first time. She crossed the line when she began pushing my head back and aggressively rearranging my hands to hold up the skin, where she was threading. She made my experience unpleasant and humiliating. Beware they are not afraid to rip the skin off your face if they don’t like you. I recommend that you teach your employees how to communicate with your customers better.",
    "Review 2": "The lady (I forgot her name unfortunately) was extremely nice the first time I went here. I was with a group of friends and she offered us free Henna because we couldn't afford it at the time. She was very nice, but very pushy. I understand that it's good to try to be pushy in business, but she crossed the line a bit. Overall, it was a pretty good experience the first time, but the second time wasn't really. We couldn't decide if we wanted to get our upper lips waxed (me and my friend) and my other friend wanted an eyebrow threading. We were sitting on the couches in front when they lady said to come to the back room with her because she wanted to show us something. We said okay although we were confused as to what she wanted to show us. She took us back and then said \"Who's first\". At this point we felt we didn't have a choice although we were very nervous to do this. We told her it was our first time and she tried to comfort us, but in a very pushy way. When it was my turn to go she started immediately (I was not ready). I kept moving because I was extremely nervous and she told me to stop, but didn't give me a chance to. When she did wax my upper lip she didn't get all of it and left remnants at the top. I wish I could have given a better review, this is just my opinion of the experience.",
    "Review 3": "My first time going there was an okay experience, this lady was tall and she did an okay job with my brows. She took a decent amount of time doing each brow. I then went to go the second time, I didn’t have the same lady, this lady was much shorter, first off I was waiting out of the store, she saw me through the reflection of the mirror, but didn’t seated me because she was ON THE PHONE. Five minutes went by and she seating me, then I saw her put on her airpods, so clearly she was on a call while doing my brows. I told her I wanted cleaning no shape nothing! She did the complete opposite! She ruined my brows! My brows used to be super thick and now they are super thin!! She also did both of my brows under 10 minutes! Worst service, highly unprofessional! I literally cried when I went home. I still paid but it wasn’t worth it. Ladies don’t go here!!!  If y’all have thick brows this isn’t the place for you!",
    "Review 4": "I left a review on this site about 6-7 months ago speaking about employees charging me extra and taking tips. On their site it is listed as $10. They charge me $12 and whenever I had cash, usually a $20, they would give me $7 back, they stole extra money from me every time. November 27th, an employee came up to me, questioned me about my review and made me change my review. She was extremely rude and she straight up ambushed me. I've gone to this place for years and I felt so disrespected. Upon speaking to her I felt ambushed, and she forced me to delete my review. She was pushy and told me to lie and say that they give good service. Never again.",
    "Review 5": "I went for upper lips and the girl name SABINA is super rude and always give me a  bad look .I never go to her. But the day I went she took me for upper lips and when I told her, that my upper lips is not clean properly, she got frustrated on me and started yelling at me and keep telling me bad stuff. Who does treat there customer's like this?? I have seen SABINA and other  girls making fun of  customer's and talk in there own Nepali language. Very unprofessional staff specifically SABINA. She thinks she owns the place and she is the boss. Lots of customers have complained, but I guess the owner Neelu does not care. Please guys do not go the girl SABINA. Neelu if you really care about your customers then you need to talk to SABINA. Being rude to customers is not going to help her neither you. Respect your customers and stop making fun and speaking in your native language in front of your customer. Guys be aware about this place. Hope some action being taken against SABINA.",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipObX9Yl0DMguAKuL6dW62fX6wApymKB_qmxd9du=s680-w680-h510",
    "name": "Priya Eyebrow Threading",
    "site": "N/A",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14018257947",
    "full_address": "799 Tiogue Ave, Coventry, RI 02816",
    "city": "Coventry",
    "postal_code": "02816",
    "state": "Rhode Island",
    "latitude": "41.6819405",
    "longitude": "-71.5644795",
    "rating": "4.7",
    "reviews": "85",
    "working_hours": "Monday: 10 AM-5 PM, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-5 PM, Sunday: 10 AM-4 PM",
    "Review 1": "Absolutely fantastic! Does an amazing job on my eyebrows. I have received so many compliments since getting them done here. I used to spend a ton of money getting waxed at a spa, only $10 to get them threaded here!! Cant imagine going anywhere else now!",
    "Review 2": "I was nervous because I never had my brows threaded before. They were so kind and did a great job. I’ll definitely return",
    "Review 3": "I’ve been coming here for about two years now. Both the ladies in there are great!!! Super friendly, fair prices, non-intimidating environment (some beauty spots you get the “glares”, here you do not). They are both extremely talented and ALWAYS do a good job. I’ve gone twice a month for the last two years (besides COVID shut down) and I walk out of there feeling satisfied with their services  every single time. 10/10 highly recommend.",
    "Review 4": "I love Priya! She’s so nice and she’s the only one I trust with my eyebrows! Perfect every time!",
    "Review 5": "I was greeted as soon as I walked in and was seen immediately. I explained my particular needs and she understood. She did an excellent job with my eyebrows and I would absolutely recommend this place and see myself returning in the future.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPONsOS-cAYhrIvdl8xeX2X6FhzUptAf7D_I1Pi=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOFge1eBOCdpA3NdADO9JTxoppW3pz4zXlXfVzS=s680-w680-h510",
    "photo 3": "",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNLaPesDbqlVHK_eb8RIHPANY4A1EkA808PHvKp=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Royal Eyebrows Threading",
    "site": "N/A",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-943-3339",
    "full_address": "39 Phenix Ave, Cranston, RI 02920",
    "city": "Cranston",
    "postal_code": "02920",
    "state": "Rhode Island",
    "latitude": "41.7823758",
    "longitude": "-71.4666719",
    "rating": "4.6",
    "reviews": "60",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 11 AM-4 PM",
    "Review 1": "The only place I trust with my eyebrows. The place is very sanitary. They are completely professional and do an amazing job.  They take their time and ensure you are happy with the results. I would NEVER go anywhere else.",
    "Review 2": "Jeanie was super friendly and really good at her job. She threaded my eyebrows without hurting me. This is the first time ever that I have walked out of there without my eyebrows being bright red. I told her to keep them as thick as possible, and she gave me what I wanted. Thank you!",
    "Review 3": "Apparently I saw the worst person that works there because my experience was nothing like the previous reviews. The lady who thread my eyebrows did them way to thin and took off too much of the tail, talk about butcher shop. Thank goodness I can fill them in! Not sure I will return after this experience.",
    "Review 4": "I have been going to Royal Eyebrows threading for years now. I switched after another place cut my eyebrow. She is so gentle and they do an amazing job! Prices are perfect for the service and the facials are amazing too!",
    "Review 5": "Great local eyebrow threading place. Love the quality work they do here. They also give you a stamped card to receive a free service after multiple visits. Look at their services and prices.",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "",
    "name": "Sabira Eyebrow Threading",
    "site": "http://sabiraeyebrow.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14013289144",
    "full_address": "216 Willett Ave, Riverside, RI 02915",
    "city": "Riverside",
    "postal_code": "02915",
    "state": "Rhode Island",
    "latitude": "41.7751734",
    "longitude": "-71.3554613",
    "rating": "5",
    "reviews": "12",
    "working_hours": "Monday: 10 AM-5:30 PM, Tuesday: 2:30 PM-5:30 PM, Wednesday: 2:30 PM-5:30 PM, Thursday: 2:30 PM-5:30 PM, Friday: 10 AM-5:30 PM, Saturday: 10 AM-5 PM, Sunday: 10 AM-5 PM",
    "Review 1": "I just left with the perfect eyebrows.  Highly recommend",
    "Review 2": "Excellent service! Sabira did an awesome job on my eyebrows. I will be back.",
    "Review 3": "She does an excellent job. I came here on a whim and I was so surprised at how overtime she has gotten my eyebrows to fill out and become more even. The place is very clean and she is sweet and professional.",
    "Review 4": "Sabira does a great job. Love the shape of my eyebrows. I would definitely recommend her!",
    "Review 5": "If you want AMAZING eyebrows come here! She takes her time when doing my full face and my eyebrows come out perfect every time! I’m glad I took the chance to try this place out! Highly recommend ! 5++++++",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNiei8bu0rMs3O0JKlAOwyQIzIoaNoUSzTQiAQW=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNXTi7ueThRgPFuGGQAGmQchu89FJcsoFH48_Tq=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOnFcw_gf0X_HCOkridr-LhFol33zZcdYtwamaG=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPX5Xw0EI-N1uzaphtO28M5KydV-6h_u9TmiWPi=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14012283040",
    "full_address": "1003 Smith St, Providence, RI 02908",
    "city": "Providence",
    "postal_code": "02908",
    "state": "Rhode Island",
    "latitude": "41.8425639",
    "longitude": "-71.4446309",
    "rating": "4.2",
    "reviews": "93",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 10 AM-5 PM",
    "Review 1": "I had a membership which was great up until I needed to cancel it. I was moving out of state so I cancelled online ahead of time- but I was charged for the month. I decided to take the loss and go in one more time and informed them that I wanted to cancel due to me moving. I was told to email someone to cancel which I did immediately. The following month my card was charged again. I contacted every single location and told them I have cancelled online and emailed and they all told me that emailing was the best way to cancel. I contacted my bank at this point because it had been over a month of emailing and cancelling online and getting the run around with calling each location. My bank rectified the situation for that month and then again I find out this month I was charged AGAIN. At this point I had emailed multiple emails I was given, cancelled online multiple times and called and spoke to someone at every location with no resolution. I had to contact my bank again and request a new card because it it ridiculous that after multiple forms of communication I am still being charged for something I cant/no longer am using. Beware of getting a membership here because to cancel it is such a nightmare.",
    "Review 2": "Me and my wife go here all the time we have a membership Great service,I was wondering is this place the same as the one that just opened on Plainfield street?",
    "Review 3": "All of the workers are very nice, I love the energy and the vibes they give. The music is very soothing. And they always do such an amazing job!!! Definitely would recommend all of the ladies that work there!!❤️❤️",
    "Review 4": "My eye brows are completely different.. I did have a slight difference with the length but not shape previously. I’ve been coming here for a few months because it’s close to my house.. The technicians are usually okay and usually get the eyebrows fairly similar..but this time is way off.. honestly, I’ll probably never come back again. So disappointed.",
    "Review 5": "",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOt0rMZm2SGDAXJvvJnf1j0FZ5OSlG0PsnAB5oL=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMVcDFzQs0UcQO31k3DMq9CRll8ltVkjA4P00Vl=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMisTppLxGSP0Y5AXpkjhEQAda6MTJkrG_a1907=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPMFP3xA01QXwge4fR_tGFhVX8vcczsH750-jJ4=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread - Barrington",
    "site": "https://www.salonthread.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "14012892733",
    "full_address": "188 County Rd, Barrington, RI 02806",
    "city": "Barrington",
    "postal_code": "02806",
    "state": "Rhode Island",
    "latitude": "41.7373402",
    "longitude": "-71.3045838",
    "rating": "4.5",
    "reviews": "23",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Honestly, very kind tech. However, it took so long to have them done, she kept having to make adjustments and I felt a lack of confidence. I also feel as though they came out thinner than I had ever had them. Very kind, but not what I wanted or expected....",
    "Review 2": "Excellent monthly payment option with automatic deductions. Grupa was very nice and professional. My wife attends monthly and has always had exceptional results with Grupa. Tell them Sha from Australia sent you!",
    "Review 3": "So good to be back to RI. Stopped in tonight and signed up for the monthly threading membership. Feel excellent after getting my face threaded. Thank you Salon Thread! I'm feeling like a whole new person.",
    "Review 4": "Friendly and welcoming. Great service and thorough threading...never rushed. You can't beat the monthly plan. It is worth it for me since I have my full face threaded, including brows and lip, on a regular basis.  I can go as many times as I want for this service for 1 monthly fee. Highly recommend it.",
    "Review 5": "They are nothing short of amazing! This was my first threading experience and I couldn't have asked for better results! They listened to all my requests and gave great recommendations for future visits. My thin brows end up looking so much fuller and I don't have to fill them in with pencil anymore! I will never pick up a pair of tweezers again.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMwg2uZ-xFc-IyVjDOSh6P4mEzl3EonOaS72bqT=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Salon Thread - Down City Providence",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14014210200",
    "full_address": "211 Weybosset St, Providence, RI 02903",
    "city": "Providence",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.8217288",
    "longitude": "-71.412597",
    "rating": "4.6",
    "reviews": "42",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "I’ve been coming here for years!! I have very thin light eyebrows that sometimes are a little unkempt in weird spots. I always get a perfect, long lasting medium brown tint that lasts about a month even with me washing and wiping my face all the time! She tidies up my brows perfectly without overdoing it- something most places do even with my already thin eyebrows!! I moved about an hour away and I still only come here! I only trust her with my eyebrows!",
    "Review 2": "This place is amazing! She is professional, and precise. I've been going there for almost 2 years, and have never been disappointed. Strongly recommend!!",
    "Review 3": "Love this place great service and Egypt is so nice she a beast at this eyebrows",
    "Review 4": "I have been going here for years. the lady that works is so nice, friendly and precise every single time I get my eyebrows threaded.",
    "Review 5": "Excellent threading, beautiful studio, nice clinician in Providence location. Their other locations were not comparable. Threading skills were fair at best. They certainly could have been more welcoming.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMf6XemYoyItAmXW9J2HjTZWkcnm7ffbSRUbtlg=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO0ZC6Qa9slRSUiOoWiyirAopZsRgalwy_kGUxL=s680-w680-h510",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPBabLpXSL7M7w6uAP41qwawqtGdFsUMlsq0C06=s680-w680-h510",
    "name": "Salon Thread - Oak HIll",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14014759878",
    "full_address": "745 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.8573047",
    "longitude": "-71.3912019",
    "rating": "4.6",
    "reviews": "51",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Been coming here for yrs. Lol and will be till we move out of RI. When I find a good place for anything really I stick with it till I move or they disappoint.  But great service and always do me well. 👍🏽🙏🏽😊",
    "Review 2": "I was super happy that they opened after they were closed due to COVID. I was able to grow out my eyebrows during quarantine and they threaded them perfectly!! Not too thin and not too thick. Amazing!!😊 They’re the only place that I trust to get my eyebrows done! ☺️",
    "Review 3": "When I lived here 4.5 years ago, I always came here. They always did such a wonderful job. I just moved back to Providence, and went to get my eyebrows done and it was a horrible experience. Not only did she take one hair out at a time, she was extremely slow so it was very painful. She also didn’t listen to me, made my eyebrows too thin, then when I tried to ask her a couple questions at the end she didn’t understand what I was trying to say. So I left crying.Such a bad experience. I really loved it here and now that I live right down the street. It is more of a hassle to go to another place. But I’m definitely not coming back. Worst threading experience in my life. And I have been getting my eyebrows threaded for 10 years.",
    "Review 4": "Had a relaxing pedicure. Will go back again!",
    "Review 5": "Great place they do great eyebrows my favorite person who does amazing is pre she is friendly and kind does a great job on smith at and also Pawtucket location when she is there.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOmir4GIBiFGZ6KpzCD2oKs86HJqPh7-sM84-km=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOmf4FPbE52ESVV_nwboRcTggPWaIAhy83psPVV=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNAt1Go65xXHryzSavZnVb7TIctfPWjOAMRkbzB=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPWUaux5bAGkwBOLUNjcOQxw1FrnYjB28S79MoV=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread - The Threading Salon",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14013057330",
    "full_address": "500 Mendon Rd #1a, Cumberland, RI 02864",
    "city": "Cumberland",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9211969",
    "longitude": "-71.4103726",
    "rating": "4.2",
    "reviews": "41",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Hi ... I am so happy from this place the service I got done from the girl name Mona she did excellent job for my full face . She takes her own time to do the best I told my friends to go to Mona to get the same shape of my eyebrows. Thanks Mona to make me beautiful",
    "Review 2": "I absolutely love coming here to get my eyebrows threaded! Out of all the places I have been in the past, Salon Thread is the best one yet, Nilima does an amazing job!!!",
    "Review 3": "I have had a monthly membership with this establishment for over a year. At 17 dollars a month, I can go anytime I want, how often I want, and I always get service with a smile. In your membership, you also get free bottled water or cans of soda, plus there is a coffee machine if you so desire. Mona is my preferred eyebrow specialist as she is fantastic and makes sure there is not one hair out of place on my brows. In fact, I usually don't stop there unless I see her car parked outside. Not only does she treat me with respect, but, she also makes me feel welcomed and has this friendly vibe about her. I completely trust her with my eyebrows and that's a big deal to someone like me. I don't go anywhere else for this service! I highly recommend going at least once. I'm usually in an out within 5 minutes and there are so fast I've never spent more than 2 minutes waiting to be seen. If you're a first-timer, request Mona; you won't regret it. Two more things, there is always plenty of parking AND they are kid-friendly. They always address my 7 year old and give him a treat :) 10/10 I highly recommend!",
    "Review 4": "Today was my first time going to Threading Spot, Cumberland RI. I am absolutely AMAZED by the work and personality of Nilima. She did beautiful work to my awful eyebrows & treated me with the most respect. I recommend if you visit this location you make sure to see Nilima, you will leave 100% satisfied and wanting to come back!!!",
    "Review 5": "Nilima is extremely thorough with her threading techniques. She is receptive to feedback on the areas of focus and areas to avoid. I'm happy with the results after each session and enjoy having my monthly membership at this location as I get quality work done by Nilima while helping me save.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipODFB8n4iXsUJnRKgQtp1gA9sWBWrgW6-MnDz-Z=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Shubh Beauty",
    "site": "http://www.shubhbeauty.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14012801701",
    "full_address": "51 Silver Spring St #700, Providence, RI 02904",
    "city": "Providence",
    "postal_code": "02904",
    "state": "Rhode Island",
    "latitude": "41.8452529",
    "longitude": "-71.4164205",
    "rating": "4.4",
    "reviews": "15",
    "working_hours": "Monday: 10 AM-7:30 PM, Tuesday: 10 AM-7:30 PM, Wednesday: 10 AM-7:30 PM, Thursday: 10 AM-7:30 PM, Friday: 10 AM-7:30 PM, Saturday: 10 AM-7:30 PM, Sunday: 10 AM-5 PM",
    "Review 1": "Their work is amazing! Only place I go for my eyebrows to be threaded! Thank you ladies for your amazing work🙂",
    "Review 2": "I love the way my eyebrows look and I got lashes too this time and one of my lashes lifted up and they were very gracious about fixing it for me. I recommend going there ❤",
    "Review 3": "Do not  I repeat do not do your eyelashes extension with this company. They uses hair glue on your eyelashes 👀 which is not save. Soon he lady started doing my lashes my eyes started itching getting red and my nose started runny itchy. I saw the black hair glue which they wrapped a brown paper on to cover the hair glue label.  When I asked, if she was using hair glue on my eyelashes, she said no. Smh I paid $35 for nothing 😒 😪 I took off the lashes right away.  Why use hair glue on someone eyes 👀 🤔",
    "Review 4": "Got my eyebrows wax by Mrs. Nikki, she was very friendly and kind and I would recommend her any time.Donawea",
    "Review 5": "Don't go here if you're getting waxed. As they were waxing (Brazilian wax) I looked over and saw she was double dipping directly into the wax pot. When I brought it to their attention they said I was the \"first\" wax of the day but it was 4 pm and I had just seen a woman leave the room before me. Long story short they are unsanitary and don't take the time to perform safe hygiene on their clients. The owner even mentioned that her employee was new and normally they don’t do that, however even after admitting that they would still not give me a refund. You're better off spending more money at a reputable place that is safe.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMkUgoz36d6oHNqEE_91chuGM74abdz6uIuWxoE=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPszfZAzBmCRwEVG_799IcYHbO-PfNoMAfags5s=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPAuhCvd4HecYxZgTlia9NQo5vbLo4BXCsN8yoJ=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipN3XO4mZcngkCxCmQ0c8JOdkMp6noYn1wTUjJGg=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPzi7B6x7cihnrpHLv7jzerpBLiBit89QDrWZxW=s680-w680-h510",
    "name": "Smiley Eyes Eyebrow Threading",
    "site": "http://smileyeyethreading.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-347-5098",
    "full_address": "774 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.653889",
    "longitude": "-71.454585",
    "rating": "4.9",
    "reviews": "244",
    "working_hours": "Monday: 11 AM-6:30 PM, Tuesday: 10 AM-6:30 PM, Wednesday: 10 AM-6:30 PM, Thursday: 10 AM-6:30 PM, Friday: 9:30 AM-6:30 PM, Saturday: 9:30 AM-6:30 PM, Sunday: Closed",
    "Review 1": "I have never had such a positive experience with eyebrow threading! I was in and out in 10 minutes and I feel like I look amazing. Plus, it barely even hurt compared to previous experiences.",
    "Review 2": "The women who work there are amazing. Sarah gave me excellent advice and great service. I would recommend this business",
    "Review 3": "So friendly every time I go and I bring my friends with me to get theirs done too! They always give helpful tips and suggestions! Reasonable price as well!",
    "Review 4": "Smiley eyes is my happy place. Priya and her staff are experienced perfectionists who offer threading, eyebrow & eyelash tinting, waxing and more. The salon is conveniently located, offers parking, and is extremely clean.",
    "Review 5": "I love going here for my brows. I get different people sometimes and even then everyone seems to know what they’re doing in that department. Plus, I love their cashapp rewards and the digital system they have for payment in general. I read earlier reviews about rude customer service and I never experienced that. Maybe it’s because I am usually too shy to strike up conversation but even when they do happen everyone is really polite. So next time you decide to go somewhere that charges 2x for brows like Ulta, don’t. Support small businesses and go here. Make sure to tip.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPLsTXrTgT_0hwZxnQHZPM0lnvj_vS8rBIQlY6o=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNZcEvOUhLK0eE99JwxMQCp8JXkfb9GBgBMai_y=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNPehEzvLEvgkRi-Ksh7ZwtiLvX_IZnaq8izJyh=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMLMBred0MY1AXN-ZhZc_utLU5hgOYErydBqp6l=s680-w680-h510"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipNkhvRoUy-RHPJEzoow592RYEsulYUysXKGodch=w141-h101-n-k-no-nu",
    "name": "Stupa Threading",
    "site": "https://stupa-threading.business.site/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-885-1132",
    "full_address": "26 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.6636042",
    "longitude": "-71.4498224",
    "rating": "4.8",
    "reviews": "29",
    "working_hours": "Monday: 10 AM-5 PM, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 10 AM-5 PM",
    "Review 1": "The staff are always friendly. They even give advice and tips when your done with the session! I will always come here!!",
    "Review 2": "Been going here since they opened.  Fantastic shop.  Quick and easy.   Always find parking during the day right in front.",
    "Review 3": "I have been there yesterday ,really she did with lots of patience.I decided not to go anywhere except here. Finally I can say this is best in RI.",
    "Review 4": "My daughter and I have tried several local threading places and this one is by far the best. Our eyebrows have never looked better!",
    "Review 5": "This the BEST place for threading in the state. I have tried a few and believe this one is the best because of the friendliness of staff, cleanliness of the studio, and the service is consistently excellent. Thank you Stupa for your affordable membership!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPPIqEaNYIzPgkEatMew_INM2L2F8OaHRkKDck7=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPwo91Fm8NQ81cc3PquTkUPssO6D1rzle3fYeaI=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMW7NFP-RGJEfy3MiFZ8OYozTt3PG1ipa3G408b=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNzuWe_IgpO2ABZsAGOD55oI-Ek6Ynm-2z3a_Kl=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017286637",
    "full_address": "85 Power Rd, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.862287",
    "longitude": "-71.4124361",
    "rating": "4.5",
    "reviews": "212",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "Love this place. I recommend Sukhy she’s the ONLY one I trust with my brows. If she’s not there I’m not coming! Brow tinting is on point too!",
    "Review 2": "I love this place,everytime I come I leave with more than just brows done. DEB IS MY GIRL!!",
    "Review 3": "Because I came here for the first time and I’ve never been treated that bad… owner was straight up rude. And kept twisting and turning my head during the threading. She asked about the color I wanted for my tint and I wasn’t sure…. She walked away and left me sitting there . I’ll never be back here and I hope my friends stop using this business also. Very unfriendly and unprofessional for a beauty business. Never again",
    "Review 4": "i have a bad experience every time i go each eyebrow comes out different and never looks the same i tell the person to fix it and they still don’t look the same i will not be coming back to this place",
    "Review 5": "First of all I don’t really review but I have to for them.. Honestly, I’ve been going to Suhky’s for years and they never fail. I can say I’m so picky when it comes to my eyebrows because I don’t know how to do makeup so what’s on my face is stuck until the next time.. SHE SLAYS EVERYTIME!!! The shape, the arch, the thinness. ETC. I tell everyone to go there and I forever will!! Mind you the pictures added are from 2016. 2019. And 2022. QUALITY.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPodl0x4JP5hb5d02PBhsD1hzioq-gId_iTwg7_=s680-w680-h510",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipNLA8N0KDl7lVd-tisUYzD_DQfiFuGAg9ISd1K7=w141-h176-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNPl6mL09tt0TiNtlqnd9R69o5tBn-Xhd8TicTe=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPqYan_O1EjvZD_yRqKCYvRGSBXuVVk5paXMatx=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017380150",
    "full_address": "1535 Post Rd, Warwick, RI 02886",
    "city": "Warwick",
    "postal_code": "02886",
    "state": "Rhode Island",
    "latitude": "41.739275",
    "longitude": "-71.4334028",
    "rating": "4.5",
    "reviews": "59",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "This is the best place around. Eyebrows for $10 is so cheap and they do such a great job. The girl who did mine was so nice, did a great job, and it didn't even hurt. Best threading of my life. I highly recommend it.",
    "Review 2": "Do not waste your time here. With so many other threading places, do yourself a favor and look elsewhere. First and last time coming here. They do not know the art of eyebrow shaping, nor how to shape a thick eyebrow. You get what you pay for, and if you care about your eyebrows and how they look, pay an extra $5 more and you will be much more satisfied.",
    "Review 3": "Excellent threading by a phenomenal & friendly staff.",
    "Review 4": "Good work but not such a fan of them asking for the tip in cash. I don't always carry cash but the women even asked me to go check me car 🙄.",
    "Review 5": "I told her as soon as I sat in her chair that I was trying to grow out my eyebrows and just wanted them cleaned up and realized it was taking her quite a bit to do. She told me one eyebrow was different than the other, which I had told her I have been working on letting them fill in and she ended up reshaping them and getting rid of the growth I had. I wouldn’t recommend especially when you ask for a specific request of just cleaning them up.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNUYxYLPgqado1fLDfPMv7_8jYtPziJpJYxaFDM=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipObi0iQ446EmsqF9cZN9UhE4C1w5ipSGUf8CsZ5=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNClUeyztmSDpNGg8a8fVeji5rI7V6KcWB9aIj-=s680-w680-h510",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Sukhy's Threading Johnston",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "1 401-649-4275",
    "full_address": "1417 Atwood Ave, Johnston, RI 02919",
    "city": "Johnston",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.818990",
    "longitude": "-71.496870",
    "rating": "4.3",
    "reviews": "38",
    "working_hours": "Wednesday: 9 AM–6 PM,Thursday: 9 AM–6 PM,Friday        9 AM–6 PM,Saturday: 9 AM–6 PM,Sunday: Closed,Monday: Closed, Tuesday: 9 AM–6 PM",
    "Review 1": "Horrible experience. The girl I had was soo rude. All she did was talk the whole time she did my brows.  The left one ended up smaller than the right and I had to fill it in.  So rude I will NEVER go there again.  I will tell all my friends to NEVER step foot in there.  RUDE !!",
    "Review 2": "I went today to get my eyebrows done and unfortunately I won’t be returning. Not once but twice they messed up my brows.  This time I got two different shapes.  It’s not first time time they have done them there before but the last two ladies it’s not know what they aware doing.  I have the shape all you have to do is clean around them.  Sorry but won’t be returning.    1/17/ 2020 After an unfortunate visit I surprised, the owner reached out and wanted to know what happed.  Glad she reached out And fixed my eyebrows.  I will return to her location thank you!",
    "Review 3": "I've never been to this location usually go to the Pawtucket one but the same ladies work in all of them. There was only one woman there but she was quick and efficient never left anybody waiting more than a few minutes. I went for a threading and tint, she was gentle thank God cuz a couple of them... mannn... and she did a okay job on them. tbh there's only one lady that gets my brows exactly the way I like them but I go there like once every couple months just to remind me where to pluck, n I don't see her much so I always forget her name.",
    "Review 4": "This place is very clean and tidy! They do a beautiful job with the threading and they come out perfectly even each time! Their pricing is also very fair. I highly recommend!",
    "Review 5": "I was reading someone’s review and I had the exact same experience my eyebrows got messed up two different shapes. I always have to let them regrow before I can go back hoping this time they won’t get messed up. Sadly they do. Some might ask why do I keep going there; because I went there before and this lady did a great job hope to find her there again. Anyways I saw that the owner reached out to the lady and did them her self hopefully she’ll see this and reach out!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMchjv-Lc0pMGFmXcypJv-0Rpn3njtq2G57IYN6=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Unique Eyebrow Threading",
    "site": "N/A",
    "type": "Hair removal service",
    "category": "Hair removal service",
    "phone": "+1 401-405-0787",
    "full_address": "3335 Mendon Rd, Cumberland, RI 02864",
    "city": "Cumberland",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9766672",
    "longitude": "-71.4580152",
    "rating": "4.6",
    "reviews": "172",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 10 AM-6 PM, Saturday: 10 AM-6 PM, Sunday: 10 AM-2 PM",
    "Review 1": "Completely shocked at how I was just treated by the older woman who works here. I’m from out of state looking to get my brows done and this place had good reviews. They woman asked what shape and I said please just clean them up and keep them thick as possible. She said your eyebrows are different shape and sizes. Made me feel uncomfortable and not very nice. I said I’m sorry that’s how they grow.. she was very condescending. Then when I was done she asked me to look in the mirror and my eyes were watery (as they always are bc I have contacts and holding my eyes) so she asks if she made me cry?? Very odd experience. Then she rung me out- I didn’t feel like tipping but I gave less than I would have. Will not return. As a small business owner- it would be nice to treat people nicely. So many other nice businesses out there that I would rather spend money on:/",
    "Review 2": "I love coming here to clean my eyebrows. Very affordable, make sure to bring cash or use an onsite ATM",
    "Review 3": "I have been going here for over 10 years. They do an absolutely amazing job. I hate to write negative things on this business because I really do love them but the younger girl needs a little bit more training -it absolutely kills when she threads my eyebrows. They still look very nice though but i would prefer the two other women that have been here for years",
    "Review 4": "I don’t ever write reviews, but I just have to share that I have been visiting unique eyebrow threading since they opened in 2007. I would never think of going anywhere else but here. The staff is amazing and I just love the owner! I always walk out happy and my eyebrows and my lip come out perfect every single time!! If you are thinking about going to get your eyebrows threaded believe me it is much better than waxing and plucking like I do sometimes when I don’t have time lol this is the absolute best place to get services!",
    "Review 5": "I like going to the older lady in the first chair I’m not sure if she’s the owner but she always does an excellent job. The few times I’ve went to the younger girl in the second chair she messed up my eyebrows and had me in the chair for under a minute before she told me that I was done. I mentioned clean up only and not too thin and always leaves them super thin or a completely different shape from one another  because she rushes.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN2LxJIrmiwuddmujdRY6XvIFU_Z7E7WTm8JSc5=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "NA",
    "name": "Salon Thread",
    "site": "https://www.salonthread.com//",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "(401) 320-8484",
    "full_address": "787 Bald Hill Rd, Warwick, RI 02886",
    "city": "Warwick",
    "postal_code": "02886",
    "state": "Rhode Island",
    "latitude": "41.716940",
    "longitude": "-71.487270",
    "rating": "5",
    "reviews": "16",
    "working_hours": "Wednesday\t10 AM–7 PM,Thursday\t10 AM–7 PM,Friday\t10 AM–7 PM,Saturday\t10 AM–7 PM,Sunday\tClosed,Monday\t10 AM–7 PM,Tuesday\t10 AM–7 PM",
    "Review 1": "She is amazing! I went to her first for my brow lamination & tint, she did such an AMAZING job I had to go back for microblading and she did my eyebrows so perfect!!!! She did Hybrid Brows on me & I am VERY SATISFIED . Thanks so much ! I loveee them. The procedure wasn't painful at all and I experienced no swelling or irritation afterwards. She is a perfectionist. Book with her for your brows !!! I'm so picky when it comes to who I let do my brows She knows how to shape to frame your face. She knows what she is doing. Only person who I'm letting touch my brows from now on. Thanks She!",
    "Review 2": "She did a baby liner for me and it turned out perfect and looks super natural. The process was painless. I’m so amazed at She’s work and I’m so happy I treated myself to this. This will save me 10 mins each morning since I’m terrible at drawing on eyeliner. Highly recommend",
    "Review 3": "My Girlfriend booked a Microblading appointment. We walked in to a professional new salon space. She decided to to try Eyebrow threading and Lash Lift before her Microblading service. The results were excellent and was quick. Microblading took some time but wow what a difference in her brows! Both the technicians (Lash and Microblading) did a fine job. My girlfriend also signed up for their Unlimited monthly membership.",
    "Review 4": "She is amazing! I went to her first for my brow lamination & tint, she did such an AMAZING job I had to go back for microblading and she did my eyebrows so perfect!!!! She did Hybrid Brows on me & I am VERY SATISFIED . Thanks so much ! I loveee them. The procedure wasn't painful at all and I experienced no swelling or irritation afterwards. She is a perfectionist. Book with her for your brows !!! I'm so picky when it comes to who I let do my brows She knows how to shape to frame your face. She knows what she is doing. Only person who I'm letting touch my brows from now on. Thanks She!",
    "Review 5": "I come here regularly for lash extensions and eyebrow lamination, and I confirm their service is detail oriented and 100% satisfactory. The results always leave me in a good mood for the rest of the month, and the service is also very relaxing and enjoyable. Highly recommend!!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMqfkKuDftqIrB-8Y-4irPprFWP-qCzj1yk0yOj=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPQ1pPVyiRZewijRoNaJGtl8jonhEglFVHenxyH=s680-w680-h510",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipPcPF50VlmlPiQkmgC_wlAaudHQG1Po5nC4j0mw=w141-h176-n-k-no-nu",
    "name": "I Thread And Lash Spa - Providence , RI",
    "site": "https://squareup.com/appointments/book/e973ydqkjhhewc/LAWM4R0YRCHXM/services?rwg_token=ADQ7psR3YppRdethaFTmHLFh8IFptJswnySyUllExoIehnMU225ERaZvAAf7Am8tu7rKTkSbqBKFAw-zYN6V-8X5kNeNArQc_Q%3D%3D",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 215-5243",
    "full_address": "1 Providence Pl store # 5020, Providence, RI 02903",
    "city": "Providence",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.827600",
    "longitude": "-71.416190",
    "rating": "4.6",
    "reviews": "206",
    "working_hours": "Wednesday\t11 AM–8 PM,Thursday\t11 AM–8 PM,Friday\t10 AM–9 PM,Saturday\t10 AM–9 PM,Sunday\t11 AM–6 PM,Monday\t11 AM–8 PM,Tuesday\t11 AM–8 PM",
    "Review 1": "I was in a hurry to get primped for a job and came to I Thread and Lash Spa. I was greeted by the door and once I communicated what services I wanted it was done with quick precision and the lashes came out beautifully and my lash shape and tint are absolutely stunning. I am a permanent client now I'm in love with my eyebrows.",
    "Review 2": "This was the best experience I have ever had! She was able to not only fix the shape of my eyebrows from a wax experience gone wrong but gave me a beautiful shape and eyelashes. I have never gotten so many compliments. Recommended her to all of my friends and family! Also super sweet and really great results.",
    "Review 3": "I henna dyed my eyebrows here today and they turned out great. The technician was quick & professional.",
    "Review 4": "Everyone was soo friendly and the service is top tier. I will be coming back. The first photo is right out the salon the second photo is day two",
    "Review 5": "i was super nervous about getting my eyebrows done since this was my first time threading my eyebrows. i absolutely love how they came out! i was in and out and the manger was super patient with me. i love their business and will continue going to get my eyebrows threaded by them. i also got my henna done for the first and i love it.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOt2GLw6lNgu9PthdCZqQKqaRAkLM0jBHa_g_pf=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNYvqJUpKrtTNAL0wDlJgvXW_Rmhf4BM-zXEvgS=s680-w680-h510",
    "photo 3": "https://lh5.googleusercontent.com/p/AF1QipMuvIEIZd1T-jDrHNLzTjsr-bpbhXVbGoTAnLit=w141-h118-n-k-no-nu",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOa--eCLzE0M4swmdbyj1990nHS2fdkuM7iVaGg=s680-w680-h510",
    "name": "Renu Eyebrow Threading",
    "site": "N/A",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 921-3101",
    "full_address": "2443 W Shore Rd, Warwick, RI 02889",
    "city": "Warwick",
    "postal_code": "02889",
    "state": "Rhode Island",
    "latitude": "41.700990",
    "longitude": "-71.438450",
    "rating": "3.6",
    "reviews": "42",
    "working_hours": "Wednesday\t10:30 AM–6 PM,Thursday\t10:30 AM–6 PM,Friday\t10:30 AM–6 PM,Saturday\t10:30 AM–5 PM,Sunday\tClosed,Monday\tClosed,Tuesday\t10:30 AM–6 PM",
    "Review 1": "My go to spot! The threading lady did a great job on my eyebrows. However, there was a language barrier that was a bit tough to get around. But, if you do show a picture of what you want or explain more throughly, she will do a great job!!",
    "Review 2": "The women working was super nice! While there is a language barrier I showed her a picture of what I wanted and she matched it. She also checked in during the process to make sure I was happy :) With this service and price you cannot get anything better!!!",
    "Review 3": "They are so kind and very people-oriented :) love this spot :)))",
    "Review 4": "I love that this place is in my neighborhood - it's so convenient! The owner is very nice and does a great job. The prices are actually too cheap - I worry she won't be able to stay in business and I love having a salon for threading so close! Definitely recommend!",
    "Review 5": "I've been driving past this place for a long time and, today I decided to give it a try. I'm so glad I did! I read some other reviews and made sure I had a picture of how I wanted my brows to look. The woman did an excellent job and the pricing is GREAT!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMhFma5DSSmYA4IxnJDK6dSdKodK4UCEYw2nsA4=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNdFj9yc4XrhVZvcydmxOsxe2RKw6hTQVRMiSM3=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPA-0cRNTIvCzT-MikRs8CDB2DpIl7Ykv9CJWvE=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipON0PAtyzuStYXizJ7MJdb6JDJbRWquQEDhEo8v=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNygUltuF0NlavzrlYxUrrkF66GENlT-qoqTJGE=s680-w680-h510",
    "name": "Salon Panache",
    "site": "https://www.salonpanache.com/",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 464-4044",
    "full_address": "1103 Park Ave, Cranston, RI 02910",
    "city": "Cranston",
    "postal_code": "2910",
    "state": "Rhode Island",
    "latitude": "41.784980",
    "longitude": "-71.455240",
    "rating": "4.7",
    "reviews": "239",
    "working_hours": "Wednesday\t9 AM–7 PM,Thursday\t9 AM–7 PM,Friday\t9 AM–7 PM,Saturday\t9 AM–6 PM,Sunday\tClosed,Monday\tClosed,Tuesday\t9 AM–6 PM",
    "Review 1": "I luv coming here. Ria is amazing. She definitely knows what she's doing and doesn't cut off half of your eyebrow lol",
    "Review 2": "I visit this place atleast once a month! I’m from CT but The trip to Panache is worth the results ❤️ The staff is super sweet and quick! Thank you Panache for making my eyebrows always look on point :)",
    "Review 3": "Very friendly got in and out very quickly, very reasonably priced",
    "Review 4": "I’ve been going here for about 8 years now and I’ve never been disappointed. The staff is very friendly and all are very talented in their skill. I used to have Kelly do my eyebrows until she moved but now I have Ria and she is wonderful. Definitely would recommend!",
    "Review 5": "I usually go to Ravy’s beauty salon for eyebrows but decided to go here because they open later.. & ugh so rude.. I told the technician to cut my eyebrows first before threading she had the biggest attitude.. she threaded my eyebrows and then cut… I have very hairy/long eyebrows. I left with nothing. I never had anyone do my eyebrows under 10 minutes smh.. the owner seems very nice. But has horrible technicians",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMxZIKXyg2Nia2IG6zfCBxQWRzkyfdr37D4dzP7=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPq0f4bPuXvn4dO7-bM9aFj7ZtZ87jXoEsmWqmW=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOJ9vcgjNxf1YfSkPbhWZ2Aldv2dyJq63XZ3jFa=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPIX2s3a-FqfiT7xsOgVKOBQnyle1fYa0BU0_Ba=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNQU8nk1VFfS9SBMLvo9DrqYL6wlTJAB0BGKuWl=s680-w680-h510",
    "name": "Eyebrows First",
    "site": "N/A",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 569-9934",
    "full_address": "957 Namquid Dr, Warwick, RI 02888",
    "city": "Warwick",
    "postal_code": "2888",
    "state": "Rhode Island",
    "latitude": "41.741790",
    "longitude": "-71.395150",
    "rating": "5",
    "reviews": "12",
    "working_hours": "Wednesday\t9 AM–6 PM,Thursday\t9 AM–6 PM,Friday\t9 AM–6 PM,Saturday\t9 AM–6 PM,Sunday\t9 AM–4 PM,Monday\tClosed,Tuesday\t9 AM–6 PM",
    "Review 1": "My eyebrows and I have been on a crazy journey together for the last 20 years between shaving, waxing, plucking to threading. Sometimes they look good and sometimes I leave with no eyebrows at all, until now. I am so happy to have found this hidden gem. My eyebrows are absolutely perfect, and I leave more confident than before. I loved coming here so much I signed up for the monthly memberships and now get my whole face threaded. I highly recommend coming here to for all your threading needs.",
    "Review 2": "Polite staff. Cleanly inside. Fast service. My eye brows were horrendous mess and they cleaned it up nice 👍",
    "Review 3": "Very comforting and really good hospitality. Happy to be a customer on first opening day. 🤩",
    "Review 4": "Very comforting and really good hospitality. Happy to be a customer on first opening day. 🤩",
    "Review 5": "Finally ! I found a best place for my eyebrows threading near me…happy eyebrows🤗 happy me😍.The owners are friendly and polite. Very organized, comfortable and clean salon. The prices are reasonable and the service is amazing.They offer monthly membership with unlimited monthly services at just $17.The threading did not hurt at all😊.It’s worth the drive from anywhere in this fabulous place. Wouldn’t go anywhere else!Highly recommended!!!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPP7LE6xb9EAYDWwEkDpGQ2VwxPE3J0c1nUE4Qv=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPBFlKeO5gzwMN8Ozl1FhqCfPoQCKRk5-Pm1E7O=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOC4BHXzF05LdlGKOKtAzYI8d5Y9xDkC8taL8Hp=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNgT0ng3iAh_QLiLNZ9e-pjGRQT5G_rJfUwtvK0=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Tara's Threading & Hair Salon",
    "site": "https://www.facebook.com/TarasSalon",
    "type": "Hair Salon",
    "category": "Hair Salon",
    "phone": "(401) 729-0331",
    "full_address": "572 Smithfield Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "2860",
    "state": "Rhode Island",
    "latitude": "41.880310",
    "longitude": "-71.415690",
    "rating": "4.6",
    "reviews": "82",
    "working_hours": "Wednesday\t9 AM–7 PM,Thursday\t9 AM–7 PM,Friday\t9 AM–7 PM,Saturday\t9 AM–6 PM,Sunday\tClosed,Monday\tClosed,Tuesday\t9 AM–7 PM",
    "Review 1": "Great customer service! Tara is amazing been going to her for over 12 years love her",
    "Review 2": "I was very happy with her service and my eye brows look so good!",
    "Review 3": "Tara was amazing and did an amazing job with my eyebrows! I can't wait to go back!",
    "Review 4": "I highly recommend Tara for all your beauty needs!One on one. She gives you Full uninterrupted service n puts her heart into her work; Excellent eyebrow shaper! Convenient walk in..great hair stylist as well.peaceful,relaxing atmosphere!",
    "Review 5": "I went here for first time to get a haircut and eyebrow threding. Tara did a great job and explained the style that suits me. I liked the layers and love my hair now. She did amazing job with my eyebrows. They are beautiful. I recommend to all around the area.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMReA7UfDybOdY7qE6zKx6lEjszwBbt9SxF-eOA=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPtccyApU5vuhPtdFoIrluBI6QQEMMe5CWPijQN=s680-w680-h510",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNnZxTEwGNKUhZG6E8VLxT6o3Wqc-5lhQtot5Ls=s680-w680-h510",
    "name": "SPECTRUM-INDIA",
    "site": "http://www.spectrumindiastore.com/",
    "type": "Jewelry store",
    "category": "Metaphysical supply store",
    "phone": "+1 401-421-1010",
    "full_address": "252 Thayer St, Providence, RI 02906",
    "city": "Providence",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.8286728",
    "longitude": "-71.4008532",
    "rating": "4.6",
    "reviews": "235",
    "working_hours": "Monday: 10 AM-9 PM, Tuesday: 10 AM-9 PM, Wednesday: 10 AM-9 PM, Thursday: 10 AM-9 PM, Friday: 10 AM-10 PM, Saturday: 10 AM-10 PM, Sunday: 10 AM-9 PM",
    "Review 1": "Beautiful items i purchased to put in a Christmas bowl for my granddaughter Amiya-Rose's first Christmas 🎄 😀 😊 😍 Please contact me when you have those copper cups available 😍",
    "Review 2": "This is a beautiful store. I highly recommend for anyone into spirituality, Buddhism, prayer, crystals, witchcraft, or just curious about Indian, native, or Buddhist culture. This place is a great source of ritual and cultural supplies that may be hard to come-by in their authentic form. They are genuine products, not like you would find on amazon, and are sourced from a small business. They have beautiful jewelry, books, lots of crystals, clothing, incense, and amazing décor. They also offer henna and tarot card readings. They staff is always friendly and happy to help or teach you about their specialties. Always worth a visit, and affordable prices. This is a genuine store that I love!",
    "Review 3": "I've been shopping there since I was young now my daughter shopping here and it's still the same place I love it",
    "Review 4": "While a bit musky, this niche store is packed with goods ranging from authentic Indian cultural items, to Hinduism, as well as to mysticism. Staff are generally helpful and the prices are OK.",
    "Review 5": "Spectrum India is a Thayer Street staple! I've been coming here since high school and it truly is a fantastic store. Yes, there are cheaper things on Amazon, but this is the only place where you can chat with Jagdish, while you're picking out your crystals and scarves. My bangle collection is out of this world after almost 20 years of stopping in after dinner at Andreas.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMyJwT1DanyaLYlbtnK-1c_L-PZtOaW9Cv29VeZ=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOS6U5WFazdb4iKCZ2bs2bi_eg3p3IvcRfUfCN4=s680-w680-h510",
    "photo 3": "https://lh5.googleusercontent.com/p/AF1QipMct-Fh5Huor-a2fq3SxzyCwagPQ8zNAp7iiZzd=w141-h101-n-k-no-nu",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP0e8bA6vFi0eFvxphuap8FjuSJP23PWJn0YmNW=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "DesiClik.com",
    "site": "https://www.desiclik.com/",
    "type": "Online Store",
    "category": "Online",
    "phone": "1 516-495-3374",
    "full_address": "Online",
    "city": "Website",
    "postal_code": "online",
    "state": "online",
    "latitude": "36.9497546",
    "longitude": "-96.96164",
    "rating": "4.4",
    "reviews": "181",
    "working_hours": "Monday: Open 24 hours, Tuesday: Open 24 hours, Wednesday: Open 24 hours, Thursday: Open 24 hours, Friday: Open 24 hours, Saturday: Open 24 hours, Sunday: Open 24 hours",
    "Review 1": "Great 999 Silver coin. Price nice too. Fast shipping. Would recommend",
    "Review 2": "I had ordered two falls for my sarees. Desiclik was very quick in shipping and delivering the product. Only issue was selecting the right shade of red. I was just lucky that the red I got matched with my saree color. Probably if you reach out to them, they may help you with the right shade as well.",
    "Review 3": "One of my favorite Online stores!, such fast shipping and wonderful quality products, I will always shop here",
    "Review 4": "Good prices. No shipping charges provide an added incentive. Prompt shipments. I will definitely continue shopping with DesiClik.",
    "Review 5": "I can trust DESICLIK for future online order. Service was excellent and price was comparable with other sellers. If service and price is comparable as expected in future, we are going to be repeated customer. We are placing another order soon!!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipM1U3sBRoS5ralJvWrih1P7L00K4ZOH9wP4yqxh=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipONDOlxrVrL4zqqH2K9uckzT52VT2IFRTWD5JvT=s680-w680-h510",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipNMo5eAIPfFdQGN1uVPPd2FHMYnpnxq3SFeD4d0=w141-h141-n-k-no-nu",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017286637",
    "full_address": "85 Power Rd, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.862287",
    "longitude": "-71.4124361",
    "rating": "4.5",
    "reviews": "212",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "Love this place. I recommend Sukhy she’s the ONLY one I trust with my brows. If she’s not there I’m not coming! Brow tinting is on point too!",
    "Review 2": "I love this place,everytime I come I leave with more than just brows done. DEB IS MY GIRL!!",
    "Review 3": "Because I came here for the first time and I’ve never been treated that bad… owner was straight up rude. And kept twisting and turning my head during the threading. She asked about the color I wanted for my tint and I wasn’t sure…. She walked away and left me sitting there . I’ll never be back here and I hope my friends stop using this business also. Very unfriendly and unprofessional for a beauty business. Never again",
    "Review 4": "i have a bad experience every time i go each eyebrow comes out different and never looks the same i tell the person to fix it and they still don’t look the same i will not be coming back to this place",
    "Review 5": "First of all I don’t really review but I have to for them.. Honestly, I’ve been going to Suhky’s for years and they never fail. I can say I’m so picky when it comes to my eyebrows because I don’t know how to do makeup so what’s on my face is stuck until the next time.. SHE SLAYS EVERYTIME!!! The shape, the arch, the thinness. ETC. I tell everyone to go there and I forever will!! Mind you the pictures added are from 2016. 2019. And 2022. QUALITY.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPARSsg7GG7Di8lr5g0dvC4M8H1RkOpQcJTLckz=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNHtMTWML8JaCYVwwyVE6c0l9JvWsBplRjVjKwC=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMvV4_mkMP6Q7lrRbaF-p32lj0HtORjMsCH0MCQ=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNOoAlF_pC9g_QPoLrgaK7PshWL4L-WStTboYxA=s680-w680-h510"
  }
]
