[
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNPoJqfBYUmvyqE3D-AglHwHfgr5s9g1V5-LBrs=s680-w680-h510",
    "name": "J mart",
    "site": "N/A",
    "type": "Indian grocery store",
    "category": "Indian grocery store",
    "phone": "+1 401-433-2530",
    "full_address": "654 Bullocks Point Ave, Riverside, RI 02915",
    "city": "Riverside",
    "country": "United States of America",
    "postal_code": "02915",
    "state": "Rhode Island",
    "latitude": "41.75854",
    "longitude": "-71.359463",
    "rating": "3.1",
    "reviews": "15",
    "working_hours": "Monday: 7:30 AM-9 PM, Tuesday: 7:30 AM-9 PM, Wednesday: 7:30 AM-9 PM, Thursday: 7:30 AM-9 PM, Friday: 7:30 AM-9 PM, Saturday: 7:30 AM-9 PM, Sunday: Closed",
    "Review 1": "Super sour attitude and changes price without any notice. No signs or anything. He also is EXTREMELY rude when someone pays in change, like yeah I get that sometimes it’s a pain to count but come on. It’s not rocket science. No need to embarrass the customers in front of others like he does. What a douche",
    "Review 2": "Easy Local in & out grab what you need quick stop.Jug of water,chips,soda,ciggs etc.I shop here many times a month for the quick thing you need.Well kept establishment.",
    "Review 3": "Best quick store around great prices on everything",
    "Review 4": "Sells energy drinks and tobacco to minors.",
    "Review 5": "Love this store, super convenient. The owner is an absolute pleasure to talk to, always good energy and vibes going there.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOtkaq_BYWyNJDa2MxG4bjWpN_bb7zKMg4oPBmJ=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNoih0PUmicN9mJAPZc4JXN0RSOMMLiHrgZFaLL=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipP_Utod2qgjZeZPc3gUfYQwEtPsDx3oTzd-L3Ni=s680-w680-h510",
    "photo 4": "https://lh5.googleusercontent.com/p/AF1QipPD1unpULl5a8nVoWFDQm-oyuVPe5MYdUFL0TFq=w141-h176-n-k-no-nu"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMWtkq7_BxzzofA5XTHU-iV55E70zXv54oA2C3I=s680-w680-h510",
    "name": "Not Just Spices",
    "site": "http://notjustsnacks.com/grocery-store/",
    "type": "Spice store",
    "category": "Spice store",
    "phone": "+1 401-351-6555",
    "full_address": "836 Hope St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.8499241",
    "longitude": "-71.3947921",
    "rating": "4.5",
    "reviews": "115",
    "working_hours": "Monday: 10 AM-9 PM, Tuesday: 10 AM-9 PM, Wednesday: 10 AM-9 PM, Thursday: 10 AM-9 PM, Friday: 10 AM-9 PM, Saturday: 10 AM-9 PM, Sunday: 10 AM-9 PM",
    "Review 1": "This store has many, many spices, as well as other (often hard to find) things. A very unique and special store in Providence.",
    "Review 2": "The selection here is amazing. And. And everyone I've encountered has been super nice. Not just snacks across the street is equally as amazingThe selection here is amazing. And. And everyone I've encountered has been super nice. Not just snacks across the street is equally as amazing",
    "Review 3": "Nice little Indian grocery, good location. If you need an Indian space they have it, but maybe not the brand or specific type you are familiar with from other better stocked Indian grocery stores. It isn't bad, just less variety what I consider normal. But when you need something it is conveniently  located  in East Providence.",
    "Review 4": "Markup is significantly higher and have just the basic essentials compared to the stores in North Attleboro.",
    "Review 5": "One of the best places to buy Indian groceries. The vegetables are always fresh particularly the okra. Excellent selection of all the spices and frozen stuff that you need. Most importantly the uncle who works there is the sweetest person on the planet :)",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNv3ffg0uN-l3TgkREeAbXeBhZJVWgxc7kLnbHq=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipM9Z1tIhSS2cIru9wiRMAv_LFwO1xhgCg1-fkvZ=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOLj9kFFsBu1IIbkfk7_fCiseRhwXysJaCdFWLa=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO1qR-4sGIqXoN7SnBzz1cp-SsEirL8H_9LSgqi=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOoGooUEjg6zP5V0qkqTQroFA90HfUB29G1uBEM=s680-w680-h510",
    "name": "Apna Bazar Food Mart LLC",
    "site": "N/A",
    "type": "Grocery store",
    "category": "Grocery store",
    "phone": "+1 401-724-7200",
    "full_address": "282 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.8709712",
    "longitude": "-71.3868367",
    "rating": "4.5",
    "reviews": "195",
    "working_hours": "Monday: 10 AM-8 PM, Tuesday: 10 AM-8 PM, Wednesday: 10 AM-8 PM, Thursday: 10 AM-8 PM, Friday: 10 AM-8 PM, Saturday: 10 AM-8 PM, Sunday: 10 AM-7 PM",
    "Review 1": "The best place in Rhode island to pick and choose halal meat. Very cordial and friendly staff. Please make your order in advance to avoid wait time as the shop is always busy. Nice  Indian and Pakistani groceries. Highly recommended",
    "Review 2": "They have fresh meat . You have to place an order in advance on call before 1 pm. They don't take advance orders or walkins because of how busy they are once you order the meat you want they give you a call when it's ready to pick up. Not a lot of grocery items but the best place in RI to get fresh meat. I almost order chicken and goat from here every week and never had any complaints about the quality of the meat. The people inside are also very helpful",
    "Review 3": "Asian/ Indian Groceries store, with Best Goat and ChickenMeat in and around Providence area!!! Order early that way you need not wait here for them to cut meat.",
    "Review 4": "Best place to buy meat. Great people. Would recommend to place an order on call before visit as they are well occupied on weekends. My to go place for buying Goat and chicken meat. You can also buy other groceries items here.",
    "Review 5": "Great place for shopping Halal food. They are extremely economical and have almost every Asian item especially for Pakistani, Indian and Bangladeshi communities. Ideal for people studying in Brown University or living across Providence as a whole.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipP0qbEEmEaH7EnGEFeVEpdGO9ODe2ihQ5mrYOFG=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOCRKwPWSAhvJoaNMYAD1pGSX8JQuk8AhhzavAY=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOw3hX6ieWkfiliqNIESr5tUUK5dl1VnosFuLXt=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOkzbp04lsqj2R-qyumwpRlHF2iQhzuHwH1Szv9=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN9fsxJs6WuMBphVTlImOGLYw8xRXH-BTSh5EmA=s680-w680-h510",
    "name": "Quicklly",
    "site": "https://www.quicklly.com/",
    "type": "Online store",
    "category": "Online store",
    "phone": "(224)366-0987",
    "full_address": "Website",
    "city": "online",
    "country": "United States of America",
    "postal_code": "",
    "state": "Online",
    "latitude": "N/A",
    "longitude": "N/A",
    "rating": "4.8",
    "reviews": "124",
    "working_hours": "Wednesday: Open 24 hours, Thursday: Open 24 hours, Friday: Open 24 hours, Saturday: Open 24 hours, Sunday: Open 24 hours, Monday: Open 24 hours, Tuesday: Open 24 hours",
    "Review 1": "Great site to buy Indian groceries and vegetables. The same day delivery is very convenient. Only concern I have is some of the prices are a little high. Also, it would be good if we could order from Patel brothers store too in this site.",
    "Review 2": "Awesome service provided. Particularly for Indian grocery. Free door step delivery. Only one suggestion, try to add Patel Brothers from Devan Street, Chicago to your list. It would provide us variety of options. Thanks for your service.",
    "Review 3": "Love the service!! So convenient to get fresh groceries at your doorstep! The delivery guys are super friendly. First time they asked us to come out to the main gate so I requested if they can come to my door and the delivery person very nicely agreed and now delivers at my doorstep! I was also hesistant if the groceries would be fresh, but after having used them for about 3-4 months, I can safely say that the groceries are very fresh, infact sometimes more fresh than you would find at the store! I had my parents visiting from India and it was super convenient to have fresh vegetables at home for them like they get in India! I would love to see improvements to the website- like picking items from my last order, additional stores/restaurants serviced. Great job guys!!",
    "Review 4": "Timely service, different stored to order indian grocery from. Giving 4 stars because the website is not full fledged feature rich as you would expect but it's sufficient to place an order. It has friendly service as well. In case you are missing any items from the order drop them an email and you will be refunded (experienced).",
    "Review 5": "Worst customer experience. I ordered 2 butcher boy corn oil online for ~$50 each and they called after I already placed the order that the price just went up. Therefore, they wanted to charge me the extra amount even though online it shows the $50. I said no and they canceled the order saying out of stock. This is not how you treat customers.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPOae58imY5EwLnt8V6bLIR82cwT2Mo9O8TA6B2=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO8AanGbzBv1X34HwiI7Q-Pxnjy752Hvb0c9vca=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPmyD-Zo7XBMiUFSpDlMzvGHiGh4spwEfA4CnIC=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOQWjJNiEBG2wUUc7qpoBrgOXehowx-mwaSZO7z=s680-w680-h510"
  }
]
