[
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipP-7HWkoAYxACSxf26ALnsjqNChNLNiecuxpzSj=s680-w680-h510",
    "name": "Henna by Ruhi",
    "site": "http://hennabyruhi.com/",
    "type": "Artist",
    "category": "Artist",
    "phone": "+1 401-440-9425",
    "full_address": "N/A",
    "city": "Lincoln",
    "country": "United States of America",
    "postal_code": "None",
    "state": "Rhode Island",
    "latitude": "44.205388",
    "longitude": "-70.306596",
    "rating": "5",
    "reviews": "25",
    "working_hours": "Monday: 12-9 PM, Tuesday: 12-9 PM, Wednesday: 12-9 PM, Thursday: 12-9 PM, Friday: 12-9 PM, Saturday: 12-9 PM, Sunday: 12-9 PM",
    "Review 1": "Roohi was amazing!! From the moment I contacted Roohi, she was helpful, kind and very professional! She did my wedding henna and henna for about 40 of our wedding guests! Everyone loved their designs! Roohi is detailed, artistic and ensures everything looks great! I cannot recommend her enough!",
    "Review 2": "Roohi is an amazing artist that uses the top quality henna. She had done my Mehndi for my wedding along with a partner for the bridal party. I can’t say enough good things, and the design lasted with great color thanks to her care advice. I’d highly recommend Henna by Ruhi, thank you so much!",
    "Review 3": "Ruhi is AMAZING! She did my bridal henna and my partner’s and my mother’s! She even came to our wedding venue and did “simple” designs for our guests! I say “simple” because they were so beautiful and intricate! She was so fun and kind AND so focused and efficient! Highly recommend working with Ruhi!!",
    "Review 4": "I was extremely happy with my henna for my wedding, all thanks to Ruhi! She was super accommodating and friendly as well which only made the henna process even more fun! Her designs are absolutely beautiful and she works with such ease which is very interesting to watch. All my friends and family loved her work!",
    "Review 5": "Roohi was amazing! My henna turned out wonderful. I asked her for elephants and she did then so beautifully even though she has never done them before. My mom and some of my bridesmaids got their henna done by her too and loved her. We all had such a nice time with her. She was easy to talk to you and so friendly!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNnYKwjTWrmK11hv-aIQhQcYL770i6EDySN-n3K=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipM_5T7sNP3g6eoi7SBFU2D9-N7iu_btG0SxvKKV=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipN2ZJ9BpD-FHvBy1p8QHaSruPsGrGXBjReB77ug=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP3JhBk-8LqKS5ujzg6aZ-uigwbqFFeJavXXEkr=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "henna by amina",
    "site": "http://www.facebook.com/pages/Henna-by-Amina/280865545263092?sk=info",
    "type": "Tattoo artist",
    "category": "Tattoo artist",
    "phone": "+1 401-999-2068",
    "full_address": "535 Roosevelt Ave, Central Falls, RI 02863",
    "city": "Central Falls",
    "country": "United States of America",
    "postal_code": "02863",
    "state": "Rhode Island",
    "latitude": "41.8868572",
    "longitude": "-71.3816732",
    "rating": "4.4",
    "reviews": "7",
    "working_hours": "Monday: Closed, Tuesday: Closed, Wednesday: 6-7 PM, Thursday: 6-7 PM, Friday: Closed, Saturday: 9 AM-7 PM, Sunday: 9 AM-7 PM",
    "Review 1": "I had a wonderful experience with Amina. From now on I will always recommend her for hanna tattoos. Not only is she awesome at what she does, she is also very down to earth and kind. I can honestly say that she is blessed. Thank you for the  beautiful creation.",
    "Review 2": "Amina is the most professional, humble and super sweet person I have ever had the pleasure of doing business with. I got all 4 of my kids and their friends  Henna Tattoos for their birthday. Absolutely amazing experience! Will recommend to anyone , anytime! Want to be a birthday show stopper?!? Hire her!! You won’t regret it!!",
    "Review 3": "",
    "Review 4": "",
    "Review 5": "",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipM3QTzJ3G0gWGGVLrjAp92anl7qYT0VEDE2G1Ac=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Sabira Eyebrow Threading",
    "site": "http://sabiraeyebrow.com/",
    "type": "Eyebrow bar",
    "category": "Eyebrow bar",
    "phone": "+1 401-328-9144",
    "full_address": "216 Willett Ave, Riverside, RI 02915",
    "city": "Riverside",
    "country": "United States of America",
    "postal_code": "02915",
    "state": "Rhode Island",
    "latitude": "41.7751734",
    "longitude": "-71.3554613",
    "rating": "5",
    "reviews": "12",
    "working_hours": "Monday: 10 AM-5:30 PM, Tuesday: 2:30-5:30 PM, Wednesday: 2:30-5:30 PM, Thursday: 2:30-5:30 PM, Friday: 10 AM-5:30 PM, Saturday: 10 AM-5 PM, Sunday: 10 AM-5 PM",
    "Review 1": "I just left with the perfect eyebrows.  Highly recommend",
    "Review 2": "Excellent service! Sabira did an awesome job on my eyebrows. I will be back.",
    "Review 3": "She does an excellent job. I came here on a whim and I was so surprised at how overtime she has gotten my eyebrows to fill out and become more even. The place is very clean and she is sweet and professional.",
    "Review 4": "Sabira does a great job. Love the shape of my eyebrows. I would definitely recommend her!",
    "Review 5": "If you want AMAZING eyebrows come here! She takes her time when doing my full face and my eyebrows come out perfect every time! I’m glad I took the chance to try this place out! Highly recommend ! 5++++++",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNiei8bu0rMs3O0JKlAOwyQIzIoaNoUSzTQiAQW=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNXTi7ueThRgPFuGGQAGmQchu89FJcsoFH48_Tq=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOnFcw_gf0X_HCOkridr-LhFol33zZcdYtwamaG=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPX5Xw0EI-N1uzaphtO28M5KydV-6h_u9TmiWPi=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Royal Eyebrows Threading",
    "site": "N/A",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-943-3339",
    "full_address": "39 Phenix Ave, Cranston, RI 02920",
    "city": "Cranston",
    "country": "United States of America",
    "postal_code": "02920",
    "state": "Rhode Island",
    "latitude": "41.7823758",
    "longitude": "-71.4666719",
    "rating": "4.6",
    "reviews": "60",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 11 AM-4 PM",
    "Review 1": "Great job. My daughters come here too.",
    "Review 2": "I would highly reccomend this salon, they do a fantastic job with the eye brow threading. Very satisfied !",
    "Review 3": "The only place I trust with my eyebrows. The place is very sanitary. They are completely professional and do an amazing job.  They take their time and ensure you are happy with the results. I would NEVER go anywhere else.",
    "Review 4": "Jeanie was super friendly and really good at her job. She threaded my eyebrows without hurting me. This is the first time ever that I have walked out of there without my eyebrows being bright red. I told her to keep them as thick as possible, and she gave me what I wanted. Thank you!",
    "Review 5": "I have been going to Royal Eyebrows threading for years now. I switched after another place cut my eyebrow. She is so gentle and they do an amazing job! Prices are perfect for the service and the facials are amazing too!",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPFtYe-6Jt6AU3X7JixCiD4sdMyNsCGjovGewpE=s680-w680-h510",
    "name": "Threading Queen",
    "site": "https://www.facebook.com/threadingqueenz/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-353-2949",
    "full_address": "1860 Mineral Spring Ave, Providence, RI 02904",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02904",
    "state": "Rhode Island",
    "latitude": "41.860768",
    "longitude": "-71.464462",
    "rating": "4.8",
    "reviews": "34",
    "working_hours": "Monday: Closed, Tuesday: Closed, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 10 AM-6 PM, Saturday: 10 AM-6 PM, Sunday: Closed",
    "Review 1": "It was my first time coming here and she did an amazing job with my brows. Quick and light handed. She’s also kind and a great conversationalist. I’ll definitely be coming back!",
    "Review 2": "Girl does an awesome job!",
    "Review 3": "If you don’t get your brows done by Cheryl, welppppp you need to start! She does such an amazing job and has so many years of experience! Most places do what they think is best for you without asking but Cheryl always makes sure you get what you want!",
    "Review 4": "Cheryl did an AMAZING job on my lashes and eyebrows. She is so kind and precise with her work. She is super friendly with her clients and keeps the salon sanitized at all times. Deff recommend to others!",
    "Review 5": "Threading Queen is by far the best threading salon that I've found in Rhode Island. And it totally lives up to its name. Cheryl is a true professional and does an amazing job. Aside from the incredible work, she's also extremely friendly, making for an always pleasant experience! I'm glad I found this spot! :)",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOXvQRlAy5mEPlsCtHAEYDNk_NQCiOXt1g1lb3K=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOTyuqkNCn_cwEB_0eC7107nH44ZHlWqxZiTpwY=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipM69sgINJZxi7gWSK8eRpqjuF52KvevgCjDootg=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOD08vI7AVBs37-k6ms4OYbuJWQQ0GzFYoRc-Wt=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread - Barrington",
    "site": "https://www.salonthread.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-289-2733",
    "full_address": "188 County Rd, Barrington, RI 02806",
    "city": "Barrington",
    "country": "United States of America",
    "postal_code": "02806",
    "state": "Rhode Island",
    "latitude": "41.7373402",
    "longitude": "-71.3045838",
    "rating": "4.5",
    "reviews": "23",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Honestly, very kind tech. However, it took so long to have them done, she kept having to make adjustments and I felt a lack of confidence. I also feel as though they came out thinner than I had ever had them. Very kind, but not what I wanted or expected....",
    "Review 2": "Excellent monthly payment option with automatic deductions. Grupa was very nice and professional. My wife attends monthly and has always had exceptional results with Grupa. Tell them Sha from Australia sent you!",
    "Review 3": "So good to be back to RI. Stopped in tonight and signed up for the monthly threading membership. Feel excellent after getting my face threaded. Thank you Salon Thread! I'm feeling like a whole new person.",
    "Review 4": "Friendly and welcoming. Great service and thorough threading...never rushed. You can't beat the monthly plan. It is worth it for me since I have my full face threaded, including brows and lip, on a regular basis.  I can go as many times as I want for this service for 1 monthly fee. Highly recommend it.",
    "Review 5": "They are nothing short of amazing! This was my first threading experience and I couldn't have asked for better results! They listened to all my requests and gave great recommendations for future visits. My thin brows end up looking so much fuller and I don't have to fill them in with pencil anymore! I will never pick up a pair of tweezers again.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMwg2uZ-xFc-IyVjDOSh6P4mEzl3EonOaS72bqT=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Shubh Beauty",
    "site": "http://www.shubhbeauty.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14012801701",
    "full_address": "51 Silver Spring St #700, Providence, RI 02904",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02904",
    "state": "Rhode Island",
    "latitude": "41.8452529",
    "longitude": "-71.4164205",
    "rating": "4.4",
    "reviews": "15",
    "working_hours": "Monday: 10 AM-7:30 PM, Tuesday: 10 AM-7:30 PM, Wednesday: 10 AM-7:30 PM, Thursday: 10 AM-7:30 PM, Friday: 10 AM-7:30 PM, Saturday: 10 AM-7:30 PM, Sunday: 10 AM-5 PM",
    "Review 1": "Their work is amazing! Only place I go for my eyebrows to be threaded! Thank you ladies for your amazing work🙂",
    "Review 2": "I love the way my eyebrows look and I got lashes too this time and one of my lashes lifted up and they were very gracious about fixing it for me. I recommend going there ❤",
    "Review 3": "Do not  I repeat do not do your eyelashes extension with this company. They uses hair glue on your eyelashes 👀 which is not save. Soon he lady started doing my lashes my eyes started itching getting red and my nose started runny itchy. I saw the black hair glue which they wrapped a brown paper on to cover the hair glue label.  When I asked, if she was using hair glue on my eyelashes, she said no. Smh I paid $35 for nothing 😒 😪 I took off the lashes right away.  Why use hair glue on someone eyes 👀 🤔",
    "Review 4": "Got my eyebrows wax by Mrs. Nikki, she was very friendly and kind and I would recommend her any time.Donawea",
    "Review 5": "Don't go here if you're getting waxed. As they were waxing (Brazilian wax) I looked over and saw she was double dipping directly into the wax pot. When I brought it to their attention they said I was the \"first\" wax of the day but it was 4 pm and I had just seen a woman leave the room before me. Long story short they are unsanitary and don't take the time to perform safe hygiene on their clients. The owner even mentioned that her employee was new and normally they don’t do that, however even after admitting that they would still not give me a refund. You're better off spending more money at a reputable place that is safe.",
    "photo 1": "",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPszfZAzBmCRwEVG_799IcYHbO-PfNoMAfags5s=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPAuhCvd4HecYxZgTlia9NQo5vbLo4BXCsN8yoJ=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipN3XO4mZcngkCxCmQ0c8JOdkMp6noYn1wTUjJGg=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h510",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017286637",
    "full_address": "85 Power Rd, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.862287",
    "longitude": "-71.4124361",
    "rating": "4.5",
    "reviews": "212",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "Love this place. I recommend Sukhy she’s the ONLY one I trust with my brows. If she’s not there I’m not coming! Brow tinting is on point too!",
    "Review 2": "I love this place,everytime I come I leave with more than just brows done. DEB IS MY GIRL!!",
    "Review 3": "Because I came here for the first time and I’ve never been treated that bad… owner was straight up rude. And kept twisting and turning my head during the threading. She asked about the color I wanted for my tint and I wasn’t sure…. She walked away and left me sitting there . I’ll never be back here and I hope my friends stop using this business also. Very unfriendly and unprofessional for a beauty business. Never again",
    "Review 4": "i have a bad experience every time i go each eyebrow comes out different and never looks the same i tell the person to fix it and they still don’t look the same i will not be coming back to this place",
    "Review 5": "First of all I don’t really review but I have to for them.. Honestly, I’ve been going to Suhky’s for years and they never fail. I can say I’m so picky when it comes to my eyebrows because I don’t know how to do makeup so what’s on my face is stuck until the next time.. SHE SLAYS EVERYTIME!!! The shape, the arch, the thinness. ETC. I tell everyone to go there and I forever will!! Mind you the pictures added are from 2016. 2019. And 2022. QUALITY.",
    "photo 1": "https://lh5.googleusercontent.com/p/AF1QipOYG-wEdHz4Fm6dpxEb3b72AXrgazZEgGDJ95Wl=w141-h235-n-k-no-nu",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMva-WXD0SLLofcnDAzVqkZGguPPdl__mcp3yBa=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipONs8o5K8JNZRROZqsb128_9IShiHL3D6nj0CGU=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h511",
    "name": "Sukhy's Threading Johnston",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "1 401-649-4275",
    "full_address": "1417 Atwood Ave, Johnston, RI 02919",
    "city": "Johnston",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.818990",
    "longitude": "-71.496870",
    "rating": "4.3",
    "reviews": "38",
    "working_hours": "Wednesday: 9 AM–6 PM, Thursday: 9 AM–6 PM, Friday: 9 AM–6 PM, Saturday: 9 AM–6 PM, Sunday: Closed, Monday: Closed, Tuesday: 9 AM–6 PM",
    "Review 1": "Horrible experience. The girl I had was soo rude. All she did was talk the whole time she did my brows.  The left one ended up smaller than the right and I had to fill it in.  So rude I will NEVER go there again.  I will tell all my friends to NEVER step foot in there.  RUDE !!",
    "Review 2": "I went today to get my eyebrows done and unfortunately I won’t be returning. Not once but twice they messed up my brows.  This time I got two different shapes.  It’s not first time time they have done them there before but the last two ladies it’s not know what they aware doing.  I have the shape all you have to do is clean around them.  Sorry but won’t be returning.    1/17/ 2020 After an unfortunate visit I surprised, the owner reached out and wanted to know what happed.  Glad she reached out And fixed my eyebrows.  I will return to her location thank you!",
    "Review 3": "I've never been to this location usually go to the Pawtucket one but the same ladies work in all of them. There was only one woman there but she was quick and efficient never left anybody waiting more than a few minutes. I went for a threading and tint, she was gentle thank God cuz a couple of them... mannn... and she did a okay job on them. tbh there's only one lady that gets my brows exactly the way I like them but I go there like once every couple months just to remind me where to pluck, n I don't see her much so I always forget her name.",
    "Review 4": "This place is very clean and tidy! They do a beautiful job with the threading and they come out perfectly even each time! Their pricing is also very fair. I highly recommend!",
    "Review 5": "I was reading someone’s review and I had the exact same experience my eyebrows got messed up two different shapes. I always have to let them regrow before I can go back hoping this time they won’t get messed up. Sadly they do. Some might ask why do I keep going there; because I went there before and this lady did a great job hope to find her there again. Anyways I saw that the owner reached out to the lady and did them her self hopefully she’ll see this and reach out!",
    "photo 1": "https://lh5.googleusercontent.com/p/AF1QipOYG-wEdHz4Fm6dpxEb3b72AXrgazZEgGDJ95Wl=w141-h235-n-k-no-nu",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOSrqMnpoEjeK9nBuNrhaZz8ZmlIKFkPeTrF4X0=s680-w680-h511",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMva-WXD0SLLofcnDAzVqkZGguPPdl__mcp3yBa=s680-w680-h511",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipONs8o5K8JNZRROZqsb128_9IShiHL3D6nj0CGU=s680-w680-h511"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN6kBGPXlwbyE7GnsnFlkrQ-3BpCkfvO6qdVCYh=s680-w680-h510",
    "name": "I Thread And Lash Spa - Providence , RI",
    "site": "https://squareup.com/appointments/book/e973ydqkjhhewc/LAWM4R0YRCHXM/services?rwg_token=ADQ7psR3YppRdethaFTmHLFh8IFptJswnySyUllExoIehnMU225ERaZvAAf7Am8tu7rKTkSbqBKFAw-zYN6V-8X5kNeNArQc_Q%3D%3D",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 215-5243",
    "full_address": "1 Providence Pl store # 5020, Providence, RI 02903",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.827599",
    "longitude": "-71.416191",
    "rating": "4.6",
    "reviews": "209",
    "working_hours": "Wednesday: 11 AM–8 PM, Thursday: 11 AM–8 PM, Friday: 10 AM–9 PM, Saturday: 10 AM–9 PM, Sunday: 11 AM–6 PM, Monday: 11 AM–8 PM, Tuesday: 11 AM–8 PM",
    "Review 1": "Nice service and beautiful henna,we will be surely back👍🏻",
    "Review 2": "We came here with my daughters and their friends for Henna. They were amazing and so friendly. Very talented. I highly recommend coming here!",
    "Review 3": "I received henna for the first time and was not disappointed! Wonderful service and really polite staff, stopped and asked if it was going okay multiple times to make sure I liked it and I'm very happy with the results. I believe her name was Nita but I'm very forgetful. Either way, I would definitely go back to get it again. Good price and great work, very pleased customer!",
    "Review 4": "I love the way this girl did my lashes she’s very gentle and kind and it’s a very understanding and easy place to be at she’s very gentle and all the people are nice and have amazing energy come now!!😩",
    "Review 5": "Amazing service with very welcoming staff. My threader Saima was patient and did an amazing job will definitely be back.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN6kBGPXlwbyE7GnsnFlkrQ-3BpCkfvO6qdVCYh=s680-w680-h510",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipN7Y58HGe0J0tgKXwBU8_DtQu4ULML5fNtpif1i=w141-h235-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOmHZfNpybPgzRDMoafKpmwIp7RqRrnp3CBKwrD=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPzltn5P6ibxyWEkD71urN3Dazxj5hwRcNTisXw=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMLMBred0MY1AXN-ZhZc_utLU5hgOYErydBqp6l=s680-w680-h510",
    "name": "Smiley Eyes Eyebrow Threading",
    "site": "http://smileyeyethreading.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-347-5098",
    "full_address": "774 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "country": "United States of America",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.653889",
    "longitude": "-71.454585",
    "rating": "4.9",
    "reviews": "244",
    "working_hours": "Monday: 11 AM-6:30 PM, Tuesday: 10 AM-6:30 PM, Wednesday: 10 AM-6:30 PM, Thursday: 10 AM-6:30 PM, Friday: 9:30 AM-6:30 PM, Saturday: 9:30 AM-6:30 PM, Sunday: Closed",
    "Review 1": "I have never had such a positive experience with eyebrow threading! I was in and out in 10 minutes and I feel like I look amazing. Plus, it barely even hurt compared to previous experiences.",
    "Review 2": "The women who work there are amazing. Sarah gave me excellent advice and great service. I would recommend this business",
    "Review 3": "So friendly every time I go and I bring my friends with me to get theirs done too! They always give helpful tips and suggestions! Reasonable price as well!",
    "Review 4": "Smiley eyes is my happy place. Priya and her staff are experienced perfectionists who offer threading, eyebrow & eyelash tinting, waxing and more. The salon is conveniently located, offers parking, and is extremely clean.",
    "Review 5": "I love going here for my brows. I get different people sometimes and even then everyone seems to know what they’re doing in that department. Plus, I love their cashapp rewards and the digital system they have for payment in general. I read earlier reviews about rude customer service and I never experienced that. Maybe it’s because I am usually too shy to strike up conversation but even when they do happen everyone is really polite. So next time you decide to go somewhere that charges 2x for brows like Ulta, don’t. Support small businesses and go here. Make sure to tip.",
    "photo 1": "",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNKxYpjNYerwmrH34RgmrPsTiuRsHJA7sa8Le7w=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMGiPoFDnh5llBfhaRJWYoJm4S-Ord_ZCXehbFC=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPIr-ZslauOduwMyA0ca642MvhEg4p41A1EXWDx=s680-w680-h510"
  }
]
