[
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMr54XF4WtJWlA4d80XO27R5ydPNJCw3o-4jtD0=s680-w680-h510",
    "name": "Bollywood Grill",
    "site": "https://www.bollywoodgrillcumberland.com/?utm_source=gmb&utm_medium=reservation",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-475-1477",
    "full_address": "1764 Mendon Rd #4385, Cumberland, RI 02864",
    "city": "Cumberland",
    "country": "United States of America",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9440609",
    "longitude": "-71.437034",
    "rating": "4.2",
    "reviews": "327",
    "working_hours": "Monday: 11:30 AM-3 PM,5-9:30 PM, Tuesday: Closed, Wednesday: 11:30 AM-3 PM,5-9:30 PM, Thursday: 11:30 AM-3 PM,5-9:30 PM, Friday: 11:30 AM-3 PM,5-9:30 PM, Saturday: 11:30 AM-3 PM,5-10 PM, Sunday: 11:30 AM-3 PM,5-10 PM",
    "Review 1": "My Daughter is 12 years old, She ordered the butter chicken for her and Myself so we could go to the drive in theater. We had to wait an hour and the other patrons had big bags of food. The highest price I heard the rude lady say was $57.65. and he had a lot of food, she hands Me the small bag and says $70.00 ok no problem but when My Daughter went in the bag to get her food. Everything was for 1 person, a small box of Jasmine Rice and a container of butter chicken that we could not eat individually. The hostess was rude I felt overcharged for our food purposely and we couldn't eat til we got home. I paid close to $100 for bad service and the kids running around the food in the kitchen where customers can see them. I would bring many to them but I don't want to be embarrassed because of their service. Rude lady should take a course on being a good hostess.",
    "Review 2": "We were traveling from Massachusetts to New York when we came across this restaurant and so glad we found it. It was really late and all other restaurants on the way had closed for the day. We were starving and just happened to call them to see if they were open. We reached just as they were about to close but the owners were kind to let us dine in. We had veg biryani, paneer kadai and garlic naan. Biryani ani kadai was good. The naan was slightly uncooked. The dahi raita was sour and slightly butter so we couldn't eat it. Overall good experience. The decor was nice, restrooms were clean.",
    "Review 3": "Had a dinner here with my colleague. We ordered Amritsari Dal, bhindi and garlic naans. For appetizers we wanted gobi manchurian which was not on menu but we asked. Hostess suggested we try gobi 65 which was not on menu either but she said chef will make it. It was amazing. Crunchy gobi with lots of flavor. Dal and Bhindi was awesome too. Naans we’re one of the best. It is very authentic Punjabi restaurant so if you want to eat good Punjabi food, go here.",
    "Review 4": "This is the best Indian food I have had since moving to this area. The samosas are excellent and the Chicken Vindaloo is the best I have every had. It is perfectly spicy and vinegary. If you enjoy spicy food, I highly recommend their Vindaloo. I’m sure the lamb and veggie Vindaloo would be great as well. Excellent garlic naan as well. I will absolutely be back soon!",
    "Review 5": "We enjoyed our time here. The server was quick to get the appetizer running but the entrees took longer than we expected it to be. The goat biryani was amazing as well as the chicken kadhai.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOl9JRxgBPPNfjo1Q8WPkcPv8uV7YPnEvgYu0xB=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPkLeyOI92KAyJu1bdWpRdqW2VKUF29gBPhoxhs=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMPQnJAuWcJ6xOkR6OVY2bpv7LsIsxfyrUN2cd7=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNQQuruqQYlCAK6JBdHQ2LXAILFJ-5cvoyBzruY=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMA2VF3sOBfAXDeRO9BWOvRdenGzu5tGI7M0BqP=s680-w680-h510",
    "name": "Chaska",
    "site": "https://www.chaska-usa.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-537-7900",
    "full_address": "16 Midway Rd, Cranston, RI 02920",
    "city": "Cranston",
    "country": "United States of America",
    "postal_code": "02920",
    "state": "Rhode Island",
    "latitude": "41.7637269",
    "longitude": "-71.4577055",
    "rating": "4.6",
    "reviews": "288",
    "working_hours": "Monday: 12-9 PM, Tuesday: 12-9 PM, Wednesday: 12-9 PM, Thursday: 12-9 PM, Friday: 12-9 PM, Saturday: 12-9 PM, Sunday: 12-9 PM",
    "Review 1": "Most of the food was good. Chutney can be a little less tangy as it was overpowering the taste of chicken. Amritsari Kulcha was just next level amazing though. Definitely a must try.",
    "Review 2": "Good food and good drinks right in the shopping plaza.  Paneer comes in nice large pieces that are flame grilled. They have an open concept kitchen so you can see right inside as they prepare your meal.",
    "Review 3": "We went to this amazing restaurant in spring '21 during a family trip to Newport. That was the first time we tried Indian cuisine and…OMG… we fell in love   The interior is absolutely beautiful, stylish and vibrant. The food was irresistible delicious, we couldn’t stop eating until we finished our meal to the very last crumble on the plate. Our overall experience was terrific. Thanks to the owner for the love, attention to the details and care of their place. I wish your business  prosperity for years and hope one day we’ll come back",
    "Review 4": "The flavors and combinations served here are mind blowing! Highly recommend the samosas and calamari for appetizer. We had chicken korma and lamb roganjosh for main course, and saffron pistachio dessert. Phenomenal!!l",
    "Review 5": "The food here is the best Indian food around! I love to order the mango chicken even though it's not on the menu. I drive 50 minutes out of the way to go here. The parking sucks because it's in the same lot as the rest of the stores but it's so worth it!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN-8ZgdEQzm3hgYCh6WOj4qd_O9hzj9UE1nrLAh=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOckVF17I6SdetozMkFLMb33Z9l38c5YB_cXEW1=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPjoZy2sKnwhvnnPskK8N83oZvWA1DNtTkst99z=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP-dYUYGD6NRAsnnL77vmlOICTtokSZYP6WKDDp=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPn2NnjEfg2--7ORIsf8TIGuzE6im7MHpCma-V1=s680-w680-h510",
    "name": "Chennai Express - Indian Cuisine",
    "site": "http://www.chennaiexpressri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-228-0203",
    "full_address": "745 Reservoir Ave, Cranston, RI 02910",
    "city": "Cranston",
    "country": "United States of America",
    "postal_code": "02910",
    "state": "Rhode Island",
    "latitude": "41.7797188",
    "longitude": "-71.4435842",
    "rating": "4.5",
    "reviews": "312",
    "working_hours": "Monday: 11:30 AM-2:30 PM,4:30-9 PM, Tuesday: 11:30 AM-2:30 PM,4:30-9:30 PM, Wednesday: 11:30 AM-2:30 PM,4:30-9:30 PM, Thursday: 11:30 AM-2:30 PM,4:30-9:30 PM, Friday: 11:30 AM-2:30 PM,4:30-10 PM, Saturday: 11:30 AM-2:30 PM,4:30-10 PM, Sunday: 11:30 AM-2:30 PM,4:30-9 PM",
    "Review 1": "Best ever Indian food I have tried in US. Especially try their Chicken 555 and Tawa fish you will absolutely will love that and also they serve best South Indian food items. Highly recommended 😍",
    "Review 2": "Yummm. Authentic Chole Bhatura (don’t miss). Amazing Onion Rava Masala Dosa. If you can’t imagine how one restaurant can serve both “flawless” dishes, one from Deep South and one from deep Punjab, then check them out and decide for your self.",
    "Review 3": "Management has changed, chef changed and whole experience changed. Some money making Indian wanting to just run a restaurant with stale foods! Change your decision if you ever planned to have that desperate Indian food at this place.",
    "Review 4": "I was told to try out this restaurant because it’s so good. Well I got the chicken tikka masala and the chicken was good, but it didn’t come with any rice. I called about the issue and was told if I wanted rice I’d have to pay for it. I immediately lost my appetite after that and didn’t finish the food. I paid over $20 for chicken only 😑. Very disappointing. This has to be a joke. I hope the restaurant see’s this as an error.",
    "Review 5": "Wow. This is Excellent Indian. Chennai is truly a must try.  This is as authentic Indian as you will find here in Rhode Island. I am in awe that a place this amazing sits in a hole in the wall on Reservoir Ave.  Everytime I am here the restaurant is filled with individuals enjoying their meal. Smiling, laughing and sharing time over great food. High praise to the family at Chennai for bringing us wonderful food with great flavor. You can tell they love what they do. You can taste the love in the food. Great job Chennai and thank you! We will see you soon. Pictures are of Tikki Massala and I tried the Kadai Chicken. Delish and something new for a lot of individuals.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOOTCspD0_ma1eCuB3uK1PkYKTA66-CX179UKDV=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPvoxhsR9jDktCNqfCkGmatUtnQzmxucXS-36Xf=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNuEn9IWuWGZCRGXtDLB5XCn6QdnD5q7dhwH5di=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipM9V2Z1c1RUGKdGW-k7s2N5Ud35Bb6nbKrGVtBW=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipM7xU9x0CFN22QL_i40QrSLwVUFkMArXQaF6EyJ=s680-w680-h510",
    "name": "Chennai Tiffins",
    "site": "http://www.thechennaitiffins.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-356-4471",
    "full_address": "359 Old River Rd, Manville, RI 02838",
    "city": "Manville",
    "country": "United States of America",
    "postal_code": "02838",
    "state": "Rhode Island",
    "latitude": "41.9665263",
    "longitude": "-71.4734321",
    "rating": "4.4",
    "reviews": "161",
    "working_hours": "Monday: Closed, Tuesday: 11 AM-3 PM,5-8 PM, Wednesday: 11 AM-3 PM,5-9 PM, Thursday: 11 AM-3 PM,5-9 PM, Friday: 11 AM-3 PM,5-9 PM, Saturday: 11 AM-3 PM,5-9 PM, Sunday: 11 AM-3 PM,5-8 PM",
    "Review 1": "We got a takeaway of samosa and masala Dosa from here.Samosas were good. But masala Dosas was opposite of samosas. They did not have any tase. The masala stuffing  they had stuffed it with had 0 salt and we felt like we should not have ordered the masala Dosas.",
    "Review 2": "Authentic and delicious Indian Cuisine. This food was hot and ready when I arrived to pick it up. The curry was amazing and I can’t wait to get it again!",
    "Review 3": "After ordering takeout from here several times, I can attest that Chennai Tiffins has THE most authentic South Indian food in the area, with an amazing variety of Chettinad specialties.  Some of my favorite menu items include onion pakoras, podi idli, vegetable kothu parotta, and chettinad vegetable biryani.  Very fresh, flavorful, and aromatic with a complex mixture of spices. Nice assortment of condiments (mint cilantro chutney, tamarind chutney, spicy pakora sauce, raita) as well.  Best to call in orders for pickup.  Very reasonably priced, highly recommended.",
    "Review 4": "Best place in entire RI to get authentic South Indian food. Especially It’s really good for non vegetarians items.",
    "Review 5": "The food is good, especially the Biryanis. We went there for a dine-in but it is geared more towards take away.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPia0tUiJbokkvRBsAFf3Dt7OgYudYSYWsObjSs=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMkez5Q2l0OCzzo6deKXsuAYmpY8zqM6CTgd6l3=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMPpCx_FvFmWQPXLOUTpSwHuL8jWcbcSEPpoPEd=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPIWeslwiMK3Mujc94wyy7eBuUMueiD4dBTBQTC=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN2pP2IUuaoYaBZTQKygV41GPRRQDCWKAja-heD=s680-w680-h510",
    "name": "Curry Kitchen , Authentic Indian Cuisine and Hookah Bar",
    "site": "http://ricurrykitchen.com/",
    "type": "Indian restaurant",
    "category": "Hookah bar",
    "phone": "+1 401-642-5888",
    "full_address": "259 Front St, Lincoln, RI 02865",
    "city": "Lincoln",
    "country": "United States of America",
    "postal_code": "02865",
    "state": "Rhode Island",
    "latitude": "41.9041245",
    "longitude": "-71.4102232",
    "rating": "4.5",
    "reviews": "483",
    "working_hours": "Monday: Closed, Tuesday: 11:30 AM-3 PM,4:30-10 PM, Wednesday: 11:30 AM-3 PM,4:30-10 PM, Thursday: 11:30 AM-3 PM,4:30-10 PM, Friday: 11:30 AM-3 PM,4:30-10 PM, Saturday: 11:30 AM-3 PM,4:30-10 PM, Sunday: 11:30 AM-3 PM,4:30-9:30 PM",
    "Review 1": "The food here is incredible! We found this spot on a whim and were not disappointed. The buffet is $20/person and everything is delicious. Cannot recommend this place enough!",
    "Review 2": "Really good atmosphere!! Great place to enjoy with family. Service is really fast and food is finger licking good. One of the best  chicken tandoori, kadhai chicken and Palak paneer I ever had. And price is reasonably good. One of the best Indian restaurants !!!",
    "Review 3": "Good Indian restaurant in Rhode Island. Seating is good and food is tasty. We tried chole bhature and devil's chicken.both items are tasty.",
    "Review 4": "This cozy restaurant has left the best impressions! One of the best Indian restaurant in east coast, Hospitable hosts, delicious Indian dishes, beautiful presentation. I recommend to everyone! I would like to come back here again and again. Don’t forget to try chicken momo",
    "Review 5": "Amazing food!! I tried a lot of the buffet options and was definitely NOT disappointed! There was nothing I didn't like, but the chili chicken and the goat were may absolute favorites. Very friendly staff too! It was a great experience!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOx-MlTtwGWSQIV1SuWoQrfwnDIV6zeJ6dJou1k=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipP3uhW3-a56TMz_megjYnFUwSp-xg3Uj6vlq0nj=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMqYZaHtyINZu7lAVi-WRjvj8eI8rFhGTO0gn6U=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipObkXjipygmi4PjztEAn2KZ1c2fXAuSwZkl-83M=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOCjrcFWX8FPKTJk9Qz2bS6yIMFmpHMvNgeUVCl=s680-w680-h510",
    "name": "Curry Walla Indian Cuisine",
    "site": "https://www.mealhi5.com/Curry-Walla-RI/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-354-0090",
    "full_address": "1525 Smith St, North Providence, RI 02911",
    "city": "North Providence",
    "country": "United States of America",
    "postal_code": "02911",
    "state": "Rhode Island",
    "latitude": "41.8502227",
    "longitude": "-71.4605282",
    "rating": "4.3",
    "reviews": "240",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-3 PM,5-9:30 PM, Wednesday: 10 AM-3 PM,5-9:30 PM, Thursday: 10 AM-3 PM,5-9:30 PM, Friday: 10 AM-3 PM,5-9:30 PM, Saturday: 10 AM-3 PM,5-9:30 PM, Sunday: 10 AM-3 PM,5-9:30 PM",
    "Review 1": "Curry Walla Indian Cuisine make good Indian food. After I order within no time the food was ready. The food was amazing and to much to finish.  I will be back to try more food. My first time eating Indian food.",
    "Review 2": "We went on a Sunday and I think they just opened. The service was outstanding. We had chicken vindaloo, lamb masala and chicken curry. We also got the soup, the flavor was perfectly spicy and bright.  Every bite was better than the one before.",
    "Review 3": "Nice restaurant. Good taste. Affordable prices. Ample car parking. Good enough seating.",
    "Review 4": "Decent serving sizes and courteous staff; they have to make up their mind between upscale ambience vs canteen type of food. Need to pick one of the two lanes 😊",
    "Review 5": "Visit this place on a winter afternoon for lunch with my husband and a friend. We started with non-veg platter which had chicken pakora, chicken samosa and chicken Tikka. All of these tasted fresh and did not feel like the usual frozen ones from supermarket. Then we ordered fish pakora. Along with this we ordered chicken soup little spicy. The starters were very delicious. For the main course, we ordered 2 thalis, and goat biryani. The quantity is more than usual restaurant and very delicious.The attending person, Prakash is very soft spoken and asked for feedback if the food is ok. Finally they also gave us tea before leaving.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN2bngVm3nJUEm1fGh0gAmpSAFWsLDk_jN6BNYu=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOIyDBRjg4LHVYrEEoyqE9430pF02EpXJvzbV6J=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNLPfkp1KKkua6oAxxnF2NgUh0a0gFBkjW0PdSk=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMIhJSwe-L6GMZE7LmCNfHSFnrcUQ8Aiv1y3HRM=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNFWgY_qNZPi-rFYptNX-mjurRmgsmPMIawN-BU=s680-w680-h510",
    "name": "CurryLand",
    "site": "https://newportscurryland.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-619-8574",
    "full_address": "163 JT Connell Hwy, Newport, RI 02840",
    "city": "Newport",
    "country": "United States of America",
    "postal_code": "02840",
    "state": "Rhode Island",
    "latitude": "41.5082042",
    "longitude": "-71.3172098",
    "rating": "4.2",
    "reviews": "336",
    "working_hours": "Monday: Closed, Tuesday: 11 AM-10 PM, Wednesday: 11 AM-10 PM, Thursday: 11 AM-10 PM, Friday: 11 AM-10 PM, Saturday: 11 AM-10 PM, Sunday: 11 AM-9:30 PM",
    "Review 1": "Out of all the Indian restaurants I have tried, Curryland slaps every time! So good",
    "Review 2": "I have eaten at Curryland a few times since they opened earlier this year and each time it has been excellent.  They do a great job of preparing the traditional Indian dishes and provide a customized blend upon request.  Additionally, during lunch they have a buffet that allows newcomers to Indian foods the opportunity to sample a bit of several different dishes to determine what they like.  Very friendly staff who are there to help find what you might like best.  Highly recommended to anyone who is looking for a great lunch and/or dinner.",
    "Review 3": "Excellent Indian cuisine! My family and I go here all the time, and everything we’ve tried has been delicious. The curries are a savory delight, the naan is fresh and buttery, and the chicken is succulent and well seasoned. My personal favorites are the Vegetable Samosas, and the Chicken Tika Masala.",
    "Review 4": "Authentic Indian food with great appetizers and desserts. The service was quick and food was tasty. The naans were crisp and the food quantity was good enough. Although the rates were a bit pricey, the quality of food makes up for it. Will surely visit this place again when I am in Rhode Island.",
    "Review 5": "Whenever I want Indian food. This is the place. It’s the only only good place I found in Rhode Island. The staff is welcoming and accommodating. The cooks are experts and your food comes in perfect time. The chicken tika massala and the naan blow my mind. If you come here you will not be disappointed. 🤤😋",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMEXvyLk4vKwiGpruA5E-z8XAJY_Cg-nkgdZsZD=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOeDwWeSlDSGyDrTCl5iP8cgS1YiMjIAIe189Uq=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNMVfIdhqEovZ1yc4k1jgwdGJdLSSeeWXlzssoX=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNMjbXIA5nWekTZjrqr4NB1L6u5H6cqJsRsHem1=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipN2voSWj7gV-qDfKGLUMwaDyuM8cppxCkY4gFxP=s680-w680-h510",
    "name": "Godavari South Indian Restaurant",
    "site": "https://www.godavarius.com/rhodeisland",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-642-8286",
    "full_address": "356 Mendon Rd, Cumberland, RI 02864",
    "city": "Cumberland",
    "country": "United States of America",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9189122",
    "longitude": "-71.4075949",
    "rating": "4",
    "reviews": "1162",
    "working_hours": "Monday: 11 AM-2:30 PM,5:30-10 PM, Tuesday: Closed, Wednesday: 11 AM-2:30 PM,5:30-10 PM, Thursday: 11 AM-2:30 PM,5:30-10 PM, Friday: 11 AM-3:30 PM,5:30-10:30 PM, Saturday: 11 AM-3:30 PM,5:30-10:30 PM, Sunday: 11 AM-3:30 PM,5:30-10 PM",
    "Review 1": "Nice tasty food worth the money.. less oily, cooked to perfection and satisfies your taste buds!!",
    "Review 2": "My husband is from India and gets homesick occasionally for really authentic Indian meals. We came for the Sunday buffet and this absolutely hit the spot. The food is so fresh and the staff are very attentive. Great service all around. We'll definitely be back!",
    "Review 3": "Hit or miss. First time try was good so we went again and had a bad experience. The dosa, Gobi Manchuria was good. Bajji was so oily that I had to squeeze out oil. Kadai paneer was ok. We had to mix in salt and pepper to bring it to taste. Not an experience I want to have when paying good price. One another customer was so mad with the food that they were going to call the department of health for serving frozen expired food!",
    "Review 4": "The shrimp was so overcooked that it was like we were chewing on rubber. The food overall was just below average in flavor profile and execution. The only reason that this place gets a 2 star is because of how kind and welcoming the wait staff was.",
    "Review 5": "One of the best South Indian Restaurant in the area! Huge menu and all delicious! They serve lunch buffet and they even serve the Bahubali Thali - which has 50 items on the plate! I love the biryanis, Chile bhature, Idli and Dosa!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNJ9LyeWjR0-2hKBHt55JerUJfCxLSBJSPYRDeg=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMuYU-BleeCFGSCCzmr5P1EC6EdO1p752bUceA0=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipP_CpmF71BGVF4CfP53dI-DRyzm8oi5Sv4Peb9j=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO6hY2RNroR8mDZU3ccuFWVRmeopGEMUsfNGGei=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNlr7Q5Vg5RPbwucV8Ugs8Vg8dE16lOnjVDxzoK=s680-w680-h510",
    "name": "India Restaurant",
    "site": "http://www.indiarestaurant.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-421-2600",
    "full_address": "1060 Hope St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.856089",
    "longitude": "-71.3917658",
    "rating": "4.8",
    "reviews": "5137",
    "working_hours": "Monday: 11 AM-10 PM, Tuesday: 11 AM-10 PM, Wednesday: 11 AM-10 PM, Thursday: 11 AM-10 PM, Friday: 11 AM-11 PM, Saturday: 11 AM-11 PM, Sunday: 11 AM-10 PM",
    "Review 1": "This is hands-down the best Indian Restaurant in the north east! The decor, the staff and the food. Decor  - Beautiful, Staff - the sweetest. Music - Fun! Food - absolutely delicious! This was our first time & Tita made sure we had everything we need and made our experience amazing. ❤ Thank you so much team India Restaurant.  Will certainly be coming back again and again and again and again! 😇",
    "Review 2": "One of my fav spots in town, perfect for a date of any kind! Delicious food, friendly and attentive staff, strong drinks and great portions! Quality Indian food within a moody, cultural decor sure to leave a lasting impression! Do try the veggie masala and garlic naan!! You won’t regret it.",
    "Review 3": "Incredible experience at India Restaurant. The ambiance was first-rate. The server was helpful, friendly, and attentive. The food was delicious (we got the dining for two deal, getting the Mango Curry and the Fish Curry for our entrees). This was truly a memorable dining spot for me and my wife.",
    "Review 4": "I had never ventured into Indian food until meeting my partner in 2019. He finally got to take me to India and he can do it again. The door opens and the smell of curry ignites your hunger. Everything is cooked to perfection. The taste is better than imagined. Venture out and try India.",
    "Review 5": "India is one of Providence's best restaurants in general and a cultural gem for the city. The atmosphere, lighting, and general feel of the setting is perfect to match their menu. Service was excellent, very helpful in catering to any special requests. Food was delicious as expected. Many seating options, inside and outside, the menu is very fairly priced for the quality of food you are getting. A great selection of cocktails and drinks to choose from, typically busy on weekend nights but they also have an in house Henna artist doing free henna work available to patrons, a great opportunity.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNHgTj5q7_q6TH2XIAX6tafiRXW8RoFQM1nq6ID=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMuvRmhrZDKjLWmfFZM5AdehXAUNu_LFpNUn7Sb=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipM0bLHl5riN09oEesB_YjdpJG2tFAmKvDOBmSnw=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipN1jBTPCKwuAVFI2BfrRoLibWR3mcJamOC-4a0U=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Indian Accent Catering",
    "site": "http://indianaccentcatering.com/contact-us/",
    "type": "Caterer",
    "category": "Caterer",
    "phone": "+1 401-374-1872",
    "full_address": "727 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.858234",
    "longitude": "-71.391608",
    "rating": "5",
    "reviews": "1",
    "working_hours": "",
    "Review 1": "Wonderful people to work with and great quality food. They offer really good suggestions and are very considerate when thinking about the menu for your event. We used them for our wedding and did not even consider going with someone else for an upcoming event.",
    "Review 2": "",
    "Review 3": "",
    "Review 4": "",
    "Review 5": "",
    "photo 1": "NA",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipOFp-x2p03SE8cuPHCi7jeqIwVj9disqTLFvkzK=w141-h101-n-k-no-nu",
    "name": "Kabob and Curry",
    "site": "http://www.kabobandcurry.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-273-8844",
    "full_address": "261 Thayer St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.8289032",
    "longitude": "-71.4006046",
    "rating": "4.3",
    "reviews": "917",
    "working_hours": "Monday: 11 AM-9:30 PM, Tuesday: 11 AM-9:30 PM, Wednesday: 11 AM-9:30 PM, Thursday: 11 AM-9:30 PM, Friday: 11 AM-10 PM, Saturday: 11 AM-10 PM, Sunday: 11 AM-9 PM",
    "Review 1": "2nd time here! The food is incredible! It was my birthday and the perfect way to celebrate. Just such an amazing experience. Mustafa was our server and he made it a great experience. Very knowledgeable of the food and very nice. Thank you.",
    "Review 2": "Excellent food at a fair price.  Each dish nicely presented and cooked well. Service was  great. Attentive staff without being rushed. Will definitely visit again.",
    "Review 3": "The food here was excellent! The different flavors were very savory! The waiter Mustafa was a great server and made terrific recommendations, since it was my first time eating here. If you want to try something new and enjoy Indian food this place has authentic Indian cuisine!",
    "Review 4": "I ordered the lamb saag medium spice with honey ginger naan and the service was fast and the food delicious. I love coming here with friends and it’s my favorite place to get authentic Indian food!",
    "Review 5": "My favorite is their weekend Thali which you can have few small plates of curry and veggies with rice or Naan. I also like their mango curry and chicken masala with honey Naan.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMbPnAUlFvO1v294H8-u5d_yYQi9FR2xbQ90EzJ=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPnScddjBMkkuzaXWWoBd4KGzCiRsnqIHym8jJ5=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMepteyPeKNfHBuSTc3qkvv_Cv-wDWbrL1NRWrR=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNd6MzZ9rBGAZJXSEYAqueKWInMun4IAMzlg3AM=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNFYA95o8Xcr7-7mpjN9AOwGaAdT9KbIpS1ilXB=s680-w680-h510",
    "name": "Masala Indian Cuisine",
    "site": "http://masalaindiancooking.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-615-0623",
    "full_address": "35 Quaker Ln #1, West Warwick, RI 02893",
    "city": "West Warwick",
    "country": "United States of America",
    "postal_code": "02893",
    "state": "Rhode Island",
    "latitude": "41.6953022",
    "longitude": "-71.5018519",
    "rating": "4.5",
    "reviews": "368",
    "working_hours": "Monday: Closed, Tuesday: 11:30 AM-9:45 PM, Wednesday: 11:30 AM-9:45 PM, Thursday: 11:30 AM-9:45 PM, Friday: 11:30 AM-9:45 PM, Saturday: 11:30 AM-9:45 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "This was my first time ordering Indian cuisine. Let me tell you... it was DELICIOUS! I placed my order online, it was very user friendly. When I arrived, it was ready in the amount of time stated and the gentleman that rang me out was very nice and confirmed everything in my order. I will definitely be ordering from this restaurant again.... SOON!  :)",
    "Review 2": "Up until yesterday we've only have had done delivery but decided to come dine in this time. We decided to try different menu items from our usual and let me tell you that so many flavors were dancing on our tastebuds! Every bite was incredibly delicious and the food was reasonably priced for all that we got. Our waitress was very knowledgeable, attentive and informative. Will be returning for dine in and or ordering takeout again in the future.",
    "Review 3": "Another great meal at Masala. Located near to all your favorite shopping centers in Bald Hill road tucked in there West Warwick, RI and worth the drive from distance. The food is exceptional and freshly prepared if eating in like we did or with take out. The aroma and spice is wonderfully combined into both Indian and Pakistan traditional dishes that are worth the trip, like we did from North Providence! The service was personable and so very attentive and I know that Sahara will take good care of you too! Don't miss out on this local gem!",
    "Review 4": "Went for lunch. Great food and awesome hospitality. The young female waitress is very knowledgeable and passionate about her job. She made it super easy to decide on what we wanted. Always good food and nice service. Thank you for myself and wife's wonderful experience here. ❤️😊",
    "Review 5": "The food was so amazing me and my girlfriend had to order again the very next day. Staff is very nice and considerate, overall great experience will definitely be eating hear again :)",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipP3gUWDFtgMZt8-kAtkFfI9y7quU5h-kCY9qpPM=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO4NqOqO7WRMMQ3IFxDIA4PTLLP3LpjLVFwwilM=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNJEMoCnJwI1jyNJvEyZjmhxItF_JS9jE2wnHY=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO0mmlN86BufG3FlaN5odYAeHMXXklsHbZorB72=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNdo4dhzWKt5SlVs708hbAGz3qraDzBcs_rwo87=s680-w680-h510",
    "name": "Not Just Snacks",
    "site": "http://www.notjustsnacks.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-831-1150",
    "full_address": "833 Hope St, Providence, RI 02906",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02906",
    "state": "Rhode Island",
    "latitude": "41.849768",
    "longitude": "-71.394414",
    "rating": "4.4",
    "reviews": "405",
    "working_hours": "Monday: 11 AM-9 PM, Tuesday: 11 AM-9 PM, Wednesday: 11 AM-9 PM, Thursday: 11 AM-9 PM, Friday: 11 AM-9 PM, Saturday: 11 AM-9 PM, Sunday: 11 AM-9 PM",
    "Review 1": "Real india food here. I was generally satisfied with them. But the price was a little bit expencive for me.",
    "Review 2": "I got the paneer tikka masala with garlic naan and it was delicious!! Perfect seasoning and flavor.",
    "Review 3": "A descent Indian restaurant with a good food. You have so many options to choose, and every choice is a good choice if you love Indian food. Also, the place is not fancy at all and you can bring your own bottle.",
    "Review 4": "It was absolutely great. We've been to other places and this one had the best variety, the best flavoring and more personal attention.  We didn't even leave yet and already discussing going back again.",
    "Review 5": "This place is honestly the most solid, delicious, and consistent Indian restaurant in Rhode Island. Food always on point and the prices are good. My only gripe, which doesn't matter in the slightest, is that I wish they had more comfortable seating for when you decide to dine in.",
    "photo 1": "https://lh5.googleusercontent.com/p/AF1QipNoYypqa05ShzwO058z3xsvwnGOb18VVWFb3gMi=w141-h141-n-k-no-nu",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipNoYypqa05ShzwO058z3xsvwnGOb18VVWFb3gMi=w141-h141-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOd9i2MpComcXVdkqhz3uggoJbiHFGj5-Y5pC0J=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipO3_6hB1vAXkoVrGOHW4N7ljRXROkujrr4AuTiL=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOgrTqNOmejD0RsuHLME6Hgl6ssSyF4vsZHUUx7=s680-w680-h510",
    "name": "Providence Biryani",
    "site": "https://providence-biryani.business.site/?utm_source=gmb&utm_medium=referral",
    "type": "Asian restaurant",
    "category": "restaurants",
    "phone": "+1 401-354-9426",
    "full_address": "65 Bath St, Providence, RI 02908",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02908",
    "state": "Rhode Island",
    "latitude": "41.8319184",
    "longitude": "-71.4241043",
    "rating": "4.2",
    "reviews": "42",
    "working_hours": "Monday: 12 PM-12 AM, Tuesday: 12 PM-12 AM, Wednesday: 12 PM-12 AM, Thursday: 12 PM-12 AM, Friday: 2 PM-12 AM, Saturday: 12 PM-12 AM, Sunday: 12 PM-12 AM",
    "Review 1": "This was not a good experience, or good food. Lamb gyro with rice was dry, lettuce was old. Will never return. But the guy who gave me the food was very nice.",
    "Review 2": "This is a takeout/pickup place only. The street view in the Google Maps is inaccurate. Please see the photo below of takeout entrance.",
    "Review 3": "Food was so yummy, chicken biryani is sooo good, very authentic. I also am a big fan of the kheer! Its also all halal",
    "Review 4": "Placed call for pick up and was told order will be ready in 25-30 min. Arrived 45 min later and was told by gentleman behind the counter \"it would be awhile\" and said he couldn't elaborate. My order was also not listed as even placed on the overhead tracker. I would recommend you try a different indian restaurant",
    "Review 5": "Bland fries are called seasoned fries . Also one item was missing from the order . The seekh kabab was broken half like someone ate the rest .",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMOidjLhbLqGMg_o4nce_6fWXhKaXCc2jbKLFM1=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMfV-4C8uyAMboA__c43_e2B4tAkKkI9x-M8a8g=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPFIo2AdbIq98NNeSs_DSJUUzJ5xZci3U9Y9BpH=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNPqtgWJgM8VXiBw9AgTzGkKS7c2BcxHmMkabcb=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOYhWCH0XH_iJw9Y2AIJgNCoSpNILwEa5X9FyC6=s680-w680-h510",
    "name": "Rasa Restaurant",
    "site": "http://www.rasarestaurantri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-398-2822",
    "full_address": "149 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "country": "United States of America",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.6618225",
    "longitude": "-71.4502543",
    "rating": "4.6",
    "reviews": "797",
    "working_hours": "Monday: 11:30 AM-9 PM, Tuesday: 11:30 AM-9 PM, Wednesday: 11:30 AM-9 PM, Thursday: 11:30 AM-9 PM, Friday: 11:30 AM-9:30 PM, Saturday: 11:30 AM-9:30 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "I got here a little late, my expectations where a bit lowered based on the fact that  I got there 15 min. Before closing. ordered the mix Grill. Owner was very focused on the quality of the meal. And man, was the meal phenomenal. Especially the lamb portion. HIGHLY RECOMMEND  you try this place.",
    "Review 2": "So SO good! The tamarind margarita was incredible, service was very friendly, and the food was amazing. There are so many things I want to go back and try. Very fairly priced - $40 each for a drink/apps/meal.",
    "Review 3": "The best Indian food I've had. Owner/Manager is very friendly and nice. Staff is wonderful. Great cocktails you will find no where else. Beautiful inside.  Nice street setup for summer nights. Easy to order on line and pick up.",
    "Review 4": "We were here for the first time and ordered take out while returning from RI to MA. The food 🥘 we ordered was Ragda Patis, Cauliflower 65, kulcha,  Veg Biryani. The portion was good and the food was 😋 tasty. The Veg biryani needs special for the attention to detail it was given while preparation.",
    "Review 5": "Outstanding Indian! The small plates and cocktails steal the show. But everything is authentic. Everything is flavorful. This is top quality Indian cuisine. Great to see South Asian Americans dining here. I have to give high marks to the cocktails. The spiced old fashioned is best old fashioned I've ever had, and the Old Monk dark and stormy is also a winner. A great find on a strip full of good and great restaurants.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNCtMkggLYz3lNrjOL2hEjpqmUcl2kiuegz_Iaw=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipN3mJrqhkIm3-jEM08pdlZABJb03hYTTKwU_bEj=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPVzpXZdWcu2BBQW2I88aD_IhpQVWWSdljGM8GN=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNDnulLY3OrJm5bxsn_kqpBgpRSmTudTweJ_BMu=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOQvI3Nm0GNDnuexccxxoD4hvJr83tVwjpw4yXS=s680-w680-h510",
    "name": "Rasoi",
    "site": "http://www.rasoirestaurant.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-728-5500",
    "full_address": "727 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "country": "United States of America",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.8582267",
    "longitude": "-71.3916142",
    "rating": "4.4",
    "reviews": "660",
    "working_hours": "Monday: 11:30 AM-9:30 PM, Tuesday: 11:30 AM-9:30 PM, Wednesday: 11:30 AM-9:30 PM, Thursday: 11:30 AM-9:30 PM, Friday: 11:30 AM-9:30 PM, Saturday: 11:30 AM-9:30 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "Nice place, clean. Food Was good. The drink I had, not quite my taste, but I tried something new. You can sit outside.  Clean restroom.",
    "Review 2": "I’ve been coming here for years. They always have good quality paneer. Love the food. The Chicken Tikka app is my favorite. They recently started upgrading the inside a bit at a time and I like the way it looks now. Lunch portions are a good size and super reasonable priced. (Like $10) they have a few vegan options too so I can go out with my vegan friends",
    "Review 3": "We went here on a weekend for dinner, ambience was good. Food tasted nice but was quite heavy on the stomach. We ordered dhokla, aloo tikki chaat, veg biryani and jackfruit masala. Dhokla was super dry, aloo tikki was really good, biryani was good but more like a pulao, jackfruit was okay. Servers and management are attentive and warm.",
    "Review 4": "This restaurant is the best Indian Restaurant! The food is absolutely delicious and flavorful! The employees, management and everyone there always make you feel welcome and goes out of their way to make sure you are enjoying your meal! If you haven’t been here you are missing out! I can’t even name just one favorite because everything is fantastic but if I had to it would be Shrimp Madras and Aloo Gobi!",
    "Review 5": "My friend and I went here for lunch. The lunch special was so plentiful, yummy, and affordable. My friend who is a little more high maintenance than myself was also pleased. We marveled at how clean everything was including the restroom. Service was sweet and our ice teas were marvelous. In the mood for Indian food, this is the place to go.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOXCrd3DlF_kYdJtIQP9mS1zGl8O7kzJsdC4VDk=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPwjky6WamJPT5MSx5M-QVE7VNCnA62yc33tqoI=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMeyudbnxqoIg5q0u6kPDGOrJwYNPVtPSWut8zz=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipOHumny7MzRNiui0ow4TriEmsJexXEaMUJlnDSr=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOnRo-am4IB_tAWuzlho7Q_9pnU1bkpcbL-MKfk=s680-w680-h510",
    "name": "Swagat Indian Food",
    "site": "N/A",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-762-0587",
    "full_address": "480 Diamond Hill Rd, Woonsocket, RI 02895",
    "city": "Woonsocket",
    "country": "United States of America",
    "postal_code": "02895",
    "state": "Rhode Island",
    "latitude": "42.015673",
    "longitude": "-71.4975116",
    "rating": "4.7",
    "reviews": "323",
    "working_hours": "Monday: Closed, Tuesday: Closed, Wednesday: 5-9 PM, Thursday: 5-9 PM, Friday: 5-9 PM, Saturday: 11:30 AM-2:30 PM,5-9 PM, Sunday: 11:30 AM-2:30 PM,5-9 PM",
    "Review 1": "If you are new to Rhode Island, then you must try coming here. It’s great place to eat north & South Indian food.",
    "Review 2": "They serve warm and fresh food to all their guests. You see the efforts they put once you taste their menu. Everyday they have something special. Not to miss their Lunch buffet on Friday. I highly recommend it to all Indian cuisine lovers.",
    "Review 3": "My favorite restaurant we love every dish they prepare, especially pesarattu upma every weekend, idli more, all items are fresh and very good. When i got sick i ate food from them everyday by to go orders ( bought by my hubby) and my tummy was happy in recovering process. Healthy to eat everyday as well which i discovered from here fresh tasty yummy food 🍱 Thanks Andi",
    "Review 4": "The taste and quality of the food here is always consistent and tasty. The owner is very humble and willing to hear out to customers. The idlis are like a pieces of cloud and Dosa qualifies the golden color check (unlike the ghost dose that most restaurants serve). Must try if you are in this area.",
    "Review 5": "Their South Indian food cuisine is top notch, especially their dosas and chole bahture! Although the space is small there is a lot of love! The owner of the restaurant was very kind and helpful.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOFSycUXsFoj0j-_DFe2T7LSiFiPKP4T_gFgy_z=s680-w680-h510",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipPloMr86tsbV3fCow1srvmFWanYFXCmes78v6Sd=w141-h118-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNMttsk6gIMIYIVWkwDX4lvL4Nb7OS9mNUF5Zep=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPtg89ki-WDkHORcjRLXuDun3yzSZu9-I85yZ8v=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOwUXfkBedRkWVy7_wasrtxAaxUfpxcbaxvaXep=s680-w680-h510",
    "name": "Taj Indian Restaurant & Bar",
    "site": "http://tajrhodeisland.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-642-7545",
    "full_address": "49 S County Commons Way, South Kingstown, RI 02879",
    "city": "South Kingstown",
    "country": "United States of America",
    "postal_code": "02879",
    "state": "Rhode Island",
    "latitude": "41.4561248",
    "longitude": "-71.4708849",
    "rating": "4.7",
    "reviews": "150",
    "working_hours": "Monday: 11:30 AM-9 PM, Tuesday: 11:30 AM-9 PM, Wednesday: Closed, Thursday: 11:30 AM-9 PM, Friday: Closed, Saturday: 11:30 AM-9 PM, Sunday: 11:30 AM-9 PM",
    "Review 1": "I just love their food. I am a picky eater and so is my family. We love coming here for Indian food. We have also used Taj Restaurant for small event catering. They have been really great.",
    "Review 2": "Wonderful restaurant.  Service was a bit scattered, but I am giving servers a pass during the pandemic.  Most importantly, the food was delicious!  I live spicy food, but I have learned not the ask for \"hot\" in an Indian restaurant.  Medium was just fine to give me the kick I wanted without intense pain.  I had goat, and it melted in my mouth.  My wife had a vegan avocado dish.  She couldn't stop singing it's praises.  We came here to celebrate our 26th anniversary and we weren't disappointed.",
    "Review 3": "Good naan and tasty sauce. $2 extra for garlic naan vs plain naan. Dry chicken. Slow in dining service. Attentive water refills. Quiet and not busy. On the expensive side of things. Entrees can be portioned into 2 servings.",
    "Review 4": "Amazing, amazing, amazing! We were walking past this new restaurant and wanted to check it out. The food came out just amazing, the naans were full of onion and garlic making it the best we have ever tried. We also tried the fried okras which is 10/10. The cauliflower tasted great too. The waitress Ritu was also very knowledgeable and recommended some of the dishes that were outside of our comfort zone and tasted great! Will definitely come back!",
    "Review 5": "Let me first start off by saying that the food was very authentic and fresh, and I highly recommend a visit.  My only knock was most likely due to a staffing shortage, as 1 person was visible doing everything to wait on all tables.  Food took a while to arrive.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNmryKUpyLDwTroQZJTczuKsmy9P6nG7Nfw9JNG=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPlUBEoQ80F7Chk0bOBcaAOEnJf3DVWL6DZftGs=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMOYBWX77Yn5m3NwXoJipo1q7Lzm2qq_A9I4M5k=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNj92tYQLcGfBamI3FsE0znViAhslNNnEpV2HYM=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOgTNPbykLOC0_3nrF8-fv0sHskoibcJzbLcVC_=s680-w680-h510",
    "name": "Taste of India Restaurant",
    "site": "http://www.tasteofindiaprovri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-421-4355",
    "full_address": "230 Wickenden St, Providence, RI 02903",
    "city": "Providence",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.8195389",
    "longitude": "-71.398713",
    "rating": "3.9",
    "reviews": "341",
    "working_hours": "Monday: 11:30 AM-8:45 PM, Tuesday: Closed, Wednesday: 11:30 AM-8:45 PM, Thursday: 11:30 AM-8:45 PM, Friday: 11:30 AM-8:45 PM, Saturday: 11:30 AM-8:45 PM, Sunday: 11:30 AM-8:45 PM",
    "Review 1": "Indian restaurants are my favorite. This one was the worst I’ve been to in regards of the taste. The food has no spice, not even salt or pepper. Plus, it’s small portions and expensive. The place was nice, the waitress was nice, another employee too but unfortunately, I came here expecting to have, above all, good food.",
    "Review 2": "Great service and the food was yummy and very generous  with the portion of food I would recommend this place.",
    "Review 3": "Lamb and chicken masala were delicious and the tandoori too!! The naan and rice were so good. Definitely recommend",
    "Review 4": "Average food, staff lacks interest. not allergy aware, told me they could not guarantee specific ingredient will not be in my food (lemon juice). when asked for a piece of onion, informed me it will cost $2.25 for \"Indian salad\". I have never ever been charged extra for a piece of onion in any Indian restaurant before this.",
    "Review 5": "Great samosas, great garlic naan, great mango lassi, and great papadams. Their chicken tikka masala is also excellent and the lunch portion is generous. Reason for the four star review is their chicken vindaloo. It really lacked the spice, tang, and the wow factor that I usually get from a great vindaloo. It’s my go to dish and this left me very disappointed. However, everything else was so good I’ll definitely be back and will try something else!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipM7HIWYcqWZoye_3Ufo4OoPgcPxUo6W_cQt3lIx=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNH2UgpnAr0GOcTdiJ2Abk7BSC2rHB3FnQouni1=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNbHwSov5r9T6xJ9FS19cOLb9lVzrGK2DGgorQl=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP6eakIwoI4_wVLDhMNrJMm7gQbJdKSzA5pXBlP=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNpNuEZ3_kgPb7axHws6V1VqnPyXWOyFEAqa_gx=s680-w680-h510",
    "name": "The Punjab Indian and Himalayan Cuisine",
    "site": "https://www.beyondmenu.com/52495/johnston/the-punjab-indian-cuisine-johnston-02919.aspx?s_vid=amp-wWUVcoogxFlb51dFa_tVsA&utm_source=satellite_mobile&utm_medium=home_btn_view",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "+1 401-270-5687",
    "full_address": "1565 Plainfield Pike, Johnston, RI 02919",
    "city": "Johnston",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.7917876",
    "longitude": "-71.49117",
    "rating": "4.5",
    "reviews": "363",
    "working_hours": "Monday: 11 AM-9 PM, Tuesday: Closed, Wednesday: 11 AM-9 PM, Thursday: 11 AM-9 PM, Friday: 11 AM-9 PM, Saturday: 10 AM-9 PM, Sunday: 10 AM-9 PM",
    "Review 1": "Food was fantastic and the vegetable samosas were the best I've had anywhere in a long time. My chicken curry was delicious and very plentiful. Dine in service was top notch and everyone was very pleasant and welcoming. I look forward to going back!",
    "Review 2": "Food was simply amazing !!  If you’d really wanna try some himalayan / indian food then this is the perfect place in town !! Will rate them 10/10 for the taste , food quality , cleanliness and service !!",
    "Review 3": "For folks like me we enjoy eating a eclectic variety of foods at just as many restaurants. Yet when it comes to Indian, we are looking for a local business that serves intoxicatingly aromatic and great food, to  return to over and over again. Punjab is that place. Fresh food, great service and a wonderful atmosphere. That and all at the best prices within 20 miles of any establishment serving Indian around!?  Moments from 295 right there on plainfield pike, so do not miss out!! You will not be sorry!",
    "Review 4": "Had a one of a kind experience! Everything from the service, to the food, to the environment, it was great! We got here at 8pm-ish and we got excellent service! You don't normally see that! Our waiter was attentive and friendly! Even brought out a spice he wanted us to try and it was amazing! Really, felt like a VIP or something at this place! Oh and their menu, literally is amazing!",
    "Review 5": "Ordered food to go and it was ready in a flash and still nice and hot when we ate it.  Had butter chicken and ordered medium heat which was the right amount for me.  Also ordered garlic naan and ginger/honey naan.  Both good. Lots and lots of ginger so it you do not like whole ginger this wouldn’t be for you. I happen to love it so was delighted. Very clean and easy to find.  Will dine in next time for the full experience.  Portions a little smaller than our typical go to place for Indian food - that’s the only reason for the 4 stars.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNKNOZzUKj4UqgdmRs80Jj7_USkXTsTyLCbwjpP=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipN39QePh4UdNODrLIylu8R70_49uJ01-YtKHdOx=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOlWFPJeGxdbSq4WdauSCWWlePeNGam529vijf3=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMp3MBEU62Q0gM5iuYNJKvOlcdCE4e9x99NRZk7=s680-w680-h510"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipMAAojSSMmHX0xbXSl6WK6g789KgR7UCZDbh0VH=w141-h141-n-k-no-nu",
    "name": "KOLACHI Pakistani Restaurant",
    "site": "https://www.kolachirestaurant.com/",
    "type": "Pakistani restaurant",
    "category": "restaurants",
    "phone": "(401) 231-4249",
    "full_address": "100 George Waterman Rd, Johnston, RI 02919",
    "city": "",
    "country": "United States of America",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.842530",
    "longitude": "-71.486010",
    "rating": "4.6",
    "reviews": "39",
    "working_hours": "Wednesday:11 AM–9 PM, Thursday:11 AM–9 PM, Friday:11 AM–9 PM, Saturday:11 AM–9 PM, Sunday: 10 AM–9 PM, Monday: Closed, Tuesday: 11 AM–9 PM",
    "Review 1": "Warm and genuine service, complimentary salad with a delicious spicy cilantro sauce. Food was great and the atmosphere was comfortable despite no music playing. It was a shame for this place to be empty on a Saturday night!",
    "Review 2": "Food was amazing,  chapli kabab were so big the chicken tikka was really good very juicy.,Naan is soo soft and buttery,Nihari was so tasty muttan Briyani was also very yummy its a great place to go if you want some amazing desi food they also serve breakfast i will definitly be going again😁.",
    "Review 3": "We ordered food for takeout from here and thoroughly enjoyed every bite of it. I had the Chapli kebab and the white karahi, which were simply phenomenal. This place definitely lived up to my expectations, and we will undoubtedly order from here again.",
    "Review 4": "Great place, loved it very much. Nihari was good and so was the Hakeem. They had nice service. Definitely will come back.",
    "Review 5": "I recently had the pleasure of trying KOLACHI's nihari and it was absolutely amazing! The flavors were bold and the meat was incredibly tender. I was truly impressed by the quality of the dish. I highly recommend KOLACHI to anyone in search of authentic, delicious Pakistani cuisine. Five stars!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMUPmPFjg_8mjNLsFQb1PmEFwfTKDe6ACfvrDg6=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPFBnxvXTGgY7W2YKMz5E-GeNOCm1UTTnWaC_3b=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPgaPJhoO-4nIDZWXdWNNo8omXtmakduKUrUDe-=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPEYwKmfMoyfC2GVE4_NgbxVAZxmH8iir6odmxD=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPn6loA68nFUxoByyb7HLJvNgQYqbSjdc6Ll1Fi=s680-w680-h510",
    "name": "Mehfil Indian Cuisine",
    "site": "https://mehfilri.com/",
    "type": "Indian restaurant",
    "category": "restaurants",
    "phone": "(401) 488-4297",
    "full_address": "828 Diamond Hill Rd, Woonsocket, RI 02895",
    "city": "Woonsocket",
    "country": "United States of America",
    "postal_code": "02895",
    "state": "Rhode Island",
    "latitude": "42.015890",
    "longitude": "-71.491010",
    "rating": "4.9",
    "reviews": "22",
    "working_hours": "Wednesday: 11:30 AM–2:30 PM, 5–10 PM, Thursday: 11:30 AM–2:30 PM, 5–10 PM, Friday: 11:30 AM–2:30 PM, 5–10:30 PM, Saturday:12–3:30 PM, 5–10:30 PM, Sunday:12–3:30 PM, 5–9:30 PM, Monday: Closed, Tuesday: 11:30 AM–2:30 PM, 5–10 PM",
    "Review 1": "We did order both veg and non veg appetizers and main course, food was fantastic, very good ambiance and owner and staff were very very hospitable. Strongly recommend this restaurant for Indian cuisine and delicacy foods",
    "Review 2": "Finally an Indian restaurant in Woonsocket! I got veg samosas, chicken tiki masala, butter chicken & garlic naan. Everything was delicious. My fav was the tiki masala. It had so much flavor. The chicken was white breast meat and was nice & tender. Samosas are a good deal since you get 3 per order. I wish them luck.",
    "Review 3": "A hidden gem. My husband and I really enjoyed our dinner. Friendly helpful staff. All food was delicious and timely. Very clean as well. Will be returning",
    "Review 4": "Everything was delicious!  We got the butter chicken, garlic naan bread, and paneer tikka masala and they were both so good!!! I can’t wait to try other menu items.",
    "Review 5": "It's a new India Restaurant in the vicinity and it's really good. The taste is far better compared to many competitors nearby. We tried Mutton Biriyani, Chilli Chicken, Chepala Pulusu(Fish curry). Every dish was perfect. Must try India Restaurant.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNVaYZO_R3mslV-mvTTm-wfeyzMnGU59xDUSwsI=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOIBUpCz_Bos7GZXFmYuMThBHQrleLblPeWBlE8=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNvoWSM2q-Mv1w8r0rHgyZXuEqSabwkdg2JwCXM=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipP84KYobUQaRfZpHR-UfQNN9MaWugM3g3YOa6YL=s680-w680-h510"
  }
]
