[
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipMed1ggNR3kpT_yT4owoLNEnSoZrFxSpysda3tE=s680-w680-h510",
    "name": "Aviva Threading Salon",
    "site": "https://avivathreadingsalon.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14014664656",
    "full_address": "301 Wickenden St, Providence, RI 02903",
    "city": "Providence",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.819402",
    "longitude": "-71.397158",
    "rating": "4.8",
    "reviews": "81",
    "working_hours": "Monday: 10 AM-6 PM, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 10 AM-6 PM, Saturday: 10 AM-5 PM, Sunday: Closed",
    "Review 1": "Very nice lady , efficient and definitely knows what she is doing. I loved how my eyebrows turned out, will be going back soon",
    "Review 2": "I was visiting Providence and Newport and decided to get my eyebrows threaded since I didn’t have a chance before leaving on vacation. This was such a great experience in a beautiful and clean environment. The prices were more than reasonable and I will definitely frequent again on my next trip to Providence.",
    "Review 3": "Can’t rave enough about this establishment. Very friendly, warm owner who goes above and beyond to listen to you and deliver. I honestly came here not knowing what to expect and she comforted me well. My eyebrow came out sharp and full just how I like them. My lip and chin were done perfect and with great ease. Thread is high quality and the salon is clean. It smells good in there:)",
    "Review 4": "I get Male eyebrow threading here. Owner operated. Same women every single time you come back. Great prices. BEST SERVICE!!",
    "Review 5": "Very nice shop. The lady there always does extremely thorough cleaning and shapes my eyebrow so nicely. My eyebrow and upper lip looks so good when done. She is the only one I trust my eyebrow with. Highly recommend",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPiAp_b5Lr6ZB16rvzzJfK_pQzleEvfIyRddju6=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOJdQYs4K3EtjdiPG3nn2IKX3A8g1FXdrCWOwJ5=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipN7cQHNYVaOXCLMI5XZ73hVRepIKp2_zzIwGT1v=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipM51PBqrFg82JEqFhArC1Wypx-LfjqTZO3pTw5o=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Devi's Threading",
    "site": "https://www.facebook.com/Devis-Indian-eyebrowsthreading-2254416521454690",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-677-9218",
    "full_address": "958 Mineral Spring Ave unit #4, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.869773",
    "longitude": "-71.4196368",
    "rating": "4.9",
    "reviews": "145",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-6:30 PM, Wednesday: 10 AM-6:30 PM, Thursday: 10 AM-6:30 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Devi does my brows perfectly every time, she has been doing my brows for a few years now she is the best.",
    "Review 2": "My mom, brother, & I have been going to Devi for years & she’s always done a great job with threading our eyebrows. I recommend going to her for sure",
    "Review 3": "Devi is opening and kind, very respectful she threads my eyebrows quickly and it didn't hurt as much!! I totally recommend on going here, the payment is perfect and the services is the top notch!! YOU'LL SHOULD TRY IT!!",
    "Review 4": "Devi is truly amazing. As someone who has thin eye brows it’s hard to find people who really knows how to bring shape and make my eyebrows look fuller. Devi never disappoints!",
    "Review 5": "I’ve been looking for an amazing eye brow threading place for the past two years since I moved to RI. I’ve tried so many and the first time I tried to visit Devi’s she was on vacation. I finally was able to go back again and try her. I told her what I wanted in the beginning and let her do her magic. She slayed my eye brows and I didn’t even have to tell her to complete a touch up at the end or anything. She shaped them perfectly and removed all of the hair outside of my eye brow shape. Love that she did it in one shot and didn’t have to have me tell her to fix anything! She’s for sure the best in RI and hiiiighly recommend her, she knows how to do eyebrows!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPSMILoRfN6MneL5UBNA85T-Tj7_BEFwRC5J-Qn=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO-2NttAgwvajFy1lYHjuAteOrIiSboCk5PJQPt=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPSMILoRfN6MneL5UBNA85T-Tj7_BEFwRC5J-Qn=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMMsgVa-4BkA1H2CjO-aq9gvCIp8n9ApP-D8YPW=s680-w680-h510"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipNWc0ZNXgwdfdneKhRp9paCITye-Irq8jbAwy0v=w141-h101-n-k-no-nu",
    "name": "Hema eyebrow threading",
    "site": "https://hemaeyebrowthreadingri.com/",
    "type": "Hair removal service",
    "category": "Hair removal service",
    "phone": "+1 401-256-3292",
    "full_address": "307 Waterman Ave, East Providence, RI 02914",
    "city": "East Providence",
    "postal_code": "02914",
    "state": "Rhode Island",
    "latitude": "41.8196386",
    "longitude": "-71.3674208",
    "rating": "5",
    "reviews": "84",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 9 AM-6:30 PM, Saturday: 9 AM-4 PM, Sunday: Closed",
    "Review 1": "Hema is a GEM. I lost trust in threading places after getting my eyebrows butchered by another place years ago. She has made me trust again and love my eyebrows all over again. She’s become my only eyebrow tech ever since I stumbled upon her last summer!!",
    "Review 2": "Hema is the only person I trust with my eyebrows. She is so professional, talented, and kind. I always leave her salon feeling confident and 100% satisfied with my experience. She is absolutely amazing I can not recommend her enough. I just had my eyebrows tinted by her for the first time and they look the best I have ever seen them. I will never go to another threader again!",
    "Review 3": "I came to Hema for a walk-in eyebrow threading/shaping appointment. She was friendly and fast and my eyebrows look great! The whole process was painless and took less than 5 minutes. I'll definitely be coming back!",
    "Review 4": "Hema is AWESOME! She is very detailed, precised and knows what exactly what she's doing. My eyebrows have never looked so good. AND she's super sweet/friendly. Trust you will not be disappointed 😙👌🏽",
    "Review 5": "Hema is absolutely amazing! She shaped my eyebrows perfectly. I was in need of some mommy time and she fixed me right on up. I can't stop staring at my eyebrows now. She was very polite, attentive and professional. The whole process was quick and painless. I would give her 10 stars if I could!! Thank you so much Hema! You're awesome! I will see you in 2 weeks.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMW6tYKOGgnobjxgcVoIgzQ-U6P8_jODVRHA_9e=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMEDM4j7-LqqkqkP396BMgoPtqO9XzSXp7ptbEV=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMPhyw3PwsR18qVp4h1TvjBe0AfIqyifLrh41I7=s680-w680-h510",
    "photo 4": "https://lh5.googleusercontent.com/p/AF1QipNWc0ZNXgwdfdneKhRp9paCITye-Irq8jbAwy0v=w141-h101-n-k-no-nu"
  },
  {
    "photo 5": "NA",
    "name": "Lucky Eyebrow Threading",
    "site": "N/A",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "NA",
    "full_address": "355 Broad St, Central Falls, RI 02863",
    "city": "Central Falls",
    "postal_code": "02863",
    "state": "Rhode Island",
    "latitude": "41.8841909",
    "longitude": "-71.3865888",
    "rating": "NA",
    "reviews": "NA",
    "working_hours": "NA",
    "Review 1": "NA",
    "Review 2": "",
    "Review 3": "",
    "Review 4": "",
    "Review 5": "",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "NA",
    "name": "Neelu's Eyebrow Threading",
    "site": "http://neelueyebrowthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "16172406024",
    "full_address": "400 Bald Hill Rd, Warwick, RI 02886",
    "city": "Warwick",
    "postal_code": "02886",
    "state": "Rhode Island",
    "latitude": "41.72445",
    "longitude": "-71.4767816",
    "rating": "2.9",
    "reviews": "49",
    "working_hours": "Monday: 10 AM-8 PM, Tuesday: 10 AM-8 PM, Wednesday: 10 AM-8 PM, Thursday: 10 AM-8 PM, Friday: 10 AM-8 PM, Saturday: 10 AM-8 PM, Sunday: 10 AM-8 PM",
    "Review 1": "I liked the results of my eyebrows once they were done, but the attitude given to me was terribly unpleasant and unprofessional. The eye rolls, scoffs, and dirty looks were unnecessary. She then began to get pushy, even though I had said it was my first time. She crossed the line when she began pushing my head back and aggressively rearranging my hands to hold up the skin, where she was threading. She made my experience unpleasant and humiliating. Beware they are not afraid to rip the skin off your face if they don’t like you. I recommend that you teach your employees how to communicate with your customers better.",
    "Review 2": "The lady (I forgot her name unfortunately) was extremely nice the first time I went here. I was with a group of friends and she offered us free Henna because we couldn't afford it at the time. She was very nice, but very pushy. I understand that it's good to try to be pushy in business, but she crossed the line a bit. Overall, it was a pretty good experience the first time, but the second time wasn't really. We couldn't decide if we wanted to get our upper lips waxed (me and my friend) and my other friend wanted an eyebrow threading. We were sitting on the couches in front when they lady said to come to the back room with her because she wanted to show us something. We said okay although we were confused as to what she wanted to show us. She took us back and then said \"Who's first\". At this point we felt we didn't have a choice although we were very nervous to do this. We told her it was our first time and she tried to comfort us, but in a very pushy way. When it was my turn to go she started immediately (I was not ready). I kept moving because I was extremely nervous and she told me to stop, but didn't give me a chance to. When she did wax my upper lip she didn't get all of it and left remnants at the top. I wish I could have given a better review, this is just my opinion of the experience.",
    "Review 3": "My first time going there was an okay experience, this lady was tall and she did an okay job with my brows. She took a decent amount of time doing each brow. I then went to go the second time, I didn’t have the same lady, this lady was much shorter, first off I was waiting out of the store, she saw me through the reflection of the mirror, but didn’t seated me because she was ON THE PHONE. Five minutes went by and she seating me, then I saw her put on her airpods, so clearly she was on a call while doing my brows. I told her I wanted cleaning no shape nothing! She did the complete opposite! She ruined my brows! My brows used to be super thick and now they are super thin!! She also did both of my brows under 10 minutes! Worst service, highly unprofessional! I literally cried when I went home. I still paid but it wasn’t worth it. Ladies don’t go here!!!  If y’all have thick brows this isn’t the place for you!",
    "Review 4": "I left a review on this site about 6-7 months ago speaking about employees charging me extra and taking tips. On their site it is listed as $10. They charge me $12 and whenever I had cash, usually a $20, they would give me $7 back, they stole extra money from me every time. November 27th, an employee came up to me, questioned me about my review and made me change my review. She was extremely rude and she straight up ambushed me. I've gone to this place for years and I felt so disrespected. Upon speaking to her I felt ambushed, and she forced me to delete my review. She was pushy and told me to lie and say that they give good service. Never again.",
    "Review 5": "I went for upper lips and the girl name SABINA is super rude and always give me a  bad look .I never go to her. But the day I went she took me for upper lips and when I told her, that my upper lips is not clean properly, she got frustrated on me and started yelling at me and keep telling me bad stuff. Who does treat there customer's like this?? I have seen SABINA and other  girls making fun of  customer's and talk in there own Nepali language. Very unprofessional staff specifically SABINA. She thinks she owns the place and she is the boss. Lots of customers have complained, but I guess the owner Neelu does not care. Please guys do not go the girl SABINA. Neelu if you really care about your customers then you need to talk to SABINA. Being rude to customers is not going to help her neither you. Respect your customers and stop making fun and speaking in your native language in front of your customer. Guys be aware about this place. Hope some action being taken against SABINA.",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipObX9Yl0DMguAKuL6dW62fX6wApymKB_qmxd9du=s680-w680-h510",
    "name": "Priya Eyebrow Threading",
    "site": "N/A",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14018257947",
    "full_address": "799 Tiogue Ave, Coventry, RI 02816",
    "city": "Coventry",
    "postal_code": "02816",
    "state": "Rhode Island",
    "latitude": "41.6819405",
    "longitude": "-71.5644795",
    "rating": "4.7",
    "reviews": "85",
    "working_hours": "Monday: 10 AM-5 PM, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-5 PM, Sunday: 10 AM-4 PM",
    "Review 1": "Absolutely fantastic! Does an amazing job on my eyebrows. I have received so many compliments since getting them done here. I used to spend a ton of money getting waxed at a spa, only $10 to get them threaded here!! Cant imagine going anywhere else now!",
    "Review 2": "I was nervous because I never had my brows threaded before. They were so kind and did a great job. I’ll definitely return",
    "Review 3": "I’ve been coming here for about two years now. Both the ladies in there are great!!! Super friendly, fair prices, non-intimidating environment (some beauty spots you get the “glares”, here you do not). They are both extremely talented and ALWAYS do a good job. I’ve gone twice a month for the last two years (besides COVID shut down) and I walk out of there feeling satisfied with their services  every single time. 10/10 highly recommend.",
    "Review 4": "I love Priya! She’s so nice and she’s the only one I trust with my eyebrows! Perfect every time!",
    "Review 5": "I was greeted as soon as I walked in and was seen immediately. I explained my particular needs and she understood. She did an excellent job with my eyebrows and I would absolutely recommend this place and see myself returning in the future.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPONsOS-cAYhrIvdl8xeX2X6FhzUptAf7D_I1Pi=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOFge1eBOCdpA3NdADO9JTxoppW3pz4zXlXfVzS=s680-w680-h510",
    "photo 3": "",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNLaPesDbqlVHK_eb8RIHPANY4A1EkA808PHvKp=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Royal Eyebrows Threading",
    "site": "N/A",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-943-3339",
    "full_address": "39 Phenix Ave, Cranston, RI 02920",
    "city": "Cranston",
    "postal_code": "02920",
    "state": "Rhode Island",
    "latitude": "41.7823758",
    "longitude": "-71.4666719",
    "rating": "4.6",
    "reviews": "60",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 11 AM-4 PM",
    "Review 1": "The only place I trust with my eyebrows. The place is very sanitary. They are completely professional and do an amazing job.  They take their time and ensure you are happy with the results. I would NEVER go anywhere else.",
    "Review 2": "Jeanie was super friendly and really good at her job. She threaded my eyebrows without hurting me. This is the first time ever that I have walked out of there without my eyebrows being bright red. I told her to keep them as thick as possible, and she gave me what I wanted. Thank you!",
    "Review 3": "Apparently I saw the worst person that works there because my experience was nothing like the previous reviews. The lady who thread my eyebrows did them way to thin and took off too much of the tail, talk about butcher shop. Thank goodness I can fill them in! Not sure I will return after this experience.",
    "Review 4": "I have been going to Royal Eyebrows threading for years now. I switched after another place cut my eyebrow. She is so gentle and they do an amazing job! Prices are perfect for the service and the facials are amazing too!",
    "Review 5": "Great local eyebrow threading place. Love the quality work they do here. They also give you a stamped card to receive a free service after multiple visits. Look at their services and prices.",
    "photo 1": "NA",
    "photo 2": "NA",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "",
    "name": "Sabira Eyebrow Threading",
    "site": "http://sabiraeyebrow.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14013289144",
    "full_address": "216 Willett Ave, Riverside, RI 02915",
    "city": "Riverside",
    "postal_code": "02915",
    "state": "Rhode Island",
    "latitude": "41.7751734",
    "longitude": "-71.3554613",
    "rating": "5",
    "reviews": "12",
    "working_hours": "Monday: 10 AM-5:30 PM, Tuesday: 2:30 PM-5:30 PM, Wednesday: 2:30 PM-5:30 PM, Thursday: 2:30 PM-5:30 PM, Friday: 10 AM-5:30 PM, Saturday: 10 AM-5 PM, Sunday: 10 AM-5 PM",
    "Review 1": "I just left with the perfect eyebrows.  Highly recommend",
    "Review 2": "Excellent service! Sabira did an awesome job on my eyebrows. I will be back.",
    "Review 3": "She does an excellent job. I came here on a whim and I was so surprised at how overtime she has gotten my eyebrows to fill out and become more even. The place is very clean and she is sweet and professional.",
    "Review 4": "Sabira does a great job. Love the shape of my eyebrows. I would definitely recommend her!",
    "Review 5": "If you want AMAZING eyebrows come here! She takes her time when doing my full face and my eyebrows come out perfect every time! I’m glad I took the chance to try this place out! Highly recommend ! 5++++++",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNiei8bu0rMs3O0JKlAOwyQIzIoaNoUSzTQiAQW=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNXTi7ueThRgPFuGGQAGmQchu89FJcsoFH48_Tq=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOnFcw_gf0X_HCOkridr-LhFol33zZcdYtwamaG=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPX5Xw0EI-N1uzaphtO28M5KydV-6h_u9TmiWPi=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14012283040",
    "full_address": "1003 Smith St, Providence, RI 02908",
    "city": "Providence",
    "postal_code": "02908",
    "state": "Rhode Island",
    "latitude": "41.8425639",
    "longitude": "-71.4446309",
    "rating": "4.2",
    "reviews": "93",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 10 AM-5 PM",
    "Review 1": "I had a membership which was great up until I needed to cancel it. I was moving out of state so I cancelled online ahead of time- but I was charged for the month. I decided to take the loss and go in one more time and informed them that I wanted to cancel due to me moving. I was told to email someone to cancel which I did immediately. The following month my card was charged again. I contacted every single location and told them I have cancelled online and emailed and they all told me that emailing was the best way to cancel. I contacted my bank at this point because it had been over a month of emailing and cancelling online and getting the run around with calling each location. My bank rectified the situation for that month and then again I find out this month I was charged AGAIN. At this point I had emailed multiple emails I was given, cancelled online multiple times and called and spoke to someone at every location with no resolution. I had to contact my bank again and request a new card because it it ridiculous that after multiple forms of communication I am still being charged for something I cant/no longer am using. Beware of getting a membership here because to cancel it is such a nightmare.",
    "Review 2": "Me and my wife go here all the time we have a membership Great service,I was wondering is this place the same as the one that just opened on Plainfield street?",
    "Review 3": "All of the workers are very nice, I love the energy and the vibes they give. The music is very soothing. And they always do such an amazing job!!! Definitely would recommend all of the ladies that work there!!❤️❤️",
    "Review 4": "My eye brows are completely different.. I did have a slight difference with the length but not shape previously. I’ve been coming here for a few months because it’s close to my house.. The technicians are usually okay and usually get the eyebrows fairly similar..but this time is way off.. honestly, I’ll probably never come back again. So disappointed.",
    "Review 5": "",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOt0rMZm2SGDAXJvvJnf1j0FZ5OSlG0PsnAB5oL=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMVcDFzQs0UcQO31k3DMq9CRll8ltVkjA4P00Vl=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMisTppLxGSP0Y5AXpkjhEQAda6MTJkrG_a1907=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPMFP3xA01QXwge4fR_tGFhVX8vcczsH750-jJ4=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread - Barrington",
    "site": "https://www.salonthread.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "14012892733",
    "full_address": "188 County Rd, Barrington, RI 02806",
    "city": "Barrington",
    "postal_code": "02806",
    "state": "Rhode Island",
    "latitude": "41.7373402",
    "longitude": "-71.3045838",
    "rating": "4.5",
    "reviews": "23",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Honestly, very kind tech. However, it took so long to have them done, she kept having to make adjustments and I felt a lack of confidence. I also feel as though they came out thinner than I had ever had them. Very kind, but not what I wanted or expected....",
    "Review 2": "Excellent monthly payment option with automatic deductions. Grupa was very nice and professional. My wife attends monthly and has always had exceptional results with Grupa. Tell them Sha from Australia sent you!",
    "Review 3": "So good to be back to RI. Stopped in tonight and signed up for the monthly threading membership. Feel excellent after getting my face threaded. Thank you Salon Thread! I'm feeling like a whole new person.",
    "Review 4": "Friendly and welcoming. Great service and thorough threading...never rushed. You can't beat the monthly plan. It is worth it for me since I have my full face threaded, including brows and lip, on a regular basis.  I can go as many times as I want for this service for 1 monthly fee. Highly recommend it.",
    "Review 5": "They are nothing short of amazing! This was my first threading experience and I couldn't have asked for better results! They listened to all my requests and gave great recommendations for future visits. My thin brows end up looking so much fuller and I don't have to fill them in with pencil anymore! I will never pick up a pair of tweezers again.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipMwg2uZ-xFc-IyVjDOSh6P4mEzl3EonOaS72bqT=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOPkO_SG3n5JfyW2QmETCLL4f9UpOoAehw5WROC=s680-w680-h510",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Salon Thread - Down City Providence",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14014210200",
    "full_address": "211 Weybosset St, Providence, RI 02903",
    "city": "Providence",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.8217288",
    "longitude": "-71.412597",
    "rating": "4.6",
    "reviews": "42",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "I’ve been coming here for years!! I have very thin light eyebrows that sometimes are a little unkempt in weird spots. I always get a perfect, long lasting medium brown tint that lasts about a month even with me washing and wiping my face all the time! She tidies up my brows perfectly without overdoing it- something most places do even with my already thin eyebrows!! I moved about an hour away and I still only come here! I only trust her with my eyebrows!",
    "Review 2": "This place is amazing! She is professional, and precise. I've been going there for almost 2 years, and have never been disappointed. Strongly recommend!!",
    "Review 3": "Love this place great service and Egypt is so nice she a beast at this eyebrows",
    "Review 4": "I have been going here for years. the lady that works is so nice, friendly and precise every single time I get my eyebrows threaded.",
    "Review 5": "Excellent threading, beautiful studio, nice clinician in Providence location. Their other locations were not comparable. Threading skills were fair at best. They certainly could have been more welcoming.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMf6XemYoyItAmXW9J2HjTZWkcnm7ffbSRUbtlg=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipO0ZC6Qa9slRSUiOoWiyirAopZsRgalwy_kGUxL=s680-w680-h510",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPBabLpXSL7M7w6uAP41qwawqtGdFsUMlsq0C06=s680-w680-h510",
    "name": "Salon Thread - Oak HIll",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14014759878",
    "full_address": "745 East Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.8573047",
    "longitude": "-71.3912019",
    "rating": "4.6",
    "reviews": "51",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Been coming here for yrs. Lol and will be till we move out of RI. When I find a good place for anything really I stick with it till I move or they disappoint.  But great service and always do me well. 👍🏽🙏🏽😊",
    "Review 2": "I was super happy that they opened after they were closed due to COVID. I was able to grow out my eyebrows during quarantine and they threaded them perfectly!! Not too thin and not too thick. Amazing!!😊 They’re the only place that I trust to get my eyebrows done! ☺️",
    "Review 3": "When I lived here 4.5 years ago, I always came here. They always did such a wonderful job. I just moved back to Providence, and went to get my eyebrows done and it was a horrible experience. Not only did she take one hair out at a time, she was extremely slow so it was very painful. She also didn’t listen to me, made my eyebrows too thin, then when I tried to ask her a couple questions at the end she didn’t understand what I was trying to say. So I left crying.Such a bad experience. I really loved it here and now that I live right down the street. It is more of a hassle to go to another place. But I’m definitely not coming back. Worst threading experience in my life. And I have been getting my eyebrows threaded for 10 years.",
    "Review 4": "Had a relaxing pedicure. Will go back again!",
    "Review 5": "Great place they do great eyebrows my favorite person who does amazing is pre she is friendly and kind does a great job on smith at and also Pawtucket location when she is there.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOmir4GIBiFGZ6KpzCD2oKs86HJqPh7-sM84-km=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipOmf4FPbE52ESVV_nwboRcTggPWaIAhy83psPVV=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNAt1Go65xXHryzSavZnVb7TIctfPWjOAMRkbzB=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPWUaux5bAGkwBOLUNjcOQxw1FrnYjB28S79MoV=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Salon Thread - The Threading Salon",
    "site": "https://www.salonthread.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14013057330",
    "full_address": "500 Mendon Rd #1a, Cumberland, RI 02864",
    "city": "Cumberland",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9211969",
    "longitude": "-71.4103726",
    "rating": "4.2",
    "reviews": "41",
    "working_hours": "Monday: 10 AM-7 PM, Tuesday: 10 AM-7 PM, Wednesday: 10 AM-7 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: Closed",
    "Review 1": "Hi ... I am so happy from this place the service I got done from the girl name Mona she did excellent job for my full face . She takes her own time to do the best I told my friends to go to Mona to get the same shape of my eyebrows. Thanks Mona to make me beautiful",
    "Review 2": "I absolutely love coming here to get my eyebrows threaded! Out of all the places I have been in the past, Salon Thread is the best one yet, Nilima does an amazing job!!!",
    "Review 3": "I have had a monthly membership with this establishment for over a year. At 17 dollars a month, I can go anytime I want, how often I want, and I always get service with a smile. In your membership, you also get free bottled water or cans of soda, plus there is a coffee machine if you so desire. Mona is my preferred eyebrow specialist as she is fantastic and makes sure there is not one hair out of place on my brows. In fact, I usually don't stop there unless I see her car parked outside. Not only does she treat me with respect, but, she also makes me feel welcomed and has this friendly vibe about her. I completely trust her with my eyebrows and that's a big deal to someone like me. I don't go anywhere else for this service! I highly recommend going at least once. I'm usually in an out within 5 minutes and there are so fast I've never spent more than 2 minutes waiting to be seen. If you're a first-timer, request Mona; you won't regret it. Two more things, there is always plenty of parking AND they are kid-friendly. They always address my 7 year old and give him a treat :) 10/10 I highly recommend!",
    "Review 4": "Today was my first time going to Threading Spot, Cumberland RI. I am absolutely AMAZED by the work and personality of Nilima. She did beautiful work to my awful eyebrows & treated me with the most respect. I recommend if you visit this location you make sure to see Nilima, you will leave 100% satisfied and wanting to come back!!!",
    "Review 5": "Nilima is extremely thorough with her threading techniques. She is receptive to feedback on the areas of focus and areas to avoid. I'm happy with the results after each session and enjoy having my monthly membership at this location as I get quality work done by Nilima while helping me save.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipODFB8n4iXsUJnRKgQtp1gA9sWBWrgW6-MnDz-Z=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Shubh Beauty",
    "site": "http://www.shubhbeauty.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14012801701",
    "full_address": "51 Silver Spring St #700, Providence, RI 02904",
    "city": "Providence",
    "postal_code": "02904",
    "state": "Rhode Island",
    "latitude": "41.8452529",
    "longitude": "-71.4164205",
    "rating": "4.4",
    "reviews": "15",
    "working_hours": "Monday: 10 AM-7:30 PM, Tuesday: 10 AM-7:30 PM, Wednesday: 10 AM-7:30 PM, Thursday: 10 AM-7:30 PM, Friday: 10 AM-7:30 PM, Saturday: 10 AM-7:30 PM, Sunday: 10 AM-5 PM",
    "Review 1": "Their work is amazing! Only place I go for my eyebrows to be threaded! Thank you ladies for your amazing work🙂",
    "Review 2": "I love the way my eyebrows look and I got lashes too this time and one of my lashes lifted up and they were very gracious about fixing it for me. I recommend going there ❤",
    "Review 3": "Do not  I repeat do not do your eyelashes extension with this company. They uses hair glue on your eyelashes 👀 which is not save. Soon he lady started doing my lashes my eyes started itching getting red and my nose started runny itchy. I saw the black hair glue which they wrapped a brown paper on to cover the hair glue label.  When I asked, if she was using hair glue on my eyelashes, she said no. Smh I paid $35 for nothing 😒 😪 I took off the lashes right away.  Why use hair glue on someone eyes 👀 🤔",
    "Review 4": "Got my eyebrows wax by Mrs. Nikki, she was very friendly and kind and I would recommend her any time.Donawea",
    "Review 5": "Don't go here if you're getting waxed. As they were waxing (Brazilian wax) I looked over and saw she was double dipping directly into the wax pot. When I brought it to their attention they said I was the \"first\" wax of the day but it was 4 pm and I had just seen a woman leave the room before me. Long story short they are unsanitary and don't take the time to perform safe hygiene on their clients. The owner even mentioned that her employee was new and normally they don’t do that, however even after admitting that they would still not give me a refund. You're better off spending more money at a reputable place that is safe.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMkUgoz36d6oHNqEE_91chuGM74abdz6uIuWxoE=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPszfZAzBmCRwEVG_799IcYHbO-PfNoMAfags5s=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPAuhCvd4HecYxZgTlia9NQo5vbLo4BXCsN8yoJ=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipN3XO4mZcngkCxCmQ0c8JOdkMp6noYn1wTUjJGg=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipPzi7B6x7cihnrpHLv7jzerpBLiBit89QDrWZxW=s680-w680-h510",
    "name": "Smiley Eyes Eyebrow Threading",
    "site": "http://smileyeyethreading.com/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-347-5098",
    "full_address": "774 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.653889",
    "longitude": "-71.454585",
    "rating": "4.9",
    "reviews": "244",
    "working_hours": "Monday: 11 AM-6:30 PM, Tuesday: 10 AM-6:30 PM, Wednesday: 10 AM-6:30 PM, Thursday: 10 AM-6:30 PM, Friday: 9:30 AM-6:30 PM, Saturday: 9:30 AM-6:30 PM, Sunday: Closed",
    "Review 1": "I have never had such a positive experience with eyebrow threading! I was in and out in 10 minutes and I feel like I look amazing. Plus, it barely even hurt compared to previous experiences.",
    "Review 2": "The women who work there are amazing. Sarah gave me excellent advice and great service. I would recommend this business",
    "Review 3": "So friendly every time I go and I bring my friends with me to get theirs done too! They always give helpful tips and suggestions! Reasonable price as well!",
    "Review 4": "Smiley eyes is my happy place. Priya and her staff are experienced perfectionists who offer threading, eyebrow & eyelash tinting, waxing and more. The salon is conveniently located, offers parking, and is extremely clean.",
    "Review 5": "I love going here for my brows. I get different people sometimes and even then everyone seems to know what they’re doing in that department. Plus, I love their cashapp rewards and the digital system they have for payment in general. I read earlier reviews about rude customer service and I never experienced that. Maybe it’s because I am usually too shy to strike up conversation but even when they do happen everyone is really polite. So next time you decide to go somewhere that charges 2x for brows like Ulta, don’t. Support small businesses and go here. Make sure to tip.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPLsTXrTgT_0hwZxnQHZPM0lnvj_vS8rBIQlY6o=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNZcEvOUhLK0eE99JwxMQCp8JXkfb9GBgBMai_y=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNPehEzvLEvgkRi-Ksh7ZwtiLvX_IZnaq8izJyh=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipMLMBred0MY1AXN-ZhZc_utLU5hgOYErydBqp6l=s680-w680-h510"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipNkhvRoUy-RHPJEzoow592RYEsulYUysXKGodch=w141-h101-n-k-no-nu",
    "name": "Stupa Threading",
    "site": "https://stupa-threading.business.site/",
    "type": "Beauty salon",
    "category": "Beauty salon",
    "phone": "+1 401-885-1132",
    "full_address": "26 Main St, East Greenwich, RI 02818",
    "city": "East Greenwich",
    "postal_code": "02818",
    "state": "Rhode Island",
    "latitude": "41.6636042",
    "longitude": "-71.4498224",
    "rating": "4.8",
    "reviews": "29",
    "working_hours": "Monday: 10 AM-5 PM, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-7 PM, Friday: 10 AM-7 PM, Saturday: 10 AM-7 PM, Sunday: 10 AM-5 PM",
    "Review 1": "The staff are always friendly. They even give advice and tips when your done with the session! I will always come here!!",
    "Review 2": "Been going here since they opened.  Fantastic shop.  Quick and easy.   Always find parking during the day right in front.",
    "Review 3": "I have been there yesterday ,really she did with lots of patience.I decided not to go anywhere except here. Finally I can say this is best in RI.",
    "Review 4": "My daughter and I have tried several local threading places and this one is by far the best. Our eyebrows have never looked better!",
    "Review 5": "This the BEST place for threading in the state. I have tried a few and believe this one is the best because of the friendliness of staff, cleanliness of the studio, and the service is consistently excellent. Thank you Stupa for your affordable membership!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPPIqEaNYIzPgkEatMew_INM2L2F8OaHRkKDck7=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPwo91Fm8NQ81cc3PquTkUPssO6D1rzle3fYeaI=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipMW7NFP-RGJEfy3MiFZ8OYozTt3PG1ipa3G408b=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNzuWe_IgpO2ABZsAGOD55oI-Ek6Ynm-2z3a_Kl=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017286637",
    "full_address": "85 Power Rd, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "02860",
    "state": "Rhode Island",
    "latitude": "41.862287",
    "longitude": "-71.4124361",
    "rating": "4.5",
    "reviews": "212",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "Love this place. I recommend Sukhy she’s the ONLY one I trust with my brows. If she’s not there I’m not coming! Brow tinting is on point too!",
    "Review 2": "I love this place,everytime I come I leave with more than just brows done. DEB IS MY GIRL!!",
    "Review 3": "Because I came here for the first time and I’ve never been treated that bad… owner was straight up rude. And kept twisting and turning my head during the threading. She asked about the color I wanted for my tint and I wasn’t sure…. She walked away and left me sitting there . I’ll never be back here and I hope my friends stop using this business also. Very unfriendly and unprofessional for a beauty business. Never again",
    "Review 4": "i have a bad experience every time i go each eyebrow comes out different and never looks the same i tell the person to fix it and they still don’t look the same i will not be coming back to this place",
    "Review 5": "First of all I don’t really review but I have to for them.. Honestly, I’ve been going to Suhky’s for years and they never fail. I can say I’m so picky when it comes to my eyebrows because I don’t know how to do makeup so what’s on my face is stuck until the next time.. SHE SLAYS EVERYTIME!!! The shape, the arch, the thinness. ETC. I tell everyone to go there and I forever will!! Mind you the pictures added are from 2016. 2019. And 2022. QUALITY.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPodl0x4JP5hb5d02PBhsD1hzioq-gId_iTwg7_=s680-w680-h510",
    "photo 2": "https://lh5.googleusercontent.com/p/AF1QipNLA8N0KDl7lVd-tisUYzD_DQfiFuGAg9ISd1K7=w141-h176-n-k-no-nu",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNPl6mL09tt0TiNtlqnd9R69o5tBn-Xhd8TicTe=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPqYan_O1EjvZD_yRqKCYvRGSBXuVVk5paXMatx=s680-w680-h510"
  },
  {
    "photo 5": "",
    "name": "Sukhy' Threading",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "14017380150",
    "full_address": "1535 Post Rd, Warwick, RI 02886",
    "city": "Warwick",
    "postal_code": "02886",
    "state": "Rhode Island",
    "latitude": "41.739275",
    "longitude": "-71.4334028",
    "rating": "4.5",
    "reviews": "59",
    "working_hours": "Monday: Closed, Tuesday: 9 AM-6 PM, Wednesday: 9 AM-6 PM, Thursday: 9 AM-6 PM, Friday: 9 AM-6 PM, Saturday: 9 AM-6 PM, Sunday: Closed",
    "Review 1": "This is the best place around. Eyebrows for $10 is so cheap and they do such a great job. The girl who did mine was so nice, did a great job, and it didn't even hurt. Best threading of my life. I highly recommend it.",
    "Review 2": "Do not waste your time here. With so many other threading places, do yourself a favor and look elsewhere. First and last time coming here. They do not know the art of eyebrow shaping, nor how to shape a thick eyebrow. You get what you pay for, and if you care about your eyebrows and how they look, pay an extra $5 more and you will be much more satisfied.",
    "Review 3": "Excellent threading by a phenomenal & friendly staff.",
    "Review 4": "Good work but not such a fan of them asking for the tip in cash. I don't always carry cash but the women even asked me to go check me car 🙄.",
    "Review 5": "I told her as soon as I sat in her chair that I was trying to grow out my eyebrows and just wanted them cleaned up and realized it was taking her quite a bit to do. She told me one eyebrow was different than the other, which I had told her I have been working on letting them fill in and she ended up reshaping them and getting rid of the growth I had. I wouldn’t recommend especially when you ask for a specific request of just cleaning them up.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipNUYxYLPgqado1fLDfPMv7_8jYtPziJpJYxaFDM=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipObi0iQ446EmsqF9cZN9UhE4C1w5ipSGUf8CsZ5=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipNClUeyztmSDpNGg8a8fVeji5rI7V6KcWB9aIj-=s680-w680-h510",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Sukhy's Threading Johnston",
    "site": "http://www.sukhysthreading.com/",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "1 401-649-4275",
    "full_address": "1417 Atwood Ave, Johnston, RI 02919",
    "city": "Johnston",
    "postal_code": "02919",
    "state": "Rhode Island",
    "latitude": "41.818990",
    "longitude": "-71.496870",
    "rating": "4.3",
    "reviews": "38",
    "working_hours": "Wednesday: 9 AM–6 PM, Thursday: 9 AM–6 PM, Friday: 9 AM–6 PM, Saturday: 9 AM–6 PM, Sunday: Closed, Monday: Closed, Tuesday: 9 AM–6 PM",
    "Review 1": "Horrible experience. The girl I had was soo rude. All she did was talk the whole time she did my brows.  The left one ended up smaller than the right and I had to fill it in.  So rude I will NEVER go there again.  I will tell all my friends to NEVER step foot in there.  RUDE !!",
    "Review 2": "I went today to get my eyebrows done and unfortunately I won’t be returning. Not once but twice they messed up my brows.  This time I got two different shapes.  It’s not first time time they have done them there before but the last two ladies it’s not know what they aware doing.  I have the shape all you have to do is clean around them.  Sorry but won’t be returning.    1/17/ 2020 After an unfortunate visit I surprised, the owner reached out and wanted to know what happed.  Glad she reached out And fixed my eyebrows.  I will return to her location thank you!",
    "Review 3": "I've never been to this location usually go to the Pawtucket one but the same ladies work in all of them. There was only one woman there but she was quick and efficient never left anybody waiting more than a few minutes. I went for a threading and tint, she was gentle thank God cuz a couple of them... mannn... and she did a okay job on them. tbh there's only one lady that gets my brows exactly the way I like them but I go there like once every couple months just to remind me where to pluck, n I don't see her much so I always forget her name.",
    "Review 4": "This place is very clean and tidy! They do a beautiful job with the threading and they come out perfectly even each time! Their pricing is also very fair. I highly recommend!",
    "Review 5": "I was reading someone’s review and I had the exact same experience my eyebrows got messed up two different shapes. I always have to let them regrow before I can go back hoping this time they won’t get messed up. Sadly they do. Some might ask why do I keep going there; because I went there before and this lady did a great job hope to find her there again. Anyways I saw that the owner reached out to the lady and did them her self hopefully she’ll see this and reach out!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMchjv-Lc0pMGFmXcypJv-0Rpn3njtq2G57IYN6=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "",
    "name": "Unique Eyebrow Threading",
    "site": "N/A",
    "type": "Hair removal service",
    "category": "Hair removal service",
    "phone": "+1 401-405-0787",
    "full_address": "3335 Mendon Rd, Cumberland, RI 02864",
    "city": "Cumberland",
    "postal_code": "02864",
    "state": "Rhode Island",
    "latitude": "41.9766672",
    "longitude": "-71.4580152",
    "rating": "4.6",
    "reviews": "172",
    "working_hours": "Monday: Closed, Tuesday: 10 AM-6 PM, Wednesday: 10 AM-6 PM, Thursday: 10 AM-6 PM, Friday: 10 AM-6 PM, Saturday: 10 AM-6 PM, Sunday: 10 AM-2 PM",
    "Review 1": "Completely shocked at how I was just treated by the older woman who works here. I’m from out of state looking to get my brows done and this place had good reviews. They woman asked what shape and I said please just clean them up and keep them thick as possible. She said your eyebrows are different shape and sizes. Made me feel uncomfortable and not very nice. I said I’m sorry that’s how they grow.. she was very condescending. Then when I was done she asked me to look in the mirror and my eyes were watery (as they always are bc I have contacts and holding my eyes) so she asks if she made me cry?? Very odd experience. Then she rung me out- I didn’t feel like tipping but I gave less than I would have. Will not return. As a small business owner- it would be nice to treat people nicely. So many other nice businesses out there that I would rather spend money on:/",
    "Review 2": "I love coming here to clean my eyebrows. Very affordable, make sure to bring cash or use an onsite ATM",
    "Review 3": "I have been going here for over 10 years. They do an absolutely amazing job. I hate to write negative things on this business because I really do love them but the younger girl needs a little bit more training -it absolutely kills when she threads my eyebrows. They still look very nice though but i would prefer the two other women that have been here for years",
    "Review 4": "I don’t ever write reviews, but I just have to share that I have been visiting unique eyebrow threading since they opened in 2007. I would never think of going anywhere else but here. The staff is amazing and I just love the owner! I always walk out happy and my eyebrows and my lip come out perfect every single time!! If you are thinking about going to get your eyebrows threaded believe me it is much better than waxing and plucking like I do sometimes when I don’t have time lol this is the absolute best place to get services!",
    "Review 5": "I like going to the older lady in the first chair I’m not sure if she’s the owner but she always does an excellent job. The few times I’ve went to the younger girl in the second chair she messed up my eyebrows and had me in the chair for under a minute before she told me that I was done. I mentioned clean up only and not too thin and always leaves them super thin or a completely different shape from one another  because she rushes.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipN2LxJIrmiwuddmujdRY6XvIFU_Z7E7WTm8JSc5=s680-w680-h510",
    "photo 2": "",
    "photo 3": "",
    "photo 4": ""
  },
  {
    "photo 5": "NA",
    "name": "Salon Thread",
    "site": "https://www.salonthread.com//",
    "type": "Beauty Parlour",
    "category": "Beauty Parlour",
    "phone": "(401) 320-8484",
    "full_address": "787 Bald Hill Rd, Warwick, RI 02886",
    "city": "Warwick",
    "postal_code": "02886",
    "state": "Rhode Island",
    "latitude": "41.716940",
    "longitude": "-71.487270",
    "rating": "5",
    "reviews": "16",
    "working_hours": "Wednesday: 10 AM–7 PM, Thursday: 10 AM–7 PM, Friday: 10 AM–7 PM, Saturday: 10 AM–7 PM, Sunday: Closed, Monday: 10 AM–7 PM, Tuesday: 10 AM–7 PM",
    "Review 1": "She is amazing! I went to her first for my brow lamination & tint, she did such an AMAZING job I had to go back for microblading and she did my eyebrows so perfect!!!! She did Hybrid Brows on me & I am VERY SATISFIED . Thanks so much ! I loveee them. The procedure wasn't painful at all and I experienced no swelling or irritation afterwards. She is a perfectionist. Book with her for your brows !!! I'm so picky when it comes to who I let do my brows She knows how to shape to frame your face. She knows what she is doing. Only person who I'm letting touch my brows from now on. Thanks She!",
    "Review 2": "She did a baby liner for me and it turned out perfect and looks super natural. The process was painless. I’m so amazed at She’s work and I’m so happy I treated myself to this. This will save me 10 mins each morning since I’m terrible at drawing on eyeliner. Highly recommend",
    "Review 3": "My Girlfriend booked a Microblading appointment. We walked in to a professional new salon space. She decided to to try Eyebrow threading and Lash Lift before her Microblading service. The results were excellent and was quick. Microblading took some time but wow what a difference in her brows! Both the technicians (Lash and Microblading) did a fine job. My girlfriend also signed up for their Unlimited monthly membership.",
    "Review 4": "She is amazing! I went to her first for my brow lamination & tint, she did such an AMAZING job I had to go back for microblading and she did my eyebrows so perfect!!!! She did Hybrid Brows on me & I am VERY SATISFIED . Thanks so much ! I loveee them. The procedure wasn't painful at all and I experienced no swelling or irritation afterwards. She is a perfectionist. Book with her for your brows !!! I'm so picky when it comes to who I let do my brows She knows how to shape to frame your face. She knows what she is doing. Only person who I'm letting touch my brows from now on. Thanks She!",
    "Review 5": "I come here regularly for lash extensions and eyebrow lamination, and I confirm their service is detail oriented and 100% satisfactory. The results always leave me in a good mood for the rest of the month, and the service is also very relaxing and enjoyable. Highly recommend!!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMqfkKuDftqIrB-8Y-4irPprFWP-qCzj1yk0yOj=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPQ1pPVyiRZewijRoNaJGtl8jonhEglFVHenxyH=s680-w680-h510",
    "photo 3": "NA",
    "photo 4": "NA"
  },
  {
    "photo 5": "https://lh5.googleusercontent.com/p/AF1QipPcPF50VlmlPiQkmgC_wlAaudHQG1Po5nC4j0mw=w141-h176-n-k-no-nu",
    "name": "I Thread And Lash Spa - Providence , RI",
    "site": "https://squareup.com/appointments/book/e973ydqkjhhewc/LAWM4R0YRCHXM/services?rwg_token=ADQ7psR3YppRdethaFTmHLFh8IFptJswnySyUllExoIehnMU225ERaZvAAf7Am8tu7rKTkSbqBKFAw-zYN6V-8X5kNeNArQc_Q%3D%3D",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 215-5243",
    "full_address": "1 Providence Pl store # 5020, Providence, RI 02903",
    "city": "Providence",
    "postal_code": "02903",
    "state": "Rhode Island",
    "latitude": "41.827600",
    "longitude": "-71.416190",
    "rating": "4.6",
    "reviews": "206",
    "working_hours": "Wednesday: 11 AM–8 PM, Thursday: 11 AM–8 PM, Friday: 10 AM–9 PM, Saturday: 10 AM–9 PM, Sunday: 11 AM–6 PM, Monday: 11 AM–8 PM, Tuesday: 11 AM–8 PM",
    "Review 1": "I was in a hurry to get primped for a job and came to I Thread and Lash Spa. I was greeted by the door and once I communicated what services I wanted it was done with quick precision and the lashes came out beautifully and my lash shape and tint are absolutely stunning. I am a permanent client now I'm in love with my eyebrows.",
    "Review 2": "This was the best experience I have ever had! She was able to not only fix the shape of my eyebrows from a wax experience gone wrong but gave me a beautiful shape and eyelashes. I have never gotten so many compliments. Recommended her to all of my friends and family! Also super sweet and really great results.",
    "Review 3": "I henna dyed my eyebrows here today and they turned out great. The technician was quick & professional.",
    "Review 4": "Everyone was soo friendly and the service is top tier. I will be coming back. The first photo is right out the salon the second photo is day two",
    "Review 5": "i was super nervous about getting my eyebrows done since this was my first time threading my eyebrows. i absolutely love how they came out! i was in and out and the manger was super patient with me. i love their business and will continue going to get my eyebrows threaded by them. i also got my henna done for the first and i love it.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipOt2GLw6lNgu9PthdCZqQKqaRAkLM0jBHa_g_pf=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNYvqJUpKrtTNAL0wDlJgvXW_Rmhf4BM-zXEvgS=s680-w680-h510",
    "photo 3": "https://lh5.googleusercontent.com/p/AF1QipMuvIEIZd1T-jDrHNLzTjsr-bpbhXVbGoTAnLit=w141-h118-n-k-no-nu",
    "photo 4": ""
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipOa--eCLzE0M4swmdbyj1990nHS2fdkuM7iVaGg=s680-w680-h510",
    "name": "Renu Eyebrow Threading",
    "site": "N/A",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 921-3101",
    "full_address": "2443 W Shore Rd, Warwick, RI 02889",
    "city": "Warwick",
    "postal_code": "02889",
    "state": "Rhode Island",
    "latitude": "41.700990",
    "longitude": "-71.438450",
    "rating": "3.6",
    "reviews": "42",
    "working_hours": "Wednesday: 10:30 AM–6 PM, Thursday: 10:30 AM–6 PM, Friday: 10:30 AM–6 PM, Saturday: 10:30 AM–5 PM, Sunday: Closed, Monday: Closed, Tuesday: 10:30 AM–6 PM",
    "Review 1": "My go to spot! The threading lady did a great job on my eyebrows. However, there was a language barrier that was a bit tough to get around. But, if you do show a picture of what you want or explain more throughly, she will do a great job!!",
    "Review 2": "The women working was super nice! While there is a language barrier I showed her a picture of what I wanted and she matched it. She also checked in during the process to make sure I was happy :) With this service and price you cannot get anything better!!!",
    "Review 3": "They are so kind and very people-oriented :) love this spot :)))",
    "Review 4": "I love that this place is in my neighborhood - it's so convenient! The owner is very nice and does a great job. The prices are actually too cheap - I worry she won't be able to stay in business and I love having a salon for threading so close! Definitely recommend!",
    "Review 5": "I've been driving past this place for a long time and, today I decided to give it a try. I'm so glad I did! I read some other reviews and made sure I had a picture of how I wanted my brows to look. The woman did an excellent job and the pricing is GREAT!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMhFma5DSSmYA4IxnJDK6dSdKodK4UCEYw2nsA4=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipNdFj9yc4XrhVZvcydmxOsxe2RKw6hTQVRMiSM3=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipPA-0cRNTIvCzT-MikRs8CDB2DpIl7Ykv9CJWvE=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipON0PAtyzuStYXizJ7MJdb6JDJbRWquQEDhEo8v=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNygUltuF0NlavzrlYxUrrkF66GENlT-qoqTJGE=s680-w680-h510",
    "name": "Salon Panache",
    "site": "https://www.salonpanache.com/",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 464-4044",
    "full_address": "1103 Park Ave, Cranston, RI 02910",
    "city": "Cranston",
    "postal_code": "2910",
    "state": "Rhode Island",
    "latitude": "41.784980",
    "longitude": "-71.455240",
    "rating": "4.7",
    "reviews": "239",
    "working_hours": "Wednesday: 9 AM–7 PM, Thursday: 9 AM–7 PM, Friday: 9 AM–7 PM, Saturday: 9 AM–6 PM, Sunday: Closed, Monday: Closed, Tuesday: 9 AM–6 PM",
    "Review 1": "I luv coming here. Ria is amazing. She definitely knows what she's doing and doesn't cut off half of your eyebrow lol",
    "Review 2": "I visit this place atleast once a month! I’m from CT but The trip to Panache is worth the results ❤️ The staff is super sweet and quick! Thank you Panache for making my eyebrows always look on point :)",
    "Review 3": "Very friendly got in and out very quickly, very reasonably priced",
    "Review 4": "I’ve been going here for about 8 years now and I’ve never been disappointed. The staff is very friendly and all are very talented in their skill. I used to have Kelly do my eyebrows until she moved but now I have Ria and she is wonderful. Definitely would recommend!",
    "Review 5": "I usually go to Ravy’s beauty salon for eyebrows but decided to go here because they open later.. & ugh so rude.. I told the technician to cut my eyebrows first before threading she had the biggest attitude.. she threaded my eyebrows and then cut… I have very hairy/long eyebrows. I left with nothing. I never had anyone do my eyebrows under 10 minutes smh.. the owner seems very nice. But has horrible technicians",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMxZIKXyg2Nia2IG6zfCBxQWRzkyfdr37D4dzP7=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPq0f4bPuXvn4dO7-bM9aFj7ZtZ87jXoEsmWqmW=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOJ9vcgjNxf1YfSkPbhWZ2Aldv2dyJq63XZ3jFa=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipPIX2s3a-FqfiT7xsOgVKOBQnyle1fYa0BU0_Ba=s680-w680-h510"
  },
  {
    "photo 5": "https://lh3.googleusercontent.com/p/AF1QipNQU8nk1VFfS9SBMLvo9DrqYL6wlTJAB0BGKuWl=s680-w680-h510",
    "name": "Eyebrows First",
    "site": "N/A",
    "type": "Beauty Salon",
    "category": "Beauty Salon",
    "phone": "(401) 569-9934",
    "full_address": "957 Namquid Dr, Warwick, RI 02888",
    "city": "Warwick",
    "postal_code": "2888",
    "state": "Rhode Island",
    "latitude": "41.741790",
    "longitude": "-71.395150",
    "rating": "5",
    "reviews": "12",
    "working_hours": "Wednesday: 9 AM–6 PM, Thursday: 9 AM–6 PM, Friday: 9 AM–6 PM, Saturday: 9 AM–6 PM, Sunday: 9 AM–4 PM, Monday: Closed, Tuesday: 9 AM–6 PM",
    "Review 1": "My eyebrows and I have been on a crazy journey together for the last 20 years between shaving, waxing, plucking to threading. Sometimes they look good and sometimes I leave with no eyebrows at all, until now. I am so happy to have found this hidden gem. My eyebrows are absolutely perfect, and I leave more confident than before. I loved coming here so much I signed up for the monthly memberships and now get my whole face threaded. I highly recommend coming here to for all your threading needs.",
    "Review 2": "Polite staff. Cleanly inside. Fast service. My eye brows were horrendous mess and they cleaned it up nice 👍",
    "Review 3": "Very comforting and really good hospitality. Happy to be a customer on first opening day. 🤩",
    "Review 4": "Very comforting and really good hospitality. Happy to be a customer on first opening day. 🤩",
    "Review 5": "Finally ! I found a best place for my eyebrows threading near me…happy eyebrows🤗 happy me😍.The owners are friendly and polite. Very organized, comfortable and clean salon. The prices are reasonable and the service is amazing.They offer monthly membership with unlimited monthly services at just $17.The threading did not hurt at all😊.It’s worth the drive from anywhere in this fabulous place. Wouldn’t go anywhere else!Highly recommended!!!",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipPP7LE6xb9EAYDWwEkDpGQ2VwxPE3J0c1nUE4Qv=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPBFlKeO5gzwMN8Ozl1FhqCfPoQCKRk5-Pm1E7O=s680-w680-h510",
    "photo 3": "https://lh3.googleusercontent.com/p/AF1QipOC4BHXzF05LdlGKOKtAzYI8d5Y9xDkC8taL8Hp=s680-w680-h510",
    "photo 4": "https://lh3.googleusercontent.com/p/AF1QipNgT0ng3iAh_QLiLNZ9e-pjGRQT5G_rJfUwtvK0=s680-w680-h510"
  },
  {
    "photo 5": "NA",
    "name": "Tara's Threading & Hair Salon",
    "site": "https://www.facebook.com/TarasSalon",
    "type": "Hair Salon",
    "category": "Hair Salon",
    "phone": "(401) 729-0331",
    "full_address": "572 Smithfield Ave, Pawtucket, RI 02860",
    "city": "Pawtucket",
    "postal_code": "2860",
    "state": "Rhode Island",
    "latitude": "41.880310",
    "longitude": "-71.415690",
    "rating": "4.6",
    "reviews": "82",
    "working_hours": "Wednesday: 9 AM–7 PM, Thursday: 9 AM–7 PM, Friday: 9 AM–7 PM, Saturday: 9 AM–6 PM, Sunday: Closed, Monday: Closed, Tuesday: 9 AM–7 PM",
    "Review 1": "Great customer service! Tara is amazing been going to her for over 12 years love her",
    "Review 2": "I was very happy with her service and my eye brows look so good!",
    "Review 3": "Tara was amazing and did an amazing job with my eyebrows! I can't wait to go back!",
    "Review 4": "I highly recommend Tara for all your beauty needs!One on one. She gives you Full uninterrupted service n puts her heart into her work; Excellent eyebrow shaper! Convenient walk in..great hair stylist as well.peaceful,relaxing atmosphere!",
    "Review 5": "I went here for first time to get a haircut and eyebrow threding. Tara did a great job and explained the style that suits me. I liked the layers and love my hair now. She did amazing job with my eyebrows. They are beautiful. I recommend to all around the area.",
    "photo 1": "https://lh3.googleusercontent.com/p/AF1QipMReA7UfDybOdY7qE6zKx6lEjszwBbt9SxF-eOA=s680-w680-h510",
    "photo 2": "https://lh3.googleusercontent.com/p/AF1QipPtccyApU5vuhPtdFoIrluBI6QQEMMe5CWPijQN=s680-w680-h510",
    "photo 3": "NA",
    "photo 4": "NA"
  }
]
